*** crates/pstore-blob/src/accounting.rs:75:9: replace Accounted<S>::total -> u64 with 1

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace Accounted<S>::total -> u64 with 1
@@ -67,17 +67,17 @@
             .get(&(tenant, class))
             .copied()
             .unwrap_or(0)
     }
 
     /// Requests of `class` across every tenant.
     #[must_use]
     pub fn total(&self, class: OpClass) -> u64 {
-        self.lock().totals.get(&class).copied().unwrap_or(0)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     fn lock(&self) -> std::sync::MutexGuard<'_, Counters> {
         self.counters
             .lock()
             .unwrap_or_else(std::sync::PoisonError::into_inner)
     }
 }

---- accounting_is_per_tenant stdout ----

thread 'accounting_is_per_tenant' panicked at crates/pstore-blob/tests/accounting.rs:75:5:
assertion `left == right` failed
  left: 1
 right: 4

failures:
    accounting_is_per_tenant

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
