*** crates/pstore-blob/src/accounting.rs:93:9: replace Accounted<S>::bytes -> u64 with 0

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace Accounted<S>::bytes -> u64 with 0
@@ -85,21 +85,17 @@
 
     /// Bytes of `class` billed to `tenant`.
     ///
     /// A `head` moves no body and adds nothing here: counting it as the object's size
     /// would make a metadata probe look like a full fetch and hide the exact difference
     /// the design turns on.
     #[must_use]
     pub fn bytes(&self, tenant: TenantId, class: OpClass) -> u64 {
-        self.lock()
-            .bytes_per_tenant
-            .get(&(tenant, class))
-            .copied()
-            .unwrap_or(0)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Starts recording the byte ranges of every read.
     ///
     /// Off by default: a long-running store would grow this without bound, and it exists
     /// for assertions rather than for production accounting.
     pub fn record_ranges(&self) {
         self.lock().ranges.get_or_insert_with(Vec::new).clear();

---- bytes_are_counted_not_just_requests stdout ----

thread 'bytes_are_counted_not_just_requests' panicked at crates/pstore-blob/tests/accounting.rs:109:5:
assertion `left == right` failed
  left: 0
 right: 1000

failures:
    bytes_are_counted_not_just_requests

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
