*** crates/pstore-blob/src/accounting.rs:123:9: replace <impl crate::BlobStore for TenantView<S>>::get_tag -> Option<pstore_types::CasTag> with None

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace <impl crate::BlobStore for TenantView<S>>::get_tag -> Option<pstore_types::CasTag> with None
@@ -115,18 +115,17 @@
     }
 
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
         self.bill(OpClass::Read);
         self.inner.get_range(key, range).await
     }
 
     async fn get_tag(&self, key: &Key) -> Option<pstore_types::CasTag> {
-        self.bill(OpClass::Read);
-        self.inner.get_tag(key).await
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {
         self.bill(OpClass::Read);
         self.inner.head(key).await
     }
 
     async fn put(&self, key: &Key, body: Bytes) -> Result<PutOutcome, BlobError> {

*** result: Success
