*** crates/pstore-blob/src/coalesce.rs:29:60: replace < with > in coalesce

*** mutation diff:
--- crates/pstore-blob/src/coalesce.rs
+++ replace < with > in coalesce
@@ -21,17 +21,17 @@
 
 /// Plans the fetches for `ranges`, merging any two whose gap is below `gap`.
 ///
 /// Empty ranges are dropped. The result never contains more fetches than there were
 /// ranges, and every non-empty range is served by exactly one fetch.
 #[must_use]
 pub fn coalesce(ranges: &[Range<u64>], gap: u64) -> Vec<Fetch> {
     let mut idx: Vec<usize> = (0..ranges.len())
-        .filter(|i| ranges.get(*i).is_some_and(|r| r.start < r.end))
+        .filter(|i| ranges.get(*i).is_some_and(|r| r.start > /* ~ changed by cargo-mutants ~ */ r.end))
         .collect();
     idx.sort_by_key(|i| ranges.get(*i).map(|r| r.start).unwrap_or(0));
 
     let mut out: Vec<Fetch> = Vec::new();
     for i in idx {
         let Some(r) = ranges.get(i) else { continue };
         match out.last_mut() {
             // `saturating_sub` because a later range may be *inside* the current span,

---- coalesce::tests::empty_ranges_are_dropped stdout ----

thread 'coalesce::tests::empty_ranges_are_dropped' panicked at crates/pstore-blob/src/coalesce.rs:71:9:
assertion `left == right` failed
  left: 0
 right: 1

---- coalesce::tests::a_contained_range_does_not_underflow_the_gap stdout ----

thread 'coalesce::tests::a_contained_range_does_not_underflow_the_gap' panicked at crates/pstore-blob/src/coalesce.rs:78:9:
assertion `left == right` failed
  left: 0
 right: 1

---- coalesce::tests::a_zero_gap_merges_only_touching_ranges stdout ----

thread 'coalesce::tests::a_zero_gap_merges_only_touching_ranges' panicked at crates/pstore-blob/src/coalesce.rs:88:9:
assertion `left == right` failed: gap 0 disables merging
  left: 0
 right: 2

failures:
    coalesce::tests::a_contained_range_does_not_underflow_the_gap
    coalesce::tests::a_zero_gap_merges_only_touching_ranges
    coalesce::tests::empty_ranges_are_dropped

test result: FAILED. 1 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
