*** crates/pstore-blob/src/accounting.rs:138:9: replace <impl crate::BlobStore for TenantView<S>>::head -> Result<u64, BlobError> with Ok(1)

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace <impl crate::BlobStore for TenantView<S>>::head -> Result<u64, BlobError> with Ok(1)
@@ -130,18 +130,17 @@
     }
 
     async fn get_tag(&self, key: &Key) -> Option<pstore_types::CasTag> {
         self.bill(OpClass::Read);
         self.inner.get_tag(key).await
     }
 
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {
-        self.bill(OpClass::Read);
-        self.inner.head(key).await
+        Ok(1) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn put(&self, key: &Key, body: Bytes) -> Result<PutOutcome, BlobError> {
         self.bill(OpClass::Write);
         self.inner.put(key, body).await
     }
 
     async fn put_conditional(

---- accounting_separates_read_write_and_list_classes stdout ----

thread 'accounting_separates_read_write_and_list_classes' panicked at crates/pstore-blob/tests/accounting.rs:51:5:
assertion `left == right` failed
  left: 2
 right: 3

failures:
    accounting_separates_read_write_and_list_classes

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
