*** crates/pstore-blob/src/coalesce.rs:29:60: replace < with <= in coalesce

*** mutation diff:
--- crates/pstore-blob/src/coalesce.rs
+++ replace < with <= in coalesce
@@ -21,17 +21,17 @@
 
 /// Plans the fetches for `ranges`, merging any two whose gap is below `gap`.
 ///
 /// Empty ranges are dropped. The result never contains more fetches than there were
 /// ranges, and every non-empty range is served by exactly one fetch.
 #[must_use]
 pub fn coalesce(ranges: &[Range<u64>], gap: u64) -> Vec<Fetch> {
     let mut idx: Vec<usize> = (0..ranges.len())
-        .filter(|i| ranges.get(*i).is_some_and(|r| r.start < r.end))
+        .filter(|i| ranges.get(*i).is_some_and(|r| r.start <= /* ~ changed by cargo-mutants ~ */ r.end))
         .collect();
     idx.sort_by_key(|i| ranges.get(*i).map(|r| r.start).unwrap_or(0));
 
     let mut out: Vec<Fetch> = Vec::new();
     for i in idx {
         let Some(r) = ranges.get(i) else { continue };
         match out.last_mut() {
             // `saturating_sub` because a later range may be *inside* the current span,

---- coalesce::tests::empty_ranges_are_dropped stdout ----

thread 'coalesce::tests::empty_ranges_are_dropped' panicked at crates/pstore-blob/src/coalesce.rs:70:9:
assertion failed: coalesce(&[5..5], 16).is_empty()

failures:
    coalesce::tests::empty_ranges_are_dropped

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
