*** crates/pstore-blob/src/accounting.rs:148:9: replace <impl crate::BlobStore for TenantView<S>>::delete_batch -> Result<(), BlobError> with Ok(())

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace <impl crate::BlobStore for TenantView<S>>::delete_batch -> Result<(), BlobError> with Ok(())
@@ -140,17 +140,16 @@
         body: Bytes,
         pre: Precondition,
     ) -> Result<PutOutcome, CasError> {
         self.bill(OpClass::Write);
         self.inner.put_conditional(key, body, pre).await
     }
 
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
-        self.bill(OpClass::Delete);
-        self.inner.delete_batch(keys).await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn list_unrestricted(&self, prefix: &Key) -> Result<Vec<Key>, BlobError> {
         self.bill(OpClass::List);
         self.inner.list_unrestricted(prefix).await
     }
 }

*** result: Success
