*** crates/pstore-blob/src/coalesce.rs:39:24: replace match guard r.start.saturating_sub(f.span.end) < gap with false in coalesce

*** mutation diff:
--- crates/pstore-blob/src/coalesce.rs
+++ replace match guard r.start.saturating_sub(f.span.end) < gap with false in coalesce
@@ -31,17 +31,17 @@
     idx.sort_by_key(|i| ranges.get(*i).map(|r| r.start).unwrap_or(0));
 
     let mut out: Vec<Fetch> = Vec::new();
     for i in idx {
         let Some(r) = ranges.get(i) else { continue };
         match out.last_mut() {
             // `saturating_sub` because a later range may be *inside* the current span,
             // which is a gap of zero rather than an underflow.
-            Some(f) if r.start.saturating_sub(f.span.end) < gap => {
+            Some(f) if false /* ~ changed by cargo-mutants ~ */ => {
                 f.span.end = f.span.end.max(r.end);
                 f.serves.push((i, r.clone()));
             }
             _ => out.push(Fetch {
                 span: r.clone(),
                 serves: vec![(i, r.clone())],
             }),
         }

---- coalesce::tests::a_zero_gap_merges_only_touching_ranges stdout ----

thread 'coalesce::tests::a_zero_gap_merges_only_touching_ranges' panicked at crates/pstore-blob/src/coalesce.rs:93:9:
assertion `left == right` failed
  left: 2
 right: 1

---- coalesce::tests::a_contained_range_does_not_underflow_the_gap stdout ----

thread 'coalesce::tests::a_contained_range_does_not_underflow_the_gap' panicked at crates/pstore-blob/src/coalesce.rs:78:9:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    coalesce::tests::a_contained_range_does_not_underflow_the_gap
    coalesce::tests::a_zero_gap_merges_only_touching_ranges

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
