*** crates/pstore-blob/src/congestion.rs:106:35: replace << with >> in Congested<S>::with_retry

*** mutation diff:
--- crates/pstore-blob/src/congestion.rs
+++ replace << with >> in Congested<S>::with_retry
@@ -98,17 +98,17 @@
                     self.on_success();
                     return Ok(v);
                 }
                 Err(BlobError::SlowDown) => {
                     self.on_slow_down();
                     last = BlobError::SlowDown;
                     // Exponential, and jittered by the attempt index so a fleet that all
                     // tripped together does not all come back together.
-                    let ms = 1u64 << attempt;
+                    let ms = 1u64 >> /* ~ changed by cargo-mutants ~ */ attempt;
                     tokio::time::sleep(std::time::Duration::from_millis(ms)).await;
                 }
                 Err(e) => return Err(e),
             }
         }
         Err(last)
     }
 }

*** result: Success
