*** crates/pstore-blob/src/accounting.rs:163:9: replace <impl crate::BlobStore for TenantView<S>>::list_unrestricted -> Result<Vec<Key>, BlobError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace <impl crate::BlobStore for TenantView<S>>::list_unrestricted -> Result<Vec<Key>, BlobError> with Ok(vec![])
@@ -155,12 +155,11 @@
     }
 
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
         self.bill(OpClass::Delete);
         self.inner.delete_batch(keys).await
     }
 
     async fn list_unrestricted(&self, prefix: &Key) -> Result<Vec<Key>, BlobError> {
-        self.bill(OpClass::List);
-        self.inner.list_unrestricted(prefix).await
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }

---- accounting_separates_read_write_and_list_classes stdout ----

thread 'accounting_separates_read_write_and_list_classes' panicked at crates/pstore-blob/tests/accounting.rs:54:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    accounting_separates_read_write_and_list_classes

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
