*** crates/pstore-blob/src/accounting.rs:167:9: replace TenantView<S>::bill_bytes with ()

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace TenantView<S>::bill_bytes with ()
@@ -159,21 +159,17 @@
     }
 
     /// Bills bytes that actually crossed the wire.
     ///
     /// Separate from [`Self::bill`] because the two differ on failure: a refused request is
     /// still billed as a request — AWS charges for failed conditional writes, which is what
     /// makes a CAS storm expensive — but it moves no bytes.
     fn bill_bytes(&self, class: OpClass, n: u64) {
-        *self
-            .lock()
-            .bytes_per_tenant
-            .entry((self.tenant, class))
-            .or_insert(0) += n;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Records a read's span, if recording is on.
     fn note_range(&self, key: &Key, range: std::ops::Range<u64>) {
         if let Some(log) = self.lock().ranges.as_mut() {
             log.push((key.clone(), range));
         }
     }

---- bytes_are_counted_not_just_requests stdout ----

thread 'bytes_are_counted_not_just_requests' panicked at crates/pstore-blob/tests/accounting.rs:109:5:
assertion `left == right` failed
  left: 0
 right: 1000

failures:
    bytes_are_counted_not_just_requests

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
