*** crates/pstore-blob/src/accounting.rs:205:9: replace <impl crate::BlobStore for TenantView<S>>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace <impl crate::BlobStore for TenantView<S>>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -197,23 +197,17 @@
         if let Ok(b) = &out {
             self.bill_bytes(OpClass::Read, b.len() as u64);
             self.note_range(key, 0..b.len() as u64);
         }
         out
     }
 
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
-        self.bill(OpClass::Read);
-        let out = self.inner.get_range(key, range.clone()).await;
-        if let Ok(b) = &out {
-            self.bill_bytes(OpClass::Read, b.len() as u64);
-            self.note_range(key, range);
-        }
-        out
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, pstore_types::CasTag), BlobError> {
         self.bill(OpClass::Read);
         let out = self.inner.get_with_tag(key).await;
         if let Ok((b, _)) = &out {
             self.bill_bytes(OpClass::Read, b.len() as u64);
             self.note_range(key, 0..b.len() as u64);

---- ranges_are_recorded_so_bytes_can_be_attributed_to_a_section stdout ----

thread 'ranges_are_recorded_so_bytes_can_be_attributed_to_a_section' panicked at crates/pstore-blob/tests/accounting.rs:143:5:
assertion `left == right` failed: got [(Key("seg"), 4054..4096)]
  left: 1
 right: 3

---- accounting_separates_read_write_and_list_classes stdout ----

thread 'accounting_separates_read_write_and_list_classes' panicked at crates/pstore-blob/tests/accounting.rs:55:5:
assertion `left == right` failed
  left: 2
 right: 3

---- bytes_are_counted_not_just_requests stdout ----

thread 'bytes_are_counted_not_just_requests' panicked at crates/pstore-blob/tests/accounting.rs:116:5:
assertion `left == right` failed
  left: 1000
 right: 1064

failures:
    accounting_separates_read_write_and_list_classes
    bytes_are_counted_not_just_requests
    ranges_are_recorded_so_bytes_can_be_attributed_to_a_section

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
