*** crates/pstore-blob/src/congestion.rs:144:9: replace <impl crate::BlobStore for Congested<S>>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-blob/src/congestion.rs
+++ replace <impl crate::BlobStore for Congested<S>>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -136,17 +136,17 @@
             .await
     }
 
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, pstore_types::CasTag), BlobError> {
         self.with_retry(|| self.inner.get_with_tag(key)).await
     }
 
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
-        self.with_retry(|| self.inner.get_suffix(key, n)).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_tag(&self, key: &Key) -> Option<pstore_types::CasTag> {
         self.inner.get_tag(key).await
     }
 
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {
         self.with_retry(|| self.inner.head(key)).await

*** result: Success
