*** crates/pstore-blob/src/accounting.rs:97:9: replace TenantView<S>::bill with ()

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace TenantView<S>::bill with ()
@@ -89,22 +89,17 @@
     counters: Arc<Mutex<Counters>>,
     tenant: TenantId,
 }
 
 impl<S> TenantView<S> {
     /// Billed **before** the call, so a failure is counted too: AWS charges for failed
     /// conditional requests, which is exactly what makes a CAS retry storm expensive.
     fn bill(&self, class: OpClass) {
-        let mut c = self
-            .counters
-            .lock()
-            .unwrap_or_else(std::sync::PoisonError::into_inner);
-        *c.per_tenant.entry((self.tenant, class)).or_insert(0) += 1;
-        *c.totals.entry(class).or_insert(0) += 1;
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[async_trait::async_trait]
 impl<S: crate::BlobStore> crate::BlobStore for TenantView<S> {
     fn capabilities(&self) -> &Capabilities {
         self.inner.capabilities()
     }

---- a_failed_conditional_write_is_still_billed stdout ----

thread 'a_failed_conditional_write_is_still_billed' panicked at crates/pstore-blob/tests/accounting.rs:91:5:
assertion `left == right` failed
  left: 0
 right: 2

---- accounting_separates_read_write_and_list_classes stdout ----

thread 'accounting_separates_read_write_and_list_classes' panicked at crates/pstore-blob/tests/accounting.rs:48:5:
assertion `left == right` failed
  left: 0
 right: 1

---- accounting_counts_one_write_per_put stdout ----

thread 'accounting_counts_one_write_per_put' panicked at crates/pstore-blob/tests/accounting.rs:33:5:
assertion `left == right` failed
  left: 0
 right: 10

failures:
    a_failed_conditional_write_is_still_billed
    accounting_counts_one_write_per_put
    accounting_is_per_tenant
    accounting_separates_read_write_and_list_classes

test result: FAILED. 0 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
