*** crates/pstore-blob/src/congestion.rs:161:9: replace <impl crate::BlobStore for Congested<S>>::list_unrestricted -> Result<Vec<Key>, BlobError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-blob/src/congestion.rs
+++ replace <impl crate::BlobStore for Congested<S>>::list_unrestricted -> Result<Vec<Key>, BlobError> with Ok(vec![])
@@ -153,12 +153,11 @@
         self.inner.put_conditional(key, body, pre).await
     }
 
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
         self.with_retry(|| self.inner.delete_batch(keys)).await
     }
 
     async fn list_unrestricted(&self, prefix: &Key) -> Result<Vec<Key>, BlobError> {
-        self.with_retry(|| self.inner.list_unrestricted(prefix))
-            .await
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
