*** crates/pstore-testkit/src/audit.rs:105:16: delete ! in <impl BlobStore for Auditing<S>>::put

*** mutation diff:
--- crates/pstore-testkit/src/audit.rs
+++ delete ! in <impl BlobStore for Auditing<S>>::put
@@ -97,17 +97,17 @@
     }
 
     async fn put(&self, key: &Key, body: Bytes) -> Result<PutOutcome, BlobError> {
         {
             let mut s = self.lock();
             // ⚠️ The whole audit. An unconditional PUT over a key that exists overwrites
             // bytes a reader may be mid-fetch on, and does so without naming the version it
             // believed it was replacing — which is exactly what CAS exists to prevent.
-            if !s.written.insert(key.as_str().to_owned()) {
+            if  /* ~ changed by cargo-mutants ~ */s.written.insert(key.as_str().to_owned()) {
                 s.violations.push(Violation {
                     key: key.as_str().to_owned(),
                     what: "unconditional overwrite of an existing key",
                 });
             }
         }
         self.inner.put(key, body).await
     }

---- a_reaped_key_may_be_written_again stdout ----

thread 'a_reaped_key_may_be_written_again' panicked at crates/pstore-testkit/tests/sim.rs:127:5:
[Violation { key: "seg", what: "unconditional overwrite of an existing key" }, Violation { key: "seg", what: "unconditional overwrite of an existing key" }]

---- the_auditing_store_rejects_an_unconditional_overwrite stdout ----

thread 'the_auditing_store_rejects_an_unconditional_overwrite' panicked at crates/pstore-testkit/tests/sim.rs:88:5:
the first write is a create, not a mutation

failures:
    a_reaped_key_may_be_written_again
    the_auditing_store_rejects_an_unconditional_overwrite

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
