*** crates/pstore-blob/src/congestion.rs:57:9: replace Congested<S>::limit -> u32 with 1

*** mutation diff:
--- crates/pstore-blob/src/congestion.rs
+++ replace Congested<S>::limit -> u32 with 1
@@ -49,17 +49,17 @@
                 attempts: AtomicU64::new(0),
             }),
         }
     }
 
     /// The current concurrency limit.
     #[must_use]
     pub fn limit(&self) -> u32 {
-        self.state.limit.load(Ordering::Relaxed)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Total attempts made, including retries. The number that would grow without bound
     /// if the retry policy were wrong.
     #[must_use]
     pub fn attempts(&self) -> u64 {
         self.state.attempts.load(Ordering::Relaxed)
     }

---- slowdown_reduces_concurrency_then_recovers stdout ----

thread 'slowdown_reduces_concurrency_then_recovers' panicked at crates/pstore-blob/tests/faults.rs:149:5:
assertion `left == right` failed
  left: 1
 right: 32

failures:
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
