*** crates/pstore-testkit/src/audit.rs:130:9: replace <impl BlobStore for Auditing<S>>::delete_batch -> Result<(), BlobError> with Ok(())

*** mutation diff:
--- crates/pstore-testkit/src/audit.rs
+++ replace <impl BlobStore for Auditing<S>>::delete_batch -> Result<(), BlobError> with Ok(())
@@ -122,21 +122,15 @@
         // holding a stale view is refused by the store rather than by our vigilance.
         self.lock().written.insert(key.as_str().to_owned());
         self.inner.put_conditional(key, body, pre).await
     }
 
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
         // A reaped key may legitimately be written again later — GC is what makes a key
         // free — so forget it rather than treating the next write as a mutation.
-        {
-            let mut s = self.lock();
-            for k in keys {
-                s.written.remove(k.as_str());
-            }
-        }
-        self.inner.delete_batch(keys).await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn list_unrestricted(&self, prefix: &Key) -> Result<Vec<Key>, BlobError> {
         self.inner.list_unrestricted(prefix).await
     }
 }

---- every_decorator_conforms stdout ----

thread 'every_decorator_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:62:5:
assertion failed: conformance::run(&audit, 8).await.conforms()

failures:
    every_decorator_conforms

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
