*** crates/pstore-testkit/src/audit.rs:52:9: replace Auditing<S>::violations -> Vec<Violation> with vec![]

*** mutation diff:
--- crates/pstore-testkit/src/audit.rs
+++ replace Auditing<S>::violations -> Vec<Violation> with vec![]
@@ -44,17 +44,17 @@
             inner: Arc::new(inner),
             seen: Arc::new(Mutex::new(Seen::default())),
         }
     }
 
     /// Every violation observed. **Empty is the only passing result.**
     #[must_use]
     pub fn violations(&self) -> Vec<Violation> {
-        self.lock().violations.clone()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Distinct keys written. The denominator: an audit over no writes proves nothing, so
     /// a test should assert this is non-trivial before trusting an empty violation list.
     #[must_use]
     pub fn keys_written(&self) -> usize {
         self.lock().written.len()
     }

---- the_auditing_store_rejects_an_unconditional_overwrite stdout ----

thread 'the_auditing_store_rejects_an_unconditional_overwrite' panicked at crates/pstore-testkit/tests/sim.rs:93:5:
assertion `left == right` failed: the second is a mutation and must be caught
  left: 0
 right: 1

failures:
    the_auditing_store_rejects_an_unconditional_overwrite

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
