*** crates/pstore-blob/src/congestion.rs:70:9: replace Congested<S>::on_slow_down with ()

*** mutation diff:
--- crates/pstore-blob/src/congestion.rs
+++ replace Congested<S>::on_slow_down with ()
@@ -62,19 +62,17 @@
     #[must_use]
     pub fn attempts(&self) -> u64 {
         self.state.attempts.load(Ordering::Relaxed)
     }
 
     /// Multiplicative decrease, floored at one: the limit must never reach zero, or the
     /// backend can never be probed again and the fall is permanent.
     fn on_slow_down(&self) {
-        self.state.streak.store(0, Ordering::Relaxed);
-        let cur = self.state.limit.load(Ordering::Relaxed);
-        self.state.limit.store((cur / 2).max(1), Ordering::Relaxed);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Additive increase, and only every few successes, so one lucky request does not
     /// undo a cut.
     fn on_success(&self) {
         let n = self.state.streak.fetch_add(1, Ordering::Relaxed) + 1;
         if n.is_multiple_of(8) {
             let cur = self.state.limit.load(Ordering::Relaxed);

---- slowdown_reduces_concurrency_then_recovers stdout ----

thread 'slowdown_reduces_concurrency_then_recovers' panicked at crates/pstore-blob/tests/faults.rs:153:5:
a 503 must reduce the limit, got 32

failures:
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
