*** crates/pstore-testkit/src/audit.rs:59:9: replace Auditing<S>::keys_written -> usize with 0

*** mutation diff:
--- crates/pstore-testkit/src/audit.rs
+++ replace Auditing<S>::keys_written -> usize with 0
@@ -51,17 +51,17 @@
     pub fn violations(&self) -> Vec<Violation> {
         self.lock().violations.clone()
     }
 
     /// Distinct keys written. The denominator: an audit over no writes proves nothing, so
     /// a test should assert this is non-trivial before trusting an empty violation list.
     #[must_use]
     pub fn keys_written(&self) -> usize {
-        self.lock().written.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     fn lock(&self) -> std::sync::MutexGuard<'_, Seen> {
         self.seen
             .lock()
             .unwrap_or_else(std::sync::PoisonError::into_inner)
     }
 }

---- a_compare_and_swap_is_not_a_violation stdout ----

thread 'a_compare_and_swap_is_not_a_violation' panicked at crates/pstore-testkit/tests/sim.rs:115:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    a_compare_and_swap_is_not_a_violation

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
