*** crates/pstore-blob/src/congestion.rs:78:67: replace + with - in Congested<S>::on_success

*** mutation diff:
--- crates/pstore-blob/src/congestion.rs
+++ replace + with - in Congested<S>::on_success
@@ -70,17 +70,17 @@
         self.state.streak.store(0, Ordering::Relaxed);
         let cur = self.state.limit.load(Ordering::Relaxed);
         self.state.limit.store((cur / 2).max(1), Ordering::Relaxed);
     }
 
     /// Additive increase, and only every few successes, so one lucky request does not
     /// undo a cut.
     fn on_success(&self) {
-        let n = self.state.streak.fetch_add(1, Ordering::Relaxed) + 1;
+        let n = self.state.streak.fetch_add(1, Ordering::Relaxed) - /* ~ changed by cargo-mutants ~ */ 1;
         if n.is_multiple_of(8) {
             let cur = self.state.limit.load(Ordering::Relaxed);
             self.state
                 .limit
                 .store((cur + 1).min(self.state.ceiling), Ordering::Relaxed);
         }
     }

---- a_transient_slowdown_is_retried_and_succeeds stdout ----

thread 'a_transient_slowdown_is_retried_and_succeeds' panicked at /tmp/cargo-mutants-pstore-36QniT.tmp/crates/pstore-blob/src/congestion.rs:78:17:
attempt to subtract with overflow

---- slowdown_reduces_concurrency_then_recovers stdout ----

thread 'slowdown_reduces_concurrency_then_recovers' panicked at /tmp/cargo-mutants-pstore-36QniT.tmp/crates/pstore-blob/src/congestion.rs:78:17:
attempt to subtract with overflow

failures:
    a_transient_slowdown_is_retried_and_succeeds
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
