*** crates/pstore-blob/src/accounting.rs:101:64: replace += with -= in TenantView<S>::bill

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace += with -= in TenantView<S>::bill
@@ -93,17 +93,17 @@
 impl<S> TenantView<S> {
     /// Billed **before** the call, so a failure is counted too: AWS charges for failed
     /// conditional requests, which is exactly what makes a CAS retry storm expensive.
     fn bill(&self, class: OpClass) {
         let mut c = self
             .counters
             .lock()
             .unwrap_or_else(std::sync::PoisonError::into_inner);
-        *c.per_tenant.entry((self.tenant, class)).or_insert(0) += 1;
+        *c.per_tenant.entry((self.tenant, class)).or_insert(0) -= /* ~ changed by cargo-mutants ~ */ 1;
         *c.totals.entry(class).or_insert(0) += 1;
     }
 }
 
 #[async_trait::async_trait]
 impl<S: crate::BlobStore> crate::BlobStore for TenantView<S> {
     fn capabilities(&self) -> &Capabilities {
         self.inner.capabilities()

---- accounting_is_per_tenant stdout ----

thread 'accounting_is_per_tenant' panicked at /tmp/cargo-mutants-pstore-pCVVec.tmp/crates/pstore-blob/src/accounting.rs:101:9:
attempt to subtract with overflow

---- a_failed_conditional_write_is_still_billed stdout ----

thread 'a_failed_conditional_write_is_still_billed' panicked at /tmp/cargo-mutants-pstore-pCVVec.tmp/crates/pstore-blob/src/accounting.rs:101:9:
attempt to subtract with overflow

---- accounting_separates_read_write_and_list_classes stdout ----

thread 'accounting_separates_read_write_and_list_classes' panicked at /tmp/cargo-mutants-pstore-pCVVec.tmp/crates/pstore-blob/src/accounting.rs:101:9:
attempt to subtract with overflow

failures:
    a_failed_conditional_write_is_still_billed
    accounting_counts_one_write_per_put
    accounting_is_per_tenant
    accounting_separates_read_write_and_list_classes

test result: FAILED. 0 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
