*** crates/pstore-blob/src/faulty.rs:104:9: replace Faulty<S>::read_fault -> Option<BlobError> with None

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace Faulty<S>::read_fault -> Option<BlobError> with None
@@ -96,27 +96,17 @@
     fn roll(&self) -> (Faults, f64, u32) {
         let mut st = self.lock();
         st.ops = st.ops.saturating_add(1);
         let (f, ops) = (st.faults, st.ops);
         (f, st.next_f64(), ops)
     }
 
     fn read_fault(&self) -> Option<BlobError> {
-        let (f, r, ops) = self.roll();
-        if ops <= f.slow_down_first_n {
-            return Some(BlobError::SlowDown);
-        }
-        if r < f.slow_down {
-            return Some(BlobError::SlowDown);
-        }
-        if r < f.slow_down + f.read_error {
-            return Some(BlobError::Other("injected read fault".to_owned()));
-        }
-        None
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn write_fault(&self) -> Option<BlobError> {
         let (f, r, ops) = self.roll();
         if ops <= f.slow_down_first_n || r < f.slow_down {
             return Some(BlobError::SlowDown);
         }
         if r < f.slow_down + f.write_error {

---- a_transient_slowdown_is_retried_and_succeeds stdout ----

thread 'a_transient_slowdown_is_retried_and_succeeds' panicked at crates/pstore-blob/tests/faults.rs:203:5:
assertion `left == right` failed
  left: 1
 right: 2

---- each_fault_kind_is_injected_independently stdout ----

thread 'each_fault_kind_is_injected_independently' panicked at crates/pstore-blob/tests/faults.rs:75:5:
assertion failed: matches!(slow.get(&k("a")).await.unwrap_err(), BlobError::SlowDown)

---- same_seed_reproduces_the_same_failures stdout ----

thread 'same_seed_reproduces_the_same_failures' panicked at crates/pstore-blob/tests/faults.rs:48:5:
assertion `left != right` failed: a different seed must diverge
  left: [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true]
 right: [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true]

failures:
    a_transient_slowdown_is_retried_and_succeeds
    each_fault_kind_is_injected_independently
    retries_are_bounded
    same_seed_reproduces_the_same_failures
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 2 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
