*** crates/pstore-blob/src/accounting.rs:102:45: replace += with *= in TenantView<S>::bill

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace += with *= in TenantView<S>::bill
@@ -94,17 +94,17 @@
     /// Billed **before** the call, so a failure is counted too: AWS charges for failed
     /// conditional requests, which is exactly what makes a CAS retry storm expensive.
     fn bill(&self, class: OpClass) {
         let mut c = self
             .counters
             .lock()
             .unwrap_or_else(std::sync::PoisonError::into_inner);
         *c.per_tenant.entry((self.tenant, class)).or_insert(0) += 1;
-        *c.totals.entry(class).or_insert(0) += 1;
+        *c.totals.entry(class).or_insert(0) *= /* ~ changed by cargo-mutants ~ */ 1;
     }
 }
 
 #[async_trait::async_trait]
 impl<S: crate::BlobStore> crate::BlobStore for TenantView<S> {
     fn capabilities(&self) -> &Capabilities {
         self.inner.capabilities()
     }

---- accounting_is_per_tenant stdout ----

thread 'accounting_is_per_tenant' panicked at crates/pstore-blob/tests/accounting.rs:75:5:
assertion `left == right` failed
  left: 0
 right: 4

failures:
    accounting_is_per_tenant

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
