*** crates/pstore-blob/src/accounting.rs:118:9: replace <impl crate::BlobStore for TenantView<S>>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace <impl crate::BlobStore for TenantView<S>>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -110,18 +110,17 @@
     }
 
     async fn get(&self, key: &Key) -> Result<Bytes, BlobError> {
         self.bill(OpClass::Read);
         self.inner.get(key).await
     }
 
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
-        self.bill(OpClass::Read);
-        self.inner.get_range(key, range).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, pstore_types::CasTag), BlobError> {
         self.bill(OpClass::Read);
         self.inner.get_with_tag(key).await
     }
 
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {

---- accounting_separates_read_write_and_list_classes stdout ----

thread 'accounting_separates_read_write_and_list_classes' panicked at crates/pstore-blob/tests/accounting.rs:51:5:
assertion `left == right` failed
  left: 2
 right: 3

failures:
    accounting_separates_read_write_and_list_classes

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
