*** crates/pstore-blob/src/faulty.rs:108:14: replace < with > in Faulty<S>::read_fault

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace < with > in Faulty<S>::read_fault
@@ -100,17 +100,17 @@
         (f, st.next_f64(), ops)
     }
 
     fn read_fault(&self) -> Option<BlobError> {
         let (f, r, ops) = self.roll();
         if ops <= f.slow_down_first_n {
             return Some(BlobError::SlowDown);
         }
-        if r < f.slow_down {
+        if r > /* ~ changed by cargo-mutants ~ */ f.slow_down {
             return Some(BlobError::SlowDown);
         }
         if r < f.slow_down + f.read_error {
             return Some(BlobError::Other("injected read fault".to_owned()));
         }
         None
     }

---- a_zero_rate_injects_nothing stdout ----

thread 'a_zero_rate_injects_nothing' panicked at crates/pstore-blob/tests/faults.rs:61:9:
assertion failed: s.get(&k("a")).await.is_ok()

---- same_seed_reproduces_the_same_failures stdout ----

thread 'same_seed_reproduces_the_same_failures' panicked at crates/pstore-blob/tests/faults.rs:48:5:
assertion `left != right` failed: a different seed must diverge
  left: [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]
 right: [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]

---- slowdown_reduces_concurrency_then_recovers stdout ----

thread 'slowdown_reduces_concurrency_then_recovers' panicked at crates/pstore-blob/tests/faults.rs:153:5:
a 503 must reduce the limit, got 32

failures:
    a_slow_down_halves_the_limit_rather_than_merely_lowering_it
    a_transient_slowdown_is_retried_and_succeeds
    a_zero_rate_injects_nothing
    each_fault_kind_is_injected_independently
    retries_are_bounded
    same_seed_reproduces_the_same_failures
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 3 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
