*** crates/pstore-blob/src/faulty.rs:111:14: replace < with == in Faulty<S>::read_fault

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace < with == in Faulty<S>::read_fault
@@ -103,17 +103,17 @@
     fn read_fault(&self) -> Option<BlobError> {
         let (f, r, ops) = self.roll();
         if ops <= f.slow_down_first_n {
             return Some(BlobError::SlowDown);
         }
         if r < f.slow_down {
             return Some(BlobError::SlowDown);
         }
-        if r < f.slow_down + f.read_error {
+        if r == /* ~ changed by cargo-mutants ~ */ f.slow_down + f.read_error {
             return Some(BlobError::Other("injected read fault".to_owned()));
         }
         None
     }
 
     fn write_fault(&self) -> Option<BlobError> {
         let (f, r, ops) = self.roll();
         if ops <= f.slow_down_first_n || r < f.slow_down {

---- same_seed_reproduces_the_same_failures stdout ----

thread 'same_seed_reproduces_the_same_failures' panicked at crates/pstore-blob/tests/faults.rs:48:5:
assertion `left != right` failed: a different seed must diverge
  left: [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true]
 right: [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true]

failures:
    same_seed_reproduces_the_same_failures

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
