*** crates/pstore-blob/src/accounting.rs:128:9: replace <impl crate::BlobStore for TenantView<S>>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace <impl crate::BlobStore for TenantView<S>>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -120,18 +120,17 @@
     }
 
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, pstore_types::CasTag), BlobError> {
         self.bill(OpClass::Read);
         self.inner.get_with_tag(key).await
     }
 
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
-        self.bill(OpClass::Read);
-        self.inner.get_suffix(key, n).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_tag(&self, key: &Key) -> Option<pstore_types::CasTag> {
         self.bill(OpClass::Read);
         self.inner.get_tag(key).await
     }
 
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {

*** result: Success
