*** crates/pstore-blob/src/accounting.rs:156:9: replace TenantView<S>::bill with ()

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace TenantView<S>::bill with ()
@@ -148,19 +148,17 @@
     counters: Arc<Mutex<Counters>>,
     tenant: TenantId,
 }
 
 impl<S> TenantView<S> {
     /// Billed **before** the call, so a failure is counted too: AWS charges for failed
     /// conditional requests, which is exactly what makes a CAS retry storm expensive.
     fn bill(&self, class: OpClass) {
-        let mut c = self.lock();
-        *c.per_tenant.entry((self.tenant, class)).or_insert(0) += 1;
-        *c.totals.entry(class).or_insert(0) += 1;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Bills bytes that actually crossed the wire.
     ///
     /// Separate from [`Self::bill`] because the two differ on failure: a refused request is
     /// still billed as a request — AWS charges for failed conditional writes, which is what
     /// makes a CAS storm expensive — but it moves no bytes.
     fn bill_bytes(&self, class: OpClass, n: u64) {

---- accounting_is_per_tenant stdout ----

thread 'accounting_is_per_tenant' panicked at crates/pstore-blob/tests/accounting.rs:77:5:
assertion `left == right` failed
  left: 0
 right: 1

---- accounting_separates_read_write_and_list_classes stdout ----

thread 'accounting_separates_read_write_and_list_classes' panicked at crates/pstore-blob/tests/accounting.rs:52:5:
assertion `left == right` failed
  left: 0
 right: 1

---- a_failed_conditional_write_is_still_billed stdout ----

thread 'a_failed_conditional_write_is_still_billed' panicked at crates/pstore-blob/tests/accounting.rs:95:5:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    a_failed_conditional_write_is_still_billed
    accounting_counts_one_write_per_put
    accounting_is_per_tenant
    accounting_separates_read_write_and_list_classes

test result: FAILED. 2 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
