*** crates/pstore-blob/src/accounting.rs:157:64: replace += with -= in TenantView<S>::bill

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace += with -= in TenantView<S>::bill
@@ -149,17 +149,17 @@
     tenant: TenantId,
 }
 
 impl<S> TenantView<S> {
     /// Billed **before** the call, so a failure is counted too: AWS charges for failed
     /// conditional requests, which is exactly what makes a CAS retry storm expensive.
     fn bill(&self, class: OpClass) {
         let mut c = self.lock();
-        *c.per_tenant.entry((self.tenant, class)).or_insert(0) += 1;
+        *c.per_tenant.entry((self.tenant, class)).or_insert(0) -= /* ~ changed by cargo-mutants ~ */ 1;
         *c.totals.entry(class).or_insert(0) += 1;
     }
 
     /// Bills bytes that actually crossed the wire.
     ///
     /// Separate from [`Self::bill`] because the two differ on failure: a refused request is
     /// still billed as a request — AWS charges for failed conditional writes, which is what
     /// makes a CAS storm expensive — but it moves no bytes.

---- a_failed_conditional_write_is_still_billed stdout ----

thread 'a_failed_conditional_write_is_still_billed' panicked at /tmp/cargo-mutants-pstore-EcZlxz.tmp/crates/pstore-blob/src/accounting.rs:157:9:
attempt to subtract with overflow

---- accounting_counts_one_write_per_put stdout ----

thread 'accounting_counts_one_write_per_put' panicked at /tmp/cargo-mutants-pstore-EcZlxz.tmp/crates/pstore-blob/src/accounting.rs:157:9:
attempt to subtract with overflow

---- accounting_is_per_tenant stdout ----

thread 'accounting_is_per_tenant' panicked at /tmp/cargo-mutants-pstore-EcZlxz.tmp/crates/pstore-blob/src/accounting.rs:157:9:
attempt to subtract with overflow

failures:
    a_failed_conditional_write_is_still_billed
    accounting_counts_one_write_per_put
    accounting_is_per_tenant
    accounting_separates_read_write_and_list_classes
    bytes_are_counted_not_just_requests
    ranges_are_recorded_so_bytes_can_be_attributed_to_a_section

test result: FAILED. 0 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
