*** crates/pstore-blob/src/accounting.rs:171:27: replace += with -= in TenantView<S>::bill_bytes

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace += with -= in TenantView<S>::bill_bytes
@@ -163,17 +163,17 @@
     /// Separate from [`Self::bill`] because the two differ on failure: a refused request is
     /// still billed as a request — AWS charges for failed conditional writes, which is what
     /// makes a CAS storm expensive — but it moves no bytes.
     fn bill_bytes(&self, class: OpClass, n: u64) {
         *self
             .lock()
             .bytes_per_tenant
             .entry((self.tenant, class))
-            .or_insert(0) += n;
+            .or_insert(0) -= /* ~ changed by cargo-mutants ~ */ n;
     }
 
     /// Records a read's span, if recording is on.
     fn note_range(&self, key: &Key, range: std::ops::Range<u64>) {
         if let Some(log) = self.lock().ranges.as_mut() {
             log.push((key.clone(), range));
         }
     }

---- bytes_are_counted_not_just_requests stdout ----

thread 'bytes_are_counted_not_just_requests' panicked at /tmp/cargo-mutants-pstore-PoT6cj.tmp/crates/pstore-blob/src/accounting.rs:167:9:
attempt to subtract with overflow

---- accounting_counts_one_write_per_put stdout ----

thread 'accounting_counts_one_write_per_put' panicked at /tmp/cargo-mutants-pstore-PoT6cj.tmp/crates/pstore-blob/src/accounting.rs:167:9:
attempt to subtract with overflow

---- a_failed_conditional_write_is_still_billed stdout ----

thread 'a_failed_conditional_write_is_still_billed' panicked at /tmp/cargo-mutants-pstore-PoT6cj.tmp/crates/pstore-blob/src/accounting.rs:167:9:
attempt to subtract with overflow

failures:
    a_failed_conditional_write_is_still_billed
    accounting_counts_one_write_per_put
    accounting_is_per_tenant
    accounting_separates_read_write_and_list_classes
    bytes_are_counted_not_just_requests
    ranges_are_recorded_so_bytes_can_be_attributed_to_a_section

test result: FAILED. 0 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
