*** crates/pstore-blob/src/faulty.rs:118:9: replace Faulty<S>::write_fault -> Option<BlobError> with None

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace Faulty<S>::write_fault -> Option<BlobError> with None
@@ -110,24 +110,17 @@
         }
         if r < f.slow_down + f.read_error {
             return Some(BlobError::Other("injected read fault".to_owned()));
         }
         None
     }
 
     fn write_fault(&self) -> Option<BlobError> {
-        let (f, r, ops) = self.roll();
-        if ops <= f.slow_down_first_n || r < f.slow_down {
-            return Some(BlobError::SlowDown);
-        }
-        if r < f.slow_down + f.write_error {
-            return Some(BlobError::Other("injected write fault".to_owned()));
-        }
-        None
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn cas_fault(&self) -> Option<CasError> {
         let (f, r, _) = self.roll();
         if r < f.cas_lost {
             return Some(CasError::Lost);
         }
         if r < f.cas_lost + f.cas_contended {

*** result: Success
