*** crates/pstore-blob/src/accounting.rs:176:9: replace TenantView<S>::note_range with ()

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace TenantView<S>::note_range with ()
@@ -168,19 +168,17 @@
             .lock()
             .bytes_per_tenant
             .entry((self.tenant, class))
             .or_insert(0) += n;
     }
 
     /// Records a read's span, if recording is on.
     fn note_range(&self, key: &Key, range: std::ops::Range<u64>) {
-        if let Some(log) = self.lock().ranges.as_mut() {
-            log.push((key.clone(), range));
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn lock(&self) -> std::sync::MutexGuard<'_, Counters> {
         self.counters
             .lock()
             .unwrap_or_else(std::sync::PoisonError::into_inner)
     }
 }

---- ranges_are_recorded_so_bytes_can_be_attributed_to_a_section stdout ----

thread 'ranges_are_recorded_so_bytes_can_be_attributed_to_a_section' panicked at crates/pstore-blob/tests/accounting.rs:143:5:
assertion `left == right` failed: got []
  left: 0
 right: 3

failures:
    ranges_are_recorded_so_bytes_can_be_attributed_to_a_section

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
