*** crates/pstore-blob/src/faulty.rs:119:44: replace < with > in Faulty<S>::write_fault

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace < with > in Faulty<S>::write_fault
@@ -111,17 +111,17 @@
         if r < f.slow_down + f.read_error {
             return Some(BlobError::Other("injected read fault".to_owned()));
         }
         None
     }
 
     fn write_fault(&self) -> Option<BlobError> {
         let (f, r, ops) = self.roll();
-        if ops <= f.slow_down_first_n || r < f.slow_down {
+        if ops <= f.slow_down_first_n || r > /* ~ changed by cargo-mutants ~ */ f.slow_down {
             return Some(BlobError::SlowDown);
         }
         if r < f.slow_down + f.write_error {
             return Some(BlobError::Other("injected write fault".to_owned()));
         }
         None
     }

---- a_fault_rate_of_one_injects_on_every_call_and_zero_on_none stdout ----

thread 'a_fault_rate_of_one_injects_on_every_call_and_zero_on_none' panicked at crates/pstore-blob/tests/faults.rs:281:56:
called `Result::unwrap()` on an `Err` value: SlowDown

---- same_seed_reproduces_the_same_failures stdout ----

thread 'same_seed_reproduces_the_same_failures' panicked at crates/pstore-blob/tests/faults.rs:35:56:
called `Result::unwrap()` on an `Err` value: SlowDown

---- a_zero_rate_injects_nothing stdout ----

thread 'a_zero_rate_injects_nothing' panicked at crates/pstore-blob/tests/faults.rs:59:52:
called `Result::unwrap()` on an `Err` value: SlowDown

failures:
    a_fault_rate_of_one_injects_on_every_call_and_zero_on_none
    a_zero_rate_injects_nothing
    injected_faults_land_at_roughly_the_rate_asked_for
    same_seed_reproduces_the_same_failures

test result: FAILED. 9 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
