*** crates/pstore-blob/src/faulty.rs:122:14: replace < with == in Faulty<S>::write_fault

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace < with == in Faulty<S>::write_fault
@@ -114,17 +114,17 @@
         None
     }
 
     fn write_fault(&self) -> Option<BlobError> {
         let (f, r, ops) = self.roll();
         if ops <= f.slow_down_first_n || r < f.slow_down {
             return Some(BlobError::SlowDown);
         }
-        if r < f.slow_down + f.write_error {
+        if r == /* ~ changed by cargo-mutants ~ */ f.slow_down + f.write_error {
             return Some(BlobError::Other("injected write fault".to_owned()));
         }
         None
     }
 
     fn cas_fault(&self) -> Option<CasError> {
         let (f, r, _) = self.roll();
         if r < f.cas_lost {

*** result: Success
