*** crates/pstore-blob/src/accounting.rs:195:9: replace <impl crate::BlobStore for TenantView<S>>::get -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace <impl crate::BlobStore for TenantView<S>>::get -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -187,23 +187,17 @@
 
 #[async_trait::async_trait]
 impl<S: crate::BlobStore> crate::BlobStore for TenantView<S> {
     fn capabilities(&self) -> &Capabilities {
         self.inner.capabilities()
     }
 
     async fn get(&self, key: &Key) -> Result<Bytes, BlobError> {
-        self.bill(OpClass::Read);
-        let out = self.inner.get(key).await;
-        if let Ok(b) = &out {
-            self.bill_bytes(OpClass::Read, b.len() as u64);
-            self.note_range(key, 0..b.len() as u64);
-        }
-        out
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
         self.bill(OpClass::Read);
         let out = self.inner.get_range(key, range.clone()).await;
         if let Ok(b) = &out {
             self.bill_bytes(OpClass::Read, b.len() as u64);
             self.note_range(key, range);

---- bytes_are_counted_not_just_requests stdout ----

thread 'bytes_are_counted_not_just_requests' panicked at crates/pstore-blob/tests/accounting.rs:112:5:
assertion `left == right` failed
  left: 0
 right: 1000

---- accounting_separates_read_write_and_list_classes stdout ----

thread 'accounting_separates_read_write_and_list_classes' panicked at crates/pstore-blob/tests/accounting.rs:55:5:
assertion `left == right` failed
  left: 2
 right: 3

failures:
    accounting_separates_read_write_and_list_classes
    bytes_are_counted_not_just_requests

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
