*** crates/pstore-blob/src/faulty.rs:129:9: replace Faulty<S>::cas_fault -> Option<CasError> with None

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace Faulty<S>::cas_fault -> Option<CasError> with None
@@ -121,24 +121,17 @@
         }
         if r < f.slow_down + f.write_error {
             return Some(BlobError::Other("injected write fault".to_owned()));
         }
         None
     }
 
     fn cas_fault(&self) -> Option<CasError> {
-        let (f, r, _) = self.roll();
-        if r < f.cas_lost {
-            return Some(CasError::Lost);
-        }
-        if r < f.cas_lost + f.cas_contended {
-            return Some(CasError::Contended);
-        }
-        None
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[async_trait::async_trait]
 impl<S: crate::BlobStore> crate::BlobStore for Faulty<S> {
     fn capabilities(&self) -> &Capabilities {
         self.inner.capabilities()
     }

---- each_fault_kind_is_injected_independently stdout ----

thread 'each_fault_kind_is_injected_independently' panicked at crates/pstore-blob/tests/faults.rs:91:14:
called `Result::unwrap_err()` on an `Ok` value: PutOutcome { tag: CasTag("1") }

---- an_injected_write_fault_does_not_reach_the_backend stdout ----

thread 'an_injected_write_fault_does_not_reach_the_backend' panicked at crates/pstore-blob/tests/faults.rs:128:5:
the refused write must not have landed

---- a_fault_rate_of_one_injects_on_every_call_and_zero_on_none stdout ----

thread 'a_fault_rate_of_one_injects_on_every_call_and_zero_on_none' panicked at crates/pstore-blob/tests/faults.rs:329:9:
assertion failed: matches!(always_lost.put_conditional(&k("a"), Bytes::from_static(b"x"),
    Precondition::NotExists).await, Err(CasError::Lost))

failures:
    a_fault_rate_of_one_injects_on_every_call_and_zero_on_none
    an_injected_write_fault_does_not_reach_the_backend
    each_fault_kind_is_injected_independently

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
