*** crates/pstore-testkit/src/audit.rs:59:9: replace Auditing<S>::keys_written -> usize with 1

*** mutation diff:
--- crates/pstore-testkit/src/audit.rs
+++ replace Auditing<S>::keys_written -> usize with 1
@@ -51,17 +51,17 @@
     pub fn violations(&self) -> Vec<Violation> {
         self.lock().violations.clone()
     }
 
     /// Distinct keys written. The denominator: an audit over no writes proves nothing, so
     /// a test should assert this is non-trivial before trusting an empty violation list.
     #[must_use]
     pub fn keys_written(&self) -> usize {
-        self.lock().written.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     fn lock(&self) -> std::sync::MutexGuard<'_, Seen> {
         self.seen
             .lock()
             .unwrap_or_else(std::sync::PoisonError::into_inner)
     }
 }

*** result: Success
