*** crates/pstore-blob/src/faulty.rs:130:14: replace < with <= in Faulty<S>::cas_fault

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace < with <= in Faulty<S>::cas_fault
@@ -122,17 +122,17 @@
         if r < f.slow_down + f.write_error {
             return Some(BlobError::Other("injected write fault".to_owned()));
         }
         None
     }
 
     fn cas_fault(&self) -> Option<CasError> {
         let (f, r, _) = self.roll();
-        if r < f.cas_lost {
+        if r <= /* ~ changed by cargo-mutants ~ */ f.cas_lost {
             return Some(CasError::Lost);
         }
         if r < f.cas_lost + f.cas_contended {
             return Some(CasError::Contended);
         }
         None
     }
 }

*** result: Success
