*** crates/pstore-blob/src/faulty.rs:147:9: replace <impl crate::BlobStore for Faulty<S>>::get -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace <impl crate::BlobStore for Faulty<S>>::get -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -139,20 +139,17 @@
 
 #[async_trait::async_trait]
 impl<S: crate::BlobStore> crate::BlobStore for Faulty<S> {
     fn capabilities(&self) -> &Capabilities {
         self.inner.capabilities()
     }
 
     async fn get(&self, key: &Key) -> Result<Bytes, BlobError> {
-        match self.read_fault() {
-            Some(e) => Err(e),
-            None => self.inner.get(key).await,
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
         match self.read_fault() {
             Some(e) => Err(e),
             None => self.inner.get_range(key, range).await,
         }
     }

---- a_transient_slowdown_is_retried_and_succeeds stdout ----

thread 'a_transient_slowdown_is_retried_and_succeeds' panicked at crates/pstore-blob/tests/faults.rs:202:5:
assertion `left == right` failed
  left: []
 right: [111, 107]

---- each_fault_kind_is_injected_independently stdout ----

thread 'each_fault_kind_is_injected_independently' panicked at crates/pstore-blob/tests/faults.rs:76:33:
called `Result::unwrap_err()` on an `Ok` value: b""

---- same_seed_reproduces_the_same_failures stdout ----

thread 'same_seed_reproduces_the_same_failures' panicked at crates/pstore-blob/tests/faults.rs:48:5:
assertion `left != right` failed: a different seed must diverge
  left: [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true]
 right: [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true]

failures:
    a_transient_slowdown_is_retried_and_succeeds
    each_fault_kind_is_injected_independently
    retries_are_bounded
    same_seed_reproduces_the_same_failures
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 2 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
