*** crates/pstore-blob/src/faulty.rs:175:9: replace <impl crate::BlobStore for Faulty<S>>::get_tag -> Option<pstore_types::CasTag> with None

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace <impl crate::BlobStore for Faulty<S>>::get_tag -> Option<pstore_types::CasTag> with None
@@ -167,17 +167,17 @@
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
         match self.read_fault() {
             Some(e) => Err(e),
             None => self.inner.get_suffix(key, n).await,
         }
     }
 
     async fn get_tag(&self, key: &Key) -> Option<pstore_types::CasTag> {
-        self.inner.get_tag(key).await
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {
         match self.read_fault() {
             Some(e) => Err(e),
             None => self.inner.head(key).await,
         }
     }

---- every_decorator_conforms stdout ----

thread 'every_decorator_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:44:5:
assertion failed: conformance::run(&quiet, 3).await.conforms()

failures:
    every_decorator_conforms

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
