*** crates/pstore-blob/src/faulty.rs:208:9: replace <impl crate::BlobStore for Faulty<S>>::delete_batch -> Result<(), BlobError> with Ok(())

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace <impl crate::BlobStore for Faulty<S>>::delete_batch -> Result<(), BlobError> with Ok(())
@@ -200,20 +200,17 @@
         // assertion would be against a fiction.
         match self.cas_fault() {
             Some(e) => Err(e),
             None => self.inner.put_conditional(key, body, pre).await,
         }
     }
 
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
-        match self.write_fault() {
-            Some(e) => Err(e),
-            None => self.inner.delete_batch(keys).await,
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn list_unrestricted(&self, prefix: &Key) -> Result<Vec<Key>, BlobError> {
         match self.read_fault() {
             Some(e) => Err(e),
             None => self.inner.list_unrestricted(prefix).await,
         }
     }

---- every_decorator_conforms stdout ----

thread 'every_decorator_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:44:5:
assertion failed: conformance::run(&quiet, 3).await.conforms()

failures:
    every_decorator_conforms

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
