*** crates/pstore-blob/src/faulty.rs:215:9: replace <impl crate::BlobStore for Faulty<S>>::list_unrestricted -> Result<Vec<Key>, BlobError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace <impl crate::BlobStore for Faulty<S>>::list_unrestricted -> Result<Vec<Key>, BlobError> with Ok(vec![])
@@ -207,14 +207,11 @@
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
         match self.write_fault() {
             Some(e) => Err(e),
             None => self.inner.delete_batch(keys).await,
         }
     }
 
     async fn list_unrestricted(&self, prefix: &Key) -> Result<Vec<Key>, BlobError> {
-        match self.read_fault() {
-            Some(e) => Err(e),
-            None => self.inner.list_unrestricted(prefix).await,
-        }
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
