*** crates/pstore-blob/src/faulty.rs:53:9: replace Inner::next_f64 -> f64 with 1.0

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace Inner::next_f64 -> f64 with 1.0
@@ -45,23 +45,17 @@
     /// the source and cannot drift with a dependency's version.
     seed: u64,
     faults: Faults,
     ops: u32,
 }
 
 impl Inner {
     fn next_f64(&mut self) -> f64 {
-        self.seed = self.seed.wrapping_add(0x9E37_79B9_7F4A_7C15);
-        let mut z = self.seed;
-        z = (z ^ (z >> 30)).wrapping_mul(0xBF58_476D_1CE4_E5B9);
-        z = (z ^ (z >> 27)).wrapping_mul(0x94D0_49BB_1331_11EB);
-        z ^= z >> 31;
-        // 53 bits of mantissa: the same value on every platform.
-        ((z >> 11) as f64) / ((1u64 << 53) as f64)
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Wraps a backend and injects faults from a seed.
 #[derive(Debug, Clone)]
 pub struct Faulty<S> {
     inner: Arc<S>,
     state: Arc<Mutex<Inner>>,

---- same_seed_reproduces_the_same_failures stdout ----

thread 'same_seed_reproduces_the_same_failures' panicked at crates/pstore-blob/tests/faults.rs:48:5:
assertion `left != right` failed: a different seed must diverge
  left: [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true]
 right: [true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true]

---- slowdown_reduces_concurrency_then_recovers stdout ----

thread 'slowdown_reduces_concurrency_then_recovers' panicked at crates/pstore-blob/tests/faults.rs:153:5:
a 503 must reduce the limit, got 32

---- a_fault_rate_of_one_injects_on_every_call_and_zero_on_none stdout ----

thread 'a_fault_rate_of_one_injects_on_every_call_and_zero_on_none' panicked at crates/pstore-blob/tests/faults.rs:312:9:
assertion failed: always_write.put(&k("a"), Bytes::from_static(b"x")).await.is_err()

failures:
    a_fault_rate_of_one_injects_on_every_call_and_zero_on_none
    an_injected_write_fault_does_not_reach_the_backend
    each_fault_kind_is_injected_independently
    injected_faults_land_at_roughly_the_rate_asked_for
    retries_are_bounded
    same_seed_reproduces_the_same_failures
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 6 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
