*** crates/pstore-blob/src/faulty.rs:53:9: replace Inner::next_f64 -> f64 with -1.0

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace Inner::next_f64 -> f64 with -1.0
@@ -45,23 +45,17 @@
     /// the source and cannot drift with a dependency's version.
     seed: u64,
     faults: Faults,
     ops: u32,
 }
 
 impl Inner {
     fn next_f64(&mut self) -> f64 {
-        self.seed = self.seed.wrapping_add(0x9E37_79B9_7F4A_7C15);
-        let mut z = self.seed;
-        z = (z ^ (z >> 30)).wrapping_mul(0xBF58_476D_1CE4_E5B9);
-        z = (z ^ (z >> 27)).wrapping_mul(0x94D0_49BB_1331_11EB);
-        z ^= z >> 31;
-        // 53 bits of mantissa: the same value on every platform.
-        ((z >> 11) as f64) / ((1u64 << 53) as f64)
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Wraps a backend and injects faults from a seed.
 #[derive(Debug, Clone)]
 pub struct Faulty<S> {
     inner: Arc<S>,
     state: Arc<Mutex<Inner>>,

---- a_zero_rate_injects_nothing stdout ----

thread 'a_zero_rate_injects_nothing' panicked at crates/pstore-blob/tests/faults.rs:59:52:
called `Result::unwrap()` on an `Err` value: SlowDown

---- same_seed_reproduces_the_same_failures stdout ----

thread 'same_seed_reproduces_the_same_failures' panicked at crates/pstore-blob/tests/faults.rs:35:56:
called `Result::unwrap()` on an `Err` value: SlowDown

---- each_fault_kind_is_injected_independently stdout ----

thread 'each_fault_kind_is_injected_independently' panicked at crates/pstore-blob/tests/faults.rs:104:5:
assertion `left == right` failed
  left: Lost
 right: Contended

failures:
    a_slow_down_halves_the_limit_rather_than_merely_lowering_it
    a_transient_slowdown_is_retried_and_succeeds
    a_zero_rate_injects_nothing
    each_fault_kind_is_injected_independently
    same_seed_reproduces_the_same_failures
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 4 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
