*** crates/pstore-blob/src/faulty.rs:59:28: replace / with * in Inner::next_f64

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace / with * in Inner::next_f64
@@ -51,17 +51,17 @@
 impl Inner {
     fn next_f64(&mut self) -> f64 {
         self.seed = self.seed.wrapping_add(0x9E37_79B9_7F4A_7C15);
         let mut z = self.seed;
         z = (z ^ (z >> 30)).wrapping_mul(0xBF58_476D_1CE4_E5B9);
         z = (z ^ (z >> 27)).wrapping_mul(0x94D0_49BB_1331_11EB);
         z ^= z >> 31;
         // 53 bits of mantissa: the same value on every platform.
-        ((z >> 11) as f64) / ((1u64 << 53) as f64)
+        ((z >> 11) as f64) * /* ~ changed by cargo-mutants ~ */ ((1u64 << 53) as f64)
     }
 }
 
 /// Wraps a backend and injects faults from a seed.
 #[derive(Debug, Clone)]
 pub struct Faulty<S> {
     inner: Arc<S>,
     state: Arc<Mutex<Inner>>,

---- an_injected_write_fault_does_not_reach_the_backend stdout ----

thread 'an_injected_write_fault_does_not_reach_the_backend' panicked at crates/pstore-blob/tests/faults.rs:128:5:
the refused write must not have landed

---- each_fault_kind_is_injected_independently stdout ----

thread 'each_fault_kind_is_injected_independently' panicked at crates/pstore-blob/tests/faults.rs:75:5:
assertion failed: matches!(slow.get(&k("a")).await.unwrap_err(), BlobError::SlowDown)

---- retries_are_bounded stdout ----

thread 'retries_are_bounded' panicked at crates/pstore-blob/tests/faults.rs:180:5:
assertion failed: matches!(s.get(&k("a")).await.unwrap_err(), BlobError::SlowDown)

failures:
    an_injected_write_fault_does_not_reach_the_backend
    each_fault_kind_is_injected_independently
    retries_are_bounded
    same_seed_reproduces_the_same_failures
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 5 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
