*** crates/pstore-blob/src/faulty.rs:97:9: replace Faulty<S>::roll -> (Faults, f64, u32) with (Default::default(), 0.0, 1)

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace Faulty<S>::roll -> (Faults, f64, u32) with (Default::default(), 0.0, 1)
@@ -89,20 +89,17 @@
         self.state
             .lock()
             .unwrap_or_else(std::sync::PoisonError::into_inner)
     }
 
     /// Draws once per operation, so the sequence depends only on the seed and the number
     /// of operations — never on timing.
     fn roll(&self) -> (Faults, f64, u32) {
-        let mut st = self.lock();
-        st.ops = st.ops.saturating_add(1);
-        let (f, ops) = (st.faults, st.ops);
-        (f, st.next_f64(), ops)
+        (Default::default(), 0.0, 1) /* ~ changed by cargo-mutants ~ */
     }
 
     fn read_fault(&self) -> Option<BlobError> {
         let (f, r, ops) = self.roll();
         if ops <= f.slow_down_first_n {
             return Some(BlobError::SlowDown);
         }
         if r < f.slow_down {

---- each_fault_kind_is_injected_independently stdout ----

thread 'each_fault_kind_is_injected_independently' panicked at crates/pstore-blob/tests/faults.rs:75:5:
assertion failed: matches!(slow.get(&k("a")).await.unwrap_err(), BlobError::SlowDown)

---- a_slow_down_halves_the_limit_rather_than_merely_lowering_it stdout ----

thread 'a_slow_down_halves_the_limit_rather_than_merely_lowering_it' panicked at crates/pstore-blob/tests/faults.rs:224:5:
assertion `left == right` failed: one 503 must halve 32, not floor it
  left: 32
 right: 16

---- an_injected_write_fault_does_not_reach_the_backend stdout ----

thread 'an_injected_write_fault_does_not_reach_the_backend' panicked at crates/pstore-blob/tests/faults.rs:128:5:
the refused write must not have landed

failures:
    a_slow_down_halves_the_limit_rather_than_merely_lowering_it
    a_transient_slowdown_is_retried_and_succeeds
    an_injected_write_fault_does_not_reach_the_backend
    each_fault_kind_is_injected_independently
    retries_are_bounded
    same_seed_reproduces_the_same_failures
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 3 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
