*** crates/pstore-blob/src/faulty.rs:97:9: replace Faulty<S>::roll -> (Faults, f64, u32) with (Default::default(), 1.0, 1)

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace Faulty<S>::roll -> (Faults, f64, u32) with (Default::default(), 1.0, 1)
@@ -89,20 +89,17 @@
         self.state
             .lock()
             .unwrap_or_else(std::sync::PoisonError::into_inner)
     }
 
     /// Draws once per operation, so the sequence depends only on the seed and the number
     /// of operations — never on timing.
     fn roll(&self) -> (Faults, f64, u32) {
-        let mut st = self.lock();
-        st.ops = st.ops.saturating_add(1);
-        let (f, ops) = (st.faults, st.ops);
-        (f, st.next_f64(), ops)
+        (Default::default(), 1.0, 1) /* ~ changed by cargo-mutants ~ */
     }
 
     fn read_fault(&self) -> Option<BlobError> {
         let (f, r, ops) = self.roll();
         if ops <= f.slow_down_first_n {
             return Some(BlobError::SlowDown);
         }
         if r < f.slow_down {

---- a_slow_down_halves_the_limit_rather_than_merely_lowering_it stdout ----

thread 'a_slow_down_halves_the_limit_rather_than_merely_lowering_it' panicked at crates/pstore-blob/tests/faults.rs:224:5:
assertion `left == right` failed: one 503 must halve 32, not floor it
  left: 32
 right: 16

---- a_transient_slowdown_is_retried_and_succeeds stdout ----

thread 'a_transient_slowdown_is_retried_and_succeeds' panicked at crates/pstore-blob/tests/faults.rs:203:5:
assertion `left == right` failed
  left: 1
 right: 2

---- a_fault_rate_of_one_injects_on_every_call_and_zero_on_none stdout ----

thread 'a_fault_rate_of_one_injects_on_every_call_and_zero_on_none' panicked at crates/pstore-blob/tests/faults.rs:312:9:
assertion failed: always_write.put(&k("a"), Bytes::from_static(b"x")).await.is_err()

failures:
    a_fault_rate_of_one_injects_on_every_call_and_zero_on_none
    a_slow_down_halves_the_limit_rather_than_merely_lowering_it
    a_transient_slowdown_is_retried_and_succeeds
    an_injected_write_fault_does_not_reach_the_backend
    each_fault_kind_is_injected_independently
    injected_faults_land_at_roughly_the_rate_asked_for
    retries_are_bounded
    same_seed_reproduces_the_same_failures
    slow_down_first_n_covers_exactly_the_first_n_operations
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 3 passed; 10 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
