*** crates/pstore-blob/src/memory.rs:107:9: replace <impl crate::BlobStore for MemoryStore>::get -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ replace <impl crate::BlobStore for MemoryStore>::get -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -99,21 +99,17 @@
 
 #[async_trait::async_trait]
 impl crate::BlobStore for MemoryStore {
     fn capabilities(&self) -> &Capabilities {
         &self.caps
     }
 
     async fn get(&self, key: &Key) -> Result<Bytes, BlobError> {
-        self.lock()
-            .objects
-            .get(key.as_str())
-            .map(|(b, _)| b.clone())
-            .ok_or_else(|| BlobError::NotFound(key.to_string()))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
         let body = self.get(key).await?;
         let len = body.len() as u64;
         if range.end > len || range.start > range.end {
             return Err(BlobError::RangeOutOfBounds(range, len));
         }

---- accounting_separates_read_write_and_list_classes stdout ----

thread 'accounting_separates_read_write_and_list_classes' panicked at crates/pstore-blob/tests/accounting.rs:45:38:
called `Result::unwrap()` on an `Err` value: RangeOutOfBounds(0..2, 0)

failures:
    accounting_separates_read_write_and_list_classes

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
