*** crates/pstore-blob/src/memory.rs:117:43: replace > with == in <impl crate::BlobStore for MemoryStore>::get_range

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ replace > with == in <impl crate::BlobStore for MemoryStore>::get_range
@@ -109,17 +109,17 @@
             .get(key.as_str())
             .map(|(b, _)| b.clone())
             .ok_or_else(|| BlobError::NotFound(key.to_string()))
     }
 
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
         let body = self.get(key).await?;
         let len = body.len() as u64;
-        if range.end > len || range.start > range.end {
+        if range.end > len || range.start == /* ~ changed by cargo-mutants ~ */ range.end {
             return Err(BlobError::RangeOutOfBounds(range, len));
         }
         // `slice` rather than indexing: this crate denies `indexing_slicing`, and the
         // bounds are checked above where the error is meaningful.
         Ok(body.slice(range.start as usize..range.end as usize))
     }
 
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, CasTag), BlobError> {

---- a_range_past_the_end_is_an_error_not_a_short_read stdout ----

thread 'a_range_past_the_end_is_an_error_not_a_short_read' panicked at /home/tuong/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/bytes-1.12.1/src/bytes.rs:374:28:
range start must not be greater than end: 8 <= 2

---- an_empty_range_is_legal_and_returns_nothing stdout ----

thread 'an_empty_range_is_legal_and_returns_nothing' panicked at crates/pstore-blob/tests/semantics.rs:194:46:
called `Result::unwrap()` on an `Err` value: RangeOutOfBounds(2..2, 4)

failures:
    a_range_past_the_end_is_an_error_not_a_short_read
    an_empty_range_is_legal_and_returns_nothing

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
