*** crates/pstore-blob/src/memory.rs:132:22: replace > with < in <impl crate::BlobStore for MemoryStore>::get_range

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ replace > with < in <impl crate::BlobStore for MemoryStore>::get_range
@@ -124,17 +124,17 @@
             .get(key.as_str())
             .map(|(b, _)| b.clone())
             .ok_or_else(|| BlobError::NotFound(key.to_string()))
     }
 
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
         let body = self.get(key).await?;
         let len = body.len() as u64;
-        if range.end > len || range.start > range.end {
+        if range.end < /* ~ changed by cargo-mutants ~ */ len || range.start > range.end {
             return Err(BlobError::RangeOutOfBounds(range, len));
         }
         // `slice` rather than indexing: this crate denies `indexing_slicing`, and the
         // bounds are checked above where the error is meaningful.
         Ok(body.slice(range.start as usize..range.end as usize))
     }
 
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, CasTag), BlobError> {

---- accounting_separates_read_write_and_list_classes stdout ----

thread 'accounting_separates_read_write_and_list_classes' panicked at crates/pstore-blob/tests/accounting.rs:49:38:
called `Result::unwrap()` on an `Err` value: RangeOutOfBounds(0..2, 5)

---- bytes_are_counted_not_just_requests stdout ----

thread 'bytes_are_counted_not_just_requests' panicked at crates/pstore-blob/tests/accounting.rs:115:39:
called `Result::unwrap()` on an `Err` value: RangeOutOfBounds(0..64, 1000)

---- ranges_are_recorded_so_bytes_can_be_attributed_to_a_section stdout ----

thread 'ranges_are_recorded_so_bytes_can_be_attributed_to_a_section' panicked at crates/pstore-blob/tests/accounting.rs:138:44:
called `Result::unwrap()` on an `Err` value: RangeOutOfBounds(100..200, 4096)

failures:
    accounting_separates_read_write_and_list_classes
    bytes_are_counted_not_just_requests
    ranges_are_recorded_so_bytes_can_be_attributed_to_a_section

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
