*** crates/pstore-blob/src/memory.rs:133:9: replace <impl crate::BlobStore for MemoryStore>::head -> Result<u64, BlobError> with Ok(1)

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ replace <impl crate::BlobStore for MemoryStore>::head -> Result<u64, BlobError> with Ok(1)
@@ -125,17 +125,17 @@
     async fn get_tag(&self, key: &Key) -> Option<CasTag> {
         self.lock()
             .objects
             .get(key.as_str())
             .map(|(_, t)| t.clone())
     }
 
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {
-        self.get(key).await.map(|b| b.len() as u64)
+        Ok(1) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn put(&self, key: &Key, body: Bytes) -> Result<PutOutcome, BlobError> {
         let mut st = self.lock();
         let tag = self.next_tag(&mut st, &body);
         st.objects
             .insert(key.as_str().to_owned(), (body, tag.clone()));
         Ok(PutOutcome { tag })

---- head_reports_size_without_the_body stdout ----

thread 'head_reports_size_without_the_body' panicked at crates/pstore-blob/tests/semantics.rs:139:5:
assertion `left == right` failed
  left: 1
 right: 4096

failures:
    head_reports_size_without_the_body

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
