*** crates/pstore-blob/src/memory.rs:135:9: replace <impl crate::BlobStore for MemoryStore>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ replace <impl crate::BlobStore for MemoryStore>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -127,19 +127,17 @@
         self.lock()
             .objects
             .get(key.as_str())
             .map(|(b, t)| (b.clone(), t.clone()))
             .ok_or_else(|| BlobError::NotFound(key.to_string()))
     }
 
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
-        let body = self.get(key).await?;
-        let start = (body.len() as u64).saturating_sub(n) as usize;
-        Ok(body.slice(start..))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_tag(&self, key: &Key) -> Option<CasTag> {
         self.lock()
             .objects
             .get(key.as_str())
             .map(|(_, t)| t.clone())
     }

*** result: Success
