*** crates/pstore-blob/src/memory.rs:170:61: replace == with != in <impl crate::BlobStore for MemoryStore>::put_conditional

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ replace == with != in <impl crate::BlobStore for MemoryStore>::put_conditional
@@ -162,17 +162,17 @@
         body: Bytes,
         pre: Precondition,
     ) -> Result<PutOutcome, CasError> {
         let mut st = self.lock();
         let current = st.objects.get(key.as_str()).map(|(_, t)| t.clone());
         let ok = match (&pre, &current) {
             (Precondition::NotExists, None) => true,
             (Precondition::NotExists, Some(_)) => false,
-            (Precondition::Match(want), Some(have)) => want == have,
+            (Precondition::Match(want), Some(have)) => want != /* ~ changed by cargo-mutants ~ */ have,
             (Precondition::Match(_), None) => false,
         };
         if !ok {
             return Err(CasError::Lost);
         }
         let tag = self.next_tag(&mut st, &body);
         st.objects
             .insert(key.as_str().to_owned(), (body, tag.clone()));

---- cas_rejects_stale_tag stdout ----

thread 'cas_rejects_stale_tag' panicked at crates/pstore-blob/tests/cas.rs:50:10:
CAS on the observed tag must succeed: Lost

failures:
    cas_rejects_stale_tag

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
