*** crates/pstore-blob/src/memory.rs:173:12: delete ! in <impl crate::BlobStore for MemoryStore>::put_conditional

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ delete ! in <impl crate::BlobStore for MemoryStore>::put_conditional
@@ -165,17 +165,17 @@
         let mut st = self.lock();
         let current = st.objects.get(key.as_str()).map(|(_, t)| t.clone());
         let ok = match (&pre, &current) {
             (Precondition::NotExists, None) => true,
             (Precondition::NotExists, Some(_)) => false,
             (Precondition::Match(want), Some(have)) => want == have,
             (Precondition::Match(_), None) => false,
         };
-        if !ok {
+        if  /* ~ changed by cargo-mutants ~ */ok {
             return Err(CasError::Lost);
         }
         let tag = self.next_tag(&mut st, &body);
         st.objects
             .insert(key.as_str().to_owned(), (body, tag.clone()));
         Ok(PutOutcome { tag })
     }

---- a_failed_conditional_write_is_still_billed stdout ----

thread 'a_failed_conditional_write_is_still_billed' panicked at crates/pstore-blob/tests/accounting.rs:85:10:
called `Result::unwrap()` on an `Err` value: Lost

failures:
    a_failed_conditional_write_is_still_billed

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
