*** crates/pstore-blob/src/memory.rs:213:9: replace <impl crate::BlobStore for MemoryStore>::list_unrestricted -> Result<Vec<Key>, BlobError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ replace <impl crate::BlobStore for MemoryStore>::list_unrestricted -> Result<Vec<Key>, BlobError> with Ok(vec![])
@@ -205,17 +205,11 @@
         let mut st = self.lock();
         for k in keys {
             st.objects.remove(k.as_str());
         }
         Ok(())
     }
 
     async fn list_unrestricted(&self, prefix: &Key) -> Result<Vec<Key>, BlobError> {
-        Ok(self
-            .lock()
-            .objects
-            .keys()
-            .filter(|k| k.starts_with(prefix.as_str()))
-            .map(|k| Key::new(k.clone()))
-            .collect())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }

---- list_is_prefix_filtered stdout ----

thread 'list_is_prefix_filtered' panicked at crates/pstore-blob/tests/semantics.rs:154:5:
assertion `left == right` failed
  left: []
 right: [Key("a/1"), Key("a/2")]

failures:
    list_is_prefix_filtered

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
