*** crates/pstore-blob/src/memory.rs:91:23: replace ^= with &= in MemoryStore::next_tag

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ replace ^= with &= in MemoryStore::next_tag
@@ -83,17 +83,17 @@
                 st.generation = st.generation.saturating_add(1);
                 CasTag::new(st.generation.to_string())
             }
             // FNV-1a. Not a real MD5, but it has the property under test: equal content
             // yields an equal tag.
             TagStyle::ContentHash => {
                 let mut h: u64 = 0xcbf2_9ce4_8422_2325;
                 for b in body.iter() {
-                    h ^= u64::from(*b);
+                    h &= /* ~ changed by cargo-mutants ~ */ u64::from(*b);
                     h = h.wrapping_mul(0x1000_0000_01b3);
                 }
                 CasTag::new(format!("\"{h:016x}\""))
             }
         }
     }
 }

*** result: Success
