*** crates/pstore-blob/src/object_store_backend.rs:119:29: replace != with == in <impl crate::BlobStore for ObjectStoreBackend>::get_range

*** mutation diff:
--- crates/pstore-blob/src/object_store_backend.rs
+++ replace != with == in <impl crate::BlobStore for ObjectStoreBackend>::get_range
@@ -111,17 +111,17 @@
             .await
             .map_err(Self::map_err)?;
         // ⚠️ FOUND BY THE CONFORMANCE SUITE, not by reading the docs. HTTP `Range` is
         // permitted to answer a range that overruns the object with `206 Partial
         // Content` and the bytes that exist -- a SHORT READ, not an error -- and
         // `object_store` passes that through. Our trait promises the requested bytes or
         // an error, because a silent truncation here surfaces several layers away as a
         // recall bug: a posting list that ends early scores as a missing document.
-        if got.len() as u64 != want {
+        if got.len() as u64 == /* ~ changed by cargo-mutants ~ */ want {
             return Err(BlobError::RangeOutOfBounds(range, got.len() as u64));
         }
         Ok(got)
     }
 
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, CasTag), BlobError> {
         // One GET: the response carries the ETag, so the pair is atomic by construction
         // rather than by luck.

*** result: Success
