*** crates/pstore-blob/src/object_store_backend.rs:126:9: replace <impl crate::BlobStore for ObjectStoreBackend>::get_tag -> Option<CasTag> with None

*** mutation diff:
--- crates/pstore-blob/src/object_store_backend.rs
+++ replace <impl crate::BlobStore for ObjectStoreBackend>::get_tag -> Option<CasTag> with None
@@ -118,22 +118,17 @@
         // recall bug: a posting list that ends early scores as a missing document.
         if got.len() as u64 != want {
             return Err(BlobError::RangeOutOfBounds(range, got.len() as u64));
         }
         Ok(got)
     }
 
     async fn get_tag(&self, key: &Key) -> Option<CasTag> {
-        self.inner
-            .head(&Self::path(key))
-            .await
-            .ok()
-            .and_then(|m| m.e_tag)
-            .map(CasTag::new)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {
         self.inner
             .head(&Self::path(key))
             .await
             .map(|m| m.size)
             .map_err(Self::map_err)

---- the_trait_fits_a_real_object_store_implementation stdout ----

thread 'the_trait_fits_a_real_object_store_implementation' panicked at crates/pstore-blob/tests/object_store_adapter.rs:38:5:
assertion failed: s.get_tag(&k).await.is_some()

failures:
    the_trait_fits_a_real_object_store_implementation

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
