*** crates/pstore-blob/src/object_store_backend.rs:178:9: replace <impl crate::BlobStore for ObjectStoreBackend>::delete_batch -> Result<(), BlobError> with Ok(())

*** mutation diff:
--- crates/pstore-blob/src/object_store_backend.rs
+++ replace <impl crate::BlobStore for ObjectStoreBackend>::delete_batch -> Result<(), BlobError> with Ok(())
@@ -170,23 +170,17 @@
         }
     }
 
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
         // One request per key. ⚠️ S3 offers DeleteObjects for 1000 at a time and this
         // does not use it, so GC costs 1000x what it should. Recorded rather than fixed:
         // it needs `delete_stream`, which needs the futures machinery, and M0a's job here
         // is to learn whether the trait fits — not to optimise an unverified adapter.
-        for key in keys {
-            self.inner
-                .delete(&Self::path(key))
-                .await
-                .map_err(Self::map_err)?;
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn list_unrestricted(&self, prefix: &Key) -> Result<Vec<Key>, BlobError> {
         // `list_with_delimiter` rather than the streaming `list`, so the adapter needs no
         // futures dependency. Listing is banned on every hot path anyway, so the
         // non-streaming form is the right shape for the three sanctioned uses.
         let r = self
             .inner

---- the_trait_fits_a_real_object_store_implementation stdout ----

thread 'the_trait_fits_a_real_object_store_implementation' panicked at crates/pstore-blob/tests/object_store_adapter.rs:47:5:
assertion failed: s.get(&k).await.is_err()

---- the_conformance_suite_runs_through_the_adapter stdout ----

thread 'the_conformance_suite_runs_through_the_adapter' panicked at crates/pstore-blob/tests/object_store_adapter.rs:87:5:
divergences: [Probe { name: "batch_delete", outcome: Divergent("a deleted key still returned a body") }]

failures:
    the_conformance_suite_runs_through_the_adapter
    the_trait_fits_a_real_object_store_implementation

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
