*** crates/pstore-blob/src/object_store_backend.rs:191:9: replace <impl crate::BlobStore for ObjectStoreBackend>::list_unrestricted -> Result<Vec<Key>, BlobError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-blob/src/object_store_backend.rs
+++ replace <impl crate::BlobStore for ObjectStoreBackend>::list_unrestricted -> Result<Vec<Key>, BlobError> with Ok(vec![])
@@ -183,25 +183,17 @@
         }
         Ok(())
     }
 
     async fn list_unrestricted(&self, prefix: &Key) -> Result<Vec<Key>, BlobError> {
         // `list_with_delimiter` rather than the streaming `list`, so the adapter needs no
         // futures dependency. Listing is banned on every hot path anyway, so the
         // non-streaming form is the right shape for the three sanctioned uses.
-        let r = self
-            .inner
-            .list_with_delimiter(Some(&Self::path(prefix)))
-            .await
-            .map_err(Self::map_err)?;
-        Ok(r.objects
-            .into_iter()
-            .map(|m| Key::new(m.location.to_string()))
-            .collect())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Maps an `object_store` error onto the 412/409 split the retry policy rests on.
 ///
 /// Free-standing so it can be tested directly: the 409 path is reachable only from a real
 /// S3 under concurrent conditional writes, which is precisely what we cannot produce.
 ///

---- the_trait_fits_a_real_object_store_implementation stdout ----

thread 'the_trait_fits_a_real_object_store_implementation' panicked at crates/pstore-blob/tests/object_store_adapter.rs:39:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    the_trait_fits_a_real_object_store_implementation

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
