*** crates/pstore-blob/src/object_store_backend.rs:247:34: replace || with && in map_cas_err

*** mutation diff:
--- crates/pstore-blob/src/object_store_backend.rs
+++ replace || with && in map_cas_err
@@ -239,17 +239,17 @@
 /// exit item rather than something to assume.
 pub(crate) fn map_cas_err(e: &object_store::Error) -> CasError {
     match e {
         object_store::Error::AlreadyExists { .. } | object_store::Error::Precondition { .. } => {
             CasError::Lost
         }
         other => {
             let s = other.to_string();
-            if s.contains("409") || s.contains("ConditionalRequestConflict") {
+            if s.contains("409") && /* ~ changed by cargo-mutants ~ */ s.contains("ConditionalRequestConflict") {
                 CasError::Contended
             } else {
                 CasError::Io(s)
             }
         }
     }
 }

*** result: Success
