*** crates/pstore-blob/src/object_store_backend.rs:49:32: replace * with / in ObjectStoreBackend::unprobed

*** mutation diff:
--- crates/pstore-blob/src/object_store_backend.rs
+++ replace * with / in ObjectStoreBackend::unprobed
@@ -41,17 +41,17 @@
     #[must_use]
     pub fn unprobed(backend: impl Into<String>) -> Capabilities {
         Capabilities {
             backend: backend.into(),
             cas: Support::Divergent("not yet probed by the conformance suite".to_owned()),
             create_if_absent: Support::Divergent("not yet probed".to_owned()),
             delete_is_free: false,
             max_batch_delete: 1000,
-            coalesce_gap: 1024 * 1024,
+            coalesce_gap: 1024 / /* ~ changed by cargo-mutants ~ */ 1024,
         }
     }
 
     fn path(key: &Key) -> Path {
         Path::from(key.as_str())
     }
 
     fn map_err(e: object_store::Error) -> BlobError {

*** result: Success
