*** crates/pstore-blob/src/object_store_backend.rs:54:9: replace ObjectStoreBackend::path -> Path with Default::default()

*** mutation diff:
--- crates/pstore-blob/src/object_store_backend.rs
+++ replace ObjectStoreBackend::path -> Path with Default::default()
@@ -46,17 +46,17 @@
             create_if_absent: Support::Divergent("not yet probed".to_owned()),
             delete_is_free: false,
             max_batch_delete: 1000,
             coalesce_gap: 1024 * 1024,
         }
     }
 
     fn path(key: &Key) -> Path {
-        Path::from(key.as_str())
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn map_err(e: object_store::Error) -> BlobError {
         match e {
             object_store::Error::NotFound { .. } => BlobError::NotFound(e.to_string()),
             other => {
                 // `object_store` surfaces 503 SlowDown only in the message, which is
                 // itself a finding: the signal our congestion controller needs is not a

---- the_trait_fits_a_real_object_store_implementation stdout ----

thread 'the_trait_fits_a_real_object_store_implementation' panicked at crates/pstore-blob/tests/object_store_adapter.rs:39:5:
assertion `left == right` failed
  left: 0
 right: 1

---- the_conformance_suite_runs_through_the_adapter stdout ----

thread 'the_conformance_suite_runs_through_the_adapter' panicked at crates/pstore-blob/tests/object_store_adapter.rs:87:5:
divergences: [Probe { name: "compare_and_swap", outcome: Unsupported }, Probe { name: "aba_resistance", outcome: Unsupported }, Probe { name: "missing_key_is_an_error", outcome: Divergent("a missing key returned a body") }]

failures:
    the_conformance_suite_runs_through_the_adapter
    the_trait_fits_a_real_object_store_implementation

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
