*** crates/pstore-blob/src/object_store_backend.rs:75:9: replace ObjectStoreBackend::put_opts -> PutOptions with Default::default()

*** mutation diff:
--- crates/pstore-blob/src/object_store_backend.rs
+++ replace ObjectStoreBackend::put_opts -> PutOptions with Default::default()
@@ -67,28 +67,17 @@
                 } else {
                     BlobError::Other(s)
                 }
             }
         }
     }
 
     fn put_opts(pre: &Precondition) -> PutOptions {
-        PutOptions {
-            mode: match pre {
-                Precondition::NotExists => PutMode::Create,
-                Precondition::Match(tag) => PutMode::Update(UpdateVersion {
-                    e_tag: Some(tag.as_str().to_owned()),
-                    version: None,
-                }),
-            },
-            tags: TagSet::default(),
-            attributes: Attributes::default(),
-            extensions: object_store::Extensions::default(),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[async_trait::async_trait]
 impl crate::BlobStore for ObjectStoreBackend {
     fn capabilities(&self) -> &Capabilities {
         &self.caps
     }

---- the_conformance_suite_runs_through_the_adapter stdout ----

thread 'the_conformance_suite_runs_through_the_adapter' panicked at crates/pstore-blob/tests/object_store_adapter.rs:87:5:

failures:
    the_conformance_suite_runs_through_the_adapter

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
