*** crates/pstore-blob/src/store.rs:25:9: replace BlobStore::get_ranges -> Result<Vec<Bytes>, BlobError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-blob/src/store.rs
+++ replace BlobStore::get_ranges -> Result<Vec<Bytes>, BlobError> with Ok(vec![])
@@ -17,30 +17,17 @@
     /// One byte range.
     async fn get_range(&self, key: &Key, range: Range<u64>) -> Result<Bytes, BlobError>;
 
     /// Several byte ranges at once, **coalescing nearby ones into a single request**.
     ///
     /// The workhorse of the read path. Provided rather than required, so no backend can
     /// accidentally implement the naive one-request-per-range version.
     async fn get_ranges(&self, key: &Key, ranges: &[Range<u64>]) -> Result<Vec<Bytes>, BlobError> {
-        let gap = self.capabilities().coalesce_gap;
-        let mut out: Vec<(usize, Bytes)> = Vec::with_capacity(ranges.len());
-        for fetch in crate::coalesce(ranges, gap) {
-            let base = fetch.span.start;
-            let buf = self.get_range(key, fetch.span.clone()).await?;
-            for (i, r) in fetch.serves {
-                let (lo, hi) = ((r.start - base) as usize, (r.end - base) as usize);
-                // Slice, not copy: `Bytes` is refcounted, so the merged buffer is shared
-                // by every range it serves.
-                out.push((i, buf.slice(lo..hi)));
-            }
-        }
-        out.sort_by_key(|(i, _)| *i);
-        Ok(out.into_iter().map(|(_, b)| b).collect())
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// The current CAS tag, or `None` if the object is absent.
     ///
     /// The rebase step of the commit protocol: read the state an attempt will be
     /// conditioned on. Provided in terms of `head`-like access so every backend has it.
     async fn get_tag(&self, key: &Key) -> Option<pstore_types::CasTag>;

---- a_single_far_range_is_offset_correctly stdout ----

thread 'a_single_far_range_is_offset_correctly' panicked at crates/pstore-blob/tests/coalescing.rs:122:20:
index out of bounds: the len is 0 but the index is 0

---- coalescing_actually_saves_requests stdout ----

thread 'coalescing_actually_saves_requests' panicked at crates/pstore-blob/tests/coalescing.rs:78:5:
assertion `left == right` failed
  left: 0
 right: 8

---- coalesced_reads_equal_separate_reads stdout ----

thread 'coalesced_reads_equal_separate_reads' panicked at crates/pstore-blob/tests/coalescing.rs:63:5:
assertion `left == right` failed
  left: []

failures:
    a_single_far_range_is_offset_correctly
    coalesced_reads_equal_separate_reads
    coalescing_actually_saves_requests
    ranges_out_of_order_are_returned_in_the_order_asked
    slices_are_offset_from_the_fetch_start_not_the_object_start

test result: FAILED. 3 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
