*** crates/pstore-blob/src/store.rs:42:42: replace - with + in BlobStore::get_ranges

*** mutation diff:
--- crates/pstore-blob/src/store.rs
+++ replace - with + in BlobStore::get_ranges
@@ -34,17 +34,17 @@
             plan.iter().map(|f| self.get_range(key, f.span.clone())),
         )
         .await?;
 
         let mut out: Vec<(usize, Bytes)> = Vec::with_capacity(ranges.len());
         for (fetch, buf) in plan.into_iter().zip(fetched) {
             let base = fetch.span.start;
             for (i, r) in fetch.serves {
-                let (lo, hi) = ((r.start - base) as usize, (r.end - base) as usize);
+                let (lo, hi) = ((r.start + /* ~ changed by cargo-mutants ~ */ base) as usize, (r.end - base) as usize);
                 // Slice, not copy: `Bytes` is refcounted, so the merged buffer is shared
                 // by every range it serves.
                 out.push((i, buf.slice(lo..hi)));
             }
         }
         out.sort_by_key(|(i, _)| *i);
         Ok(out.into_iter().map(|(_, b)| b).collect())
     }

---- a_single_far_range_is_offset_correctly stdout ----

thread 'a_single_far_range_is_offset_correctly' panicked at /home/tuong/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/bytes-1.12.1/src/bytes.rs:374:28:
range start must not be greater than end: 400 <= 5

---- slices_are_offset_from_the_fetch_start_not_the_object_start stdout ----

thread 'slices_are_offset_from_the_fetch_start_not_the_object_start' panicked at /home/tuong/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/bytes-1.12.1/src/bytes.rs:374:28:
range start must not be greater than end: 200 <= 4

failures:
    a_single_far_range_is_offset_correctly
    slices_are_offset_from_the_fetch_start_not_the_object_start

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
