*** crates/pstore-blob/src/store.rs:42:42: replace - with / in BlobStore::get_ranges

*** mutation diff:
--- crates/pstore-blob/src/store.rs
+++ replace - with / in BlobStore::get_ranges
@@ -34,17 +34,17 @@
             plan.iter().map(|f| self.get_range(key, f.span.clone())),
         )
         .await?;
 
         let mut out: Vec<(usize, Bytes)> = Vec::with_capacity(ranges.len());
         for (fetch, buf) in plan.into_iter().zip(fetched) {
             let base = fetch.span.start;
             for (i, r) in fetch.serves {
-                let (lo, hi) = ((r.start - base) as usize, (r.end - base) as usize);
+                let (lo, hi) = ((r.start / /* ~ changed by cargo-mutants ~ */ base) as usize, (r.end - base) as usize);
                 // Slice, not copy: `Bytes` is refcounted, so the merged buffer is shared
                 // by every range it serves.
                 out.push((i, buf.slice(lo..hi)));
             }
         }
         out.sort_by_key(|(i, _)| *i);
         Ok(out.into_iter().map(|(_, b)| b).collect())
     }

---- coalesced_reads_equal_separate_reads stdout ----

thread 'coalesced_reads_equal_separate_reads' panicked at /tmp/cargo-mutants-pstore-ZIiCgB.tmp/crates/pstore-blob/src/store.rs:42:33:
attempt to divide by zero

---- coalescing_actually_saves_requests stdout ----

thread 'coalescing_actually_saves_requests' panicked at /tmp/cargo-mutants-pstore-ZIiCgB.tmp/crates/pstore-blob/src/store.rs:42:33:
attempt to divide by zero

---- slices_are_offset_from_the_fetch_start_not_the_object_start stdout ----

thread 'slices_are_offset_from_the_fetch_start_not_the_object_start' panicked at crates/pstore-blob/tests/coalescing.rs:112:5:
assertion `left == right` failed
  left: [101, 102, 103]
 right: [100, 101, 102, 103]

failures:
    a_single_far_range_is_offset_correctly
    coalesced_reads_equal_separate_reads
    coalescing_actually_saves_requests
    ranges_out_of_order_are_returned_in_the_order_asked
    slices_are_offset_from_the_fetch_start_not_the_object_start

test result: FAILED. 3 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
