*** crates/pstore-blob/src/types.rs:27:9: replace <impl fmt::Display for Key>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/pstore-blob/src/types.rs
+++ replace <impl fmt::Display for Key>::fmt -> fmt::Result with Ok(Default::default())
@@ -19,17 +19,17 @@
     #[must_use]
     pub fn as_str(&self) -> &str {
         &self.0
     }
 }
 
 impl fmt::Display for Key {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        f.write_str(&self.0)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// The condition a conditional write is made under.
 #[derive(Debug, Clone, PartialEq, Eq)]
 pub enum Precondition {
     /// Create only if absent. Maps to `If-None-Match: *` / `ifGenerationMatch=0`.
     ///

---- a_key_displays_as_the_path_it_will_be_fetched_from stdout ----

thread 'a_key_displays_as_the_path_it_will_be_fetched_from' panicked at crates/pstore-blob/tests/semantics.rs:224:5:
assertion `left == right` failed
  left: ""
 right: "h/idx/1/HEAD"

failures:
    a_key_displays_as_the_path_it_will_be_fetched_from

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
