*** crates/pstore-engine/src/bundle.rs:145:5: replace read_entry -> Result<Vec<Document>, EngineError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-engine/src/bundle.rs
+++ replace read_entry -> Result<Vec<Document>, EngineError> with Ok(vec![])
@@ -137,15 +137,10 @@
         );
         out.insert(name, Entry { offset, len, docs });
     }
     Ok(out)
 }
 
 /// One index's documents, decoded from its slice of a bundle.
 pub(crate) fn read_entry(buf: &[u8], e: &Entry) -> Result<Vec<Document>, EngineError> {
-    let start = e.offset as usize;
-    let end = start
-        .checked_add(e.len as usize)
-        .ok_or(EngineError::CorruptBundle)?;
-    let run = buf.get(start..end).ok_or(EngineError::CorruptBundle)?;
-    Ok(decode_docs(run)?)
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:135:5:
rows before the hole must still be folded

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
