*** crates/pstore-engine/src/bundle.rs:73:22: replace + with * in read_index

*** mutation diff:
--- crates/pstore-engine/src/bundle.rs
+++ replace + with * in read_index
@@ -65,17 +65,17 @@
     body.extend_from_slice(&index_offset.to_le_bytes());
     body.extend_from_slice(&index_len.to_le_bytes());
     body.extend_from_slice(MAGIC);
     body
 }
 
 /// The bundle's directory: which indexes it carries and where.
 pub(crate) fn read_index(buf: &[u8]) -> Result<BTreeMap<String, Entry>, EngineError> {
-    let foot_len = 8 + 8 + 4 + 8;
+    let foot_len = 8 * /* ~ changed by cargo-mutants ~ */ 8 + 4 + 8;
     let at = buf
         .len()
         .checked_sub(foot_len)
         .ok_or(EngineError::CorruptBundle)?;
     let foot = buf.get(at..).ok_or(EngineError::CorruptBundle)?;
     if foot.get(..8) != Some(&MAGIC[..]) || foot.get(foot_len - 8..) != Some(&MAGIC[..]) {
         return Err(EngineError::CorruptBundle);
     }

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:133:20:
called `Result::unwrap()` on an `Err` value: CorruptBundle

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
