*** crates/pstore-engine/src/bundle.rs:79:42: replace || with && in read_index

*** mutation diff:
--- crates/pstore-engine/src/bundle.rs
+++ replace || with && in read_index
@@ -71,17 +71,17 @@
 /// The bundle's directory: which indexes it carries and where.
 pub(crate) fn read_index(buf: &[u8]) -> Result<BTreeMap<String, Entry>, EngineError> {
     let foot_len = 8 + 8 + 4 + 8;
     let at = buf
         .len()
         .checked_sub(foot_len)
         .ok_or(EngineError::CorruptBundle)?;
     let foot = buf.get(at..).ok_or(EngineError::CorruptBundle)?;
-    if foot.get(..8) != Some(&MAGIC[..]) || foot.get(foot_len - 8..) != Some(&MAGIC[..]) {
+    if foot.get(..8) != Some(&MAGIC[..]) && /* ~ changed by cargo-mutants ~ */ foot.get(foot_len - 8..) != Some(&MAGIC[..]) {
         return Err(EngineError::CorruptBundle);
     }
     let index_offset = u64::from_le_bytes(
         foot.get(8..16)
             .and_then(|b| b.try_into().ok())
             .ok_or(EngineError::CorruptBundle)?,
     ) as usize;
     let index_len = u32::from_le_bytes(

---- a_bundle_with_a_mangled_footer_fails_the_fold stdout ----

thread 'a_bundle_with_a_mangled_footer_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:85:5:
assertion failed: e.fold().await.is_err()

failures:
    a_bundle_with_a_mangled_footer_fails_the_fold

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
