*** crates/pstore-engine/src/head.rs:100:9: replace Head::is_folded -> bool with true

*** mutation diff:
--- crates/pstore-engine/src/head.rs
+++ replace Head::is_folded -> bool with true
@@ -92,17 +92,17 @@
             h.watermarks.insert(lane, c.u64()?);
         }
         Ok(h)
     }
 
     /// Whether this lane's sequence has already been folded into a committed epoch.
     #[must_use]
     pub fn is_folded(&self, lane: LaneId, seq: Seq) -> bool {
-        self.watermarks.get(&lane.0).is_some_and(|w| *w > seq.0)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn put_str(out: &mut Vec<u8>, s: &str) {
     out.extend_from_slice(&(s.len() as u32).to_le_bytes());
     out.extend_from_slice(s.as_bytes());
 }

---- the_watermark_says_what_has_been_folded stdout ----

thread 'the_watermark_says_what_has_been_folded' panicked at crates/pstore-engine/tests/head.rs:87:5:
seq 3 is the next unfolded one

failures:
    the_watermark_says_what_has_been_folded

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
