*** crates/pstore-engine/src/head.rs:116:9: replace Cur<'_>::take -> Result<&[u8], EngineError> with Ok(Vec::leak(vec![0]))

*** mutation diff:
--- crates/pstore-engine/src/head.rs
+++ replace Cur<'_>::take -> Result<&[u8], EngineError> with Ok(Vec::leak(vec![0]))
@@ -108,20 +108,17 @@
 
 struct Cur<'a> {
     b: &'a [u8],
     i: usize,
 }
 
 impl Cur<'_> {
     fn take(&mut self, n: usize) -> Result<&[u8], EngineError> {
-        let end = self.i.checked_add(n).ok_or(EngineError::CorruptHead)?;
-        let out = self.b.get(self.i..end).ok_or(EngineError::CorruptHead)?;
-        self.i = end;
-        Ok(out)
+        Ok(Vec::leak(vec![0])) /* ~ changed by cargo-mutants ~ */
     }
     fn u32(&mut self) -> Result<u32, EngineError> {
         Ok(u32::from_le_bytes(
             self.take(4)?
                 .try_into()
                 .map_err(|_| EngineError::CorruptHead)?,
         ))
     }

---- the_whole_flow_stays_inside_its_request_budget stdout ----

thread 'the_whole_flow_stays_inside_its_request_budget' panicked at crates/pstore-engine/tests/end_to_end.rs:105:24:
called `Result::unwrap()` on an `Err` value: CorruptHead

---- write_read_filter_and_search_one_index stdout ----

thread 'write_read_filter_and_search_one_index' panicked at crates/pstore-engine/tests/end_to_end.rs:44:28:
called `Result::unwrap()` on an `Err` value: CorruptHead

failures:
    the_whole_flow_stays_inside_its_request_budget
    write_read_filter_and_search_one_index

test result: FAILED. 0 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
