*** crates/pstore-engine/src/head.rs:150:9: replace Cur<'_>::u32 -> Result<u32, EngineError> with Ok(0)

*** mutation diff:
--- crates/pstore-engine/src/head.rs
+++ replace Cur<'_>::u32 -> Result<u32, EngineError> with Ok(0)
@@ -142,21 +142,17 @@
 impl Cur<'_> {
     fn take(&mut self, n: usize) -> Result<&[u8], EngineError> {
         let end = self.i.checked_add(n).ok_or(EngineError::CorruptHead)?;
         let out = self.b.get(self.i..end).ok_or(EngineError::CorruptHead)?;
         self.i = end;
         Ok(out)
     }
     fn u32(&mut self) -> Result<u32, EngineError> {
-        Ok(u32::from_le_bytes(
-            self.take(4)?
-                .try_into()
-                .map_err(|_| EngineError::CorruptHead)?,
-        ))
+        Ok(0) /* ~ changed by cargo-mutants ~ */
     }
     fn u64(&mut self) -> Result<u64, EngineError> {
         Ok(u64::from_le_bytes(
             self.take(8)?
                 .try_into()
                 .map_err(|_| EngineError::CorruptHead)?,
         ))
     }

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:135:5:
rows before the hole must still be folded

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
