*** crates/pstore-engine/src/head.rs:157:9: replace Cur<'_>::u64 -> Result<u64, EngineError> with Ok(0)

*** mutation diff:
--- crates/pstore-engine/src/head.rs
+++ replace Cur<'_>::u64 -> Result<u64, EngineError> with Ok(0)
@@ -149,21 +149,17 @@
     fn u32(&mut self) -> Result<u32, EngineError> {
         Ok(u32::from_le_bytes(
             self.take(4)?
                 .try_into()
                 .map_err(|_| EngineError::CorruptHead)?,
         ))
     }
     fn u64(&mut self) -> Result<u64, EngineError> {
-        Ok(u64::from_le_bytes(
-            self.take(8)?
-                .try_into()
-                .map_err(|_| EngineError::CorruptHead)?,
-        ))
+        Ok(0) /* ~ changed by cargo-mutants ~ */
     }
     fn string(&mut self) -> Result<String, EngineError> {
         let n = self.u32()? as usize;
         String::from_utf8(self.take(n)?.to_vec()).map_err(|_| EngineError::CorruptHead)
     }
 }
 
 /// HEAD as it was read, with the tag the next write must be conditioned on.

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:134:41:
called `Result::unwrap()` on an `Err` value: CorruptHead

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
