*** crates/pstore-engine/src/head.rs:50:9: replace Head::encode -> Vec<u8> with vec![0]

*** mutation diff:
--- crates/pstore-engine/src/head.rs
+++ replace Head::encode -> Vec<u8> with vec![0]
@@ -42,34 +42,17 @@
     #[must_use]
     pub fn key(tenant: pstore_types::TenantId) -> Key {
         Key::new(format!("{:04x}/tnt/{}/HEAD", tenant.0 as u16, tenant.0))
     }
 
     /// Encodes HEAD.
     #[must_use]
     pub fn encode(&self) -> Vec<u8> {
-        let mut out = Vec::new();
-        out.extend_from_slice(&self.epoch.0.to_le_bytes());
-        out.extend_from_slice(&self.nonce.to_le_bytes());
-        out.extend_from_slice(&(self.indexes.len() as u32).to_le_bytes());
-        for (name, segs) in &self.indexes {
-            put_str(&mut out, name);
-            out.extend_from_slice(&(segs.len() as u32).to_le_bytes());
-            for s in segs {
-                put_str(&mut out, &s.key);
-                out.extend_from_slice(&s.rows.to_le_bytes());
-            }
-        }
-        out.extend_from_slice(&(self.watermarks.len() as u32).to_le_bytes());
-        for (lane, seq) in &self.watermarks {
-            out.extend_from_slice(&lane.to_le_bytes());
-            out.extend_from_slice(&seq.to_le_bytes());
-        }
-        out
+        vec![0] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Decodes HEAD, refusing anything malformed.
     pub fn decode(buf: &[u8]) -> Result<Self, EngineError> {
         let mut c = Cur { b: buf, i: 0 };
         let mut h = Self {
             epoch: Epoch(c.u64()?),
             nonce: c.u64()?,

---- the_whole_flow_stays_inside_its_request_budget stdout ----

thread 'the_whole_flow_stays_inside_its_request_budget' panicked at crates/pstore-engine/tests/end_to_end.rs:105:24:
called `Result::unwrap()` on an `Err` value: CorruptHead

---- write_read_filter_and_search_one_index stdout ----

thread 'write_read_filter_and_search_one_index' panicked at crates/pstore-engine/tests/end_to_end.rs:44:28:
called `Result::unwrap()` on an `Err` value: CorruptHead

failures:
    the_whole_flow_stays_inside_its_request_budget
    write_read_filter_and_search_one_index

test result: FAILED. 0 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
