*** crates/pstore-engine/src/head.rs:72:9: replace Head::decode -> Result<Self, EngineError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-engine/src/head.rs
+++ replace Head::decode -> Result<Self, EngineError> with Ok(Default::default())
@@ -64,39 +64,17 @@
             out.extend_from_slice(&lane.to_le_bytes());
             out.extend_from_slice(&seq.to_le_bytes());
         }
         out
     }
 
     /// Decodes HEAD, refusing anything malformed.
     pub fn decode(buf: &[u8]) -> Result<Self, EngineError> {
-        let mut c = Cur { b: buf, i: 0 };
-        let mut h = Self {
-            epoch: Epoch(c.u64()?),
-            nonce: c.u64()?,
-            ..Self::default()
-        };
-        for _ in 0..c.u32()? {
-            let name = c.string()?;
-            let n = c.u32()?;
-            let mut segs = Vec::with_capacity(n as usize);
-            for _ in 0..n {
-                segs.push(SegmentRef {
-                    key: c.string()?,
-                    rows: c.u32()?,
-                });
-            }
-            h.indexes.insert(name, segs);
-        }
-        for _ in 0..c.u32()? {
-            let lane = c.u64()?;
-            h.watermarks.insert(lane, c.u64()?);
-        }
-        Ok(h)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Whether this lane's sequence has already been folded into a committed epoch.
     #[must_use]
     pub fn is_folded(&self, lane: LaneId, seq: Seq) -> bool {
         self.watermarks.get(&lane.0).is_some_and(|w| *w > seq.0)
     }
 }

---- write_read_filter_and_search_one_index stdout ----

thread 'write_read_filter_and_search_one_index' panicked at crates/pstore-engine/tests/end_to_end.rs:51:5:
assertion `left == right` failed
  left: 300
 right: 900

failures:
    write_read_filter_and_search_one_index

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
