*** crates/pstore-engine/src/head.rs:94:13: delete field nonce from struct Self expression in Head::decode

*** mutation diff:
--- crates/pstore-engine/src/head.rs
+++ delete field nonce from struct Self expression in Head::decode
@@ -86,17 +86,17 @@
         out
     }
 
     /// Decodes HEAD, refusing anything malformed.
     pub fn decode(buf: &[u8]) -> Result<Self, EngineError> {
         let mut c = Cur { b: buf, i: 0 };
         let mut h = Self {
             epoch: Epoch(c.u64()?),
-            nonce: c.u64()?,
+             /* ~ changed by cargo-mutants ~ */
             ..Self::default()
         };
         for _ in 0..c.u32()? {
             let name = c.string()?;
             let n = c.u32()?;
             let mut segs = Vec::with_capacity(n as usize);
             for _ in 0..n {
                 segs.push(SegmentRef {

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:134:41:
called `Result::unwrap()` on an `Err` value: CorruptHead

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
