*** crates/pstore-engine/src/lanes.rs:101:5: replace live -> Result<Vec<LaneId>, EngineError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace live -> Result<Vec<LaneId>, EngineError> with Ok(vec![])
@@ -93,21 +93,17 @@
             Err(CasError::Io(e)) => return Err(EngineError::Blob(e)),
         }
     }
     Err(EngineError::Lost)
 }
 
 /// Every lane a writer has ever registered for this tenant. **One read, no LIST.**
 pub async fn live<S: BlobStore>(store: &S, tenant: TenantId) -> Result<Vec<LaneId>, EngineError> {
-    match store.get(&key(tenant)).await {
-        Ok(bytes) => Ok(decode(&bytes)?.into_iter().collect()),
-        Err(pstore_blob::BlobError::NotFound(_)) => Ok(Vec::new()),
-        Err(e) => Err(e.into()),
-    }
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// How far a lane has been written, discovered by **probing forward** from `from`.
 ///
 /// Returns the first sequence number that does not exist, which is the count of bundles
 /// written. Probes in each window go out together, so cost is reads rather than round
 /// trips, and a 404 is a normal answer — it is what bounds the lane.
 pub async fn tail<S: BlobStore>(

---- a_bundle_with_a_mangled_footer_fails_the_fold stdout ----

thread 'a_bundle_with_a_mangled_footer_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:85:5:
assertion failed: e.fold().await.is_err()

---- a_bundle_with_an_impossible_index_offset_fails_the_fold stdout ----

thread 'a_bundle_with_an_impossible_index_offset_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:103:5:
an offset past the object must not be trusted

failures:
    a_bundle_with_a_mangled_footer_fails_the_fold
    a_bundle_with_an_impossible_index_offset_fails_the_fold

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
