*** crates/pstore-engine/src/lanes.rs:113:5: replace tail -> Result<u64, EngineError> with Ok(1)

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace tail -> Result<u64, EngineError> with Ok(1)
@@ -105,35 +105,10 @@
 /// written. Probes in each window go out together, so cost is reads rather than round
 /// trips, and a 404 is a normal answer — it is what bounds the lane.
 pub async fn tail<S: BlobStore>(
     store: &S,
     tenant: TenantId,
     lane: LaneId,
     from: u64,
 ) -> Result<u64, EngineError> {
-    let mut base = from;
-    let mut window = FIRST_PROBE_WINDOW;
-    loop {
-        let keys: Vec<Key> = (base..base + window)
-            .map(|n| crate::bundle_key(tenant, lane, pstore_types::Seq(n)))
-            .collect();
-        // All at once: the window is width, not depth.
-        let present = futures_util::future::join_all(keys.iter().map(|k| store.head(k))).await;
-        let mut found = 0u64;
-        for r in present {
-            match r {
-                Ok(_) => found += 1,
-                // ⚠️ Stops at the FIRST gap rather than counting what exists. A lane is
-                // dense by construction, so a hole means the object is missing rather than
-                // never written — and skipping past it would silently drop everything
-                // before the next present key.
-                Err(pstore_blob::BlobError::NotFound(_)) => break,
-                Err(e) => return Err(e.into()),
-            }
-        }
-        base += found;
-        if found < window {
-            return Ok(base);
-        }
-        window = (window * 2).min(MAX_PROBE_WINDOW);
-    }
+    Ok(1) /* ~ changed by cargo-mutants ~ */
 }

*** result: Timeout
