*** crates/pstore-engine/src/lanes.rs:128:42: replace + with * in tail

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace + with * in tail
@@ -120,17 +120,17 @@
     let mut window = FIRST_PROBE_WINDOW;
     // ⚠️ Bounded, not `loop`. The termination condition is "the store answered 404", which
     // means a store that never does — hostile, buggy, or serving a lane genuinely longer
     // than any tenant could write — spins here forever, on a path a query waits on. An
     // unbounded loop whose exit depends on a remote answer is a liveness bug however
     // correct the logic is; mutation testing surfaced it as a hung test rather than a
     // failing one, which is the expensive way to find out.
     for _ in 0..MAX_PROBE_ROUNDS {
-        let keys: Vec<Key> = (base..base + window)
+        let keys: Vec<Key> = (base..base * /* ~ changed by cargo-mutants ~ */ window)
             .map(|n| crate::bundle_key(tenant, lane, pstore_types::Seq(n)))
             .collect();
         // All at once: the window is width, not depth.
         let present = futures_util::future::join_all(keys.iter().map(|k| store.head(k))).await;
         let mut found = 0u64;
         for r in present {
             match r {
                 Ok(_) => found += 1,

---- a_bundle_with_a_mangled_footer_fails_the_fold stdout ----

thread 'a_bundle_with_a_mangled_footer_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:85:5:
assertion failed: e.fold().await.is_err()

---- a_bundle_with_an_impossible_index_offset_fails_the_fold stdout ----

thread 'a_bundle_with_an_impossible_index_offset_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:103:5:
an offset past the object must not be trusted

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:127:5:
assertion `left == right` failed: the tail is the hole
  left: 0
 right: 1

failures:
    a_bundle_with_a_mangled_footer_fails_the_fold
    a_bundle_with_an_impossible_index_offset_fails_the_fold
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 4 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
