*** crates/pstore-engine/src/lanes.rs:134:18: replace < with > in tail

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace < with > in tail
@@ -126,14 +126,14 @@
                 // dense by construction, so a hole means the object is missing rather than
                 // never written — and skipping past it would silently drop everything
                 // before the next present key.
                 Err(pstore_blob::BlobError::NotFound(_)) => break,
                 Err(e) => return Err(e.into()),
             }
         }
         base += found;
-        if found < window {
+        if found > /* ~ changed by cargo-mutants ~ */ window {
             return Ok(base);
         }
         window = (window * 2).min(MAX_PROBE_WINDOW);
     }
 }

*** result: Timeout
