*** crates/pstore-engine/src/lanes.rs:137:26: replace * with + in tail

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace * with + in tail
@@ -129,11 +129,11 @@
                 Err(pstore_blob::BlobError::NotFound(_)) => break,
                 Err(e) => return Err(e.into()),
             }
         }
         base += found;
         if found < window {
             return Ok(base);
         }
-        window = (window * 2).min(MAX_PROBE_WINDOW);
+        window = (window + /* ~ changed by cargo-mutants ~ */ 2).min(MAX_PROBE_WINDOW);
     }
 }

---- a_probe_window_grows_so_a_long_lane_costs_few_round_trips stdout ----

thread 'a_probe_window_grows_so_a_long_lane_costs_few_round_trips' panicked at crates/pstore-engine/tests/lanes.rs:160:5:
500 bundles took 20 rounds to find

failures:
    a_probe_window_grows_so_a_long_lane_costs_few_round_trips

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
