*** crates/pstore-engine/src/lanes.rs:145:14: replace += with -= in tail

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace += with -= in tail
@@ -137,16 +137,16 @@
                 // ⚠️ Stops at the FIRST gap rather than counting what exists. A lane is
                 // dense by construction, so a hole means the object is missing rather than
                 // never written — and skipping past it would silently drop everything
                 // before the next present key.
                 Err(pstore_blob::BlobError::NotFound(_)) => break,
                 Err(e) => return Err(e.into()),
             }
         }
-        base += found;
+        base -= /* ~ changed by cargo-mutants ~ */ found;
         if found < window {
             return Ok(base);
         }
         window = (window * 2).min(MAX_PROBE_WINDOW);
     }
     Err(EngineError::LaneTooLong(lane))
 }

---- a_bundle_with_a_mangled_footer_fails_the_fold stdout ----

thread 'a_bundle_with_a_mangled_footer_fails_the_fold' panicked at /tmp/cargo-mutants-pstore-ayi9Ve.tmp/crates/pstore-engine/src/lanes.rs:145:9:
attempt to subtract with overflow

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at /tmp/cargo-mutants-pstore-ayi9Ve.tmp/crates/pstore-engine/src/lanes.rs:145:9:
attempt to subtract with overflow

---- a_bundle_with_an_impossible_index_offset_fails_the_fold stdout ----

thread 'a_bundle_with_an_impossible_index_offset_fails_the_fold' panicked at /tmp/cargo-mutants-pstore-ayi9Ve.tmp/crates/pstore-engine/src/lanes.rs:145:9:
attempt to subtract with overflow

failures:
    a_bundle_with_a_mangled_footer_fails_the_fold
    a_bundle_with_an_impossible_index_offset_fails_the_fold
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 4 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
