*** crates/pstore-engine/src/lanes.rs:45:50: replace / with * in decode

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace / with * in decode
@@ -37,17 +37,17 @@
 const MAX_LANES: usize = 4096;
 
 /// The registry's key, derived from the tenant like every other key here.
 pub fn key(tenant: TenantId) -> Key {
     Key::new(format!("{:04x}/tnt/{}/lanes", tenant.0 as u16, tenant.0))
 }
 
 fn decode(buf: &[u8]) -> Result<BTreeSet<LaneId>, EngineError> {
-    if !buf.len().is_multiple_of(8) || buf.len() / 8 > MAX_LANES {
+    if !buf.len().is_multiple_of(8) || buf.len() * /* ~ changed by cargo-mutants ~ */ 8 > MAX_LANES {
         return Err(EngineError::CorruptHead);
     }
     Ok(buf
         .chunks_exact(8)
         .filter_map(|c| c.try_into().ok())
         .map(|b| LaneId(u64::from_le_bytes(b)))
         .collect())
 }

---- one_hundred_writers_produce_a_dense_epoch_sequence stdout ----

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/linearizability.rs:55:28:
called `Result::unwrap()` on an `Err` value: CorruptHead

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/linearizability.rs:55:28:
called `Result::unwrap()` on an `Err` value: CorruptHead

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/linearizability.rs:54:29:
called `Result::unwrap()` on an `Err` value: CorruptHead

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/linearizability.rs:54:29:
called `Result::unwrap()` on an `Err` value: CorruptHead

---- every_acknowledged_document_survives_contention stdout ----

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/linearizability.rs:97:32:
called `Result::unwrap()` on an `Err` value: CorruptHead

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/linearizability.rs:97:32:
called `Result::unwrap()` on an `Err` value: CorruptHead

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/linearizability.rs:97:32:
called `Result::unwrap()` on an `Err` value: CorruptHead

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/linearizability.rs:96:33:
called `Result::unwrap()` on an `Err` value: CorruptHead

---- a_writer_paused_past_many_commits_cannot_corrupt stdout ----

thread 'a_writer_paused_past_many_commits_cannot_corrupt' panicked at crates/pstore-engine/tests/linearizability.rs:149:24:
called `Result::unwrap()` on an `Err` value: CorruptHead

failures:
    a_cas_storm_still_converges
    a_writer_paused_past_many_commits_cannot_corrupt
    every_acknowledged_document_survives_contention
    one_hundred_writers_produce_a_dense_epoch_sequence

test result: FAILED. 0 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.12s

*** result: Failure(101)
