*** crates/pstore-engine/src/lanes.rs:45:54: replace > with == in decode

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace > with == in decode
@@ -37,17 +37,17 @@
 const MAX_LANES: usize = 4096;
 
 /// The registry's key, derived from the tenant like every other key here.
 pub fn key(tenant: TenantId) -> Key {
     Key::new(format!("{:04x}/tnt/{}/lanes", tenant.0 as u16, tenant.0))
 }
 
 fn decode(buf: &[u8]) -> Result<BTreeSet<LaneId>, EngineError> {
-    if !buf.len().is_multiple_of(8) || buf.len() / 8 > MAX_LANES {
+    if !buf.len().is_multiple_of(8) || buf.len() / 8 == /* ~ changed by cargo-mutants ~ */ MAX_LANES {
         return Err(EngineError::CorruptHead);
     }
     Ok(buf
         .chunks_exact(8)
         .filter_map(|c| c.try_into().ok())
         .map(|b| LaneId(u64::from_le_bytes(b)))
         .collect())
 }

*** result: Success
