*** crates/pstore-engine/src/lanes.rs:45:8: delete ! in decode

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ delete ! in decode
@@ -37,17 +37,17 @@
 const MAX_LANES: usize = 4096;
 
 /// The registry's key, derived from the tenant like every other key here.
 pub fn key(tenant: TenantId) -> Key {
     Key::new(format!("{:04x}/tnt/{}/lanes", tenant.0 as u16, tenant.0))
 }
 
 fn decode(buf: &[u8]) -> Result<BTreeSet<LaneId>, EngineError> {
-    if !buf.len().is_multiple_of(8) || buf.len() / 8 > MAX_LANES {
+    if  /* ~ changed by cargo-mutants ~ */buf.len().is_multiple_of(8) || buf.len() / 8 > MAX_LANES {
         return Err(EngineError::CorruptHead);
     }
     Ok(buf
         .chunks_exact(8)
         .filter_map(|c| c.try_into().ok())
         .map(|b| LaneId(u64::from_le_bytes(b)))
         .collect())
 }

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:133:20:
called `Result::unwrap()` on an `Err` value: CorruptHead

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
