*** crates/pstore-engine/src/lanes.rs:51:37: replace || with && in decode

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace || with && in decode
@@ -43,17 +43,17 @@
 const MAX_PROBE_ROUNDS: u32 = 64;
 
 /// The registry's key, derived from the tenant like every other key here.
 pub fn key(tenant: TenantId) -> Key {
     Key::new(format!("{:04x}/tnt/{}/lanes", tenant.0 as u16, tenant.0))
 }
 
 fn decode(buf: &[u8]) -> Result<BTreeSet<LaneId>, EngineError> {
-    if !buf.len().is_multiple_of(8) || buf.len() / 8 > MAX_LANES {
+    if !buf.len().is_multiple_of(8) && /* ~ changed by cargo-mutants ~ */ buf.len() / 8 > MAX_LANES {
         return Err(EngineError::CorruptHead);
     }
     Ok(buf
         .chunks_exact(8)
         .filter_map(|c| c.try_into().ok())
         .map(|b| LaneId(u64::from_le_bytes(b)))
         .collect())
 }

---- a_corrupt_lane_registry_is_refused_not_guessed stdout ----

thread 'a_corrupt_lane_registry_is_refused_not_guessed' panicked at crates/pstore-engine/tests/failures.rs:72:5:
assertion failed: lanes::live(&*store, t).await.is_err()

failures:
    a_corrupt_lane_registry_is_refused_not_guessed

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
