*** crates/pstore-engine/src/lanes.rs:56:5: replace encode -> Vec<u8> with vec![0]

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace encode -> Vec<u8> with vec![0]
@@ -48,17 +48,17 @@
     Ok(buf
         .chunks_exact(8)
         .filter_map(|c| c.try_into().ok())
         .map(|b| LaneId(u64::from_le_bytes(b)))
         .collect())
 }
 
 fn encode(set: &BTreeSet<LaneId>) -> Vec<u8> {
-    set.iter().flat_map(|l| l.0.to_le_bytes()).collect()
+    vec![0] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Records that `lane` exists, if it is not already recorded.
 ///
 /// **One CAS per lane lifetime, not per write.** A CAS per write would put the commit
 /// protocol's contention ceiling back on the write path, which is precisely what lanes
 /// exist to avoid.
 pub async fn register<S: BlobStore>(

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:133:20:
called `Result::unwrap()` on an `Err` value: CorruptHead

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
