*** crates/pstore-engine/src/lanes.rs:62:5: replace encode -> Vec<u8> with vec![]

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace encode -> Vec<u8> with vec![]
@@ -54,17 +54,17 @@
     Ok(buf
         .chunks_exact(8)
         .filter_map(|c| c.try_into().ok())
         .map(|b| LaneId(u64::from_le_bytes(b)))
         .collect())
 }
 
 fn encode(set: &BTreeSet<LaneId>) -> Vec<u8> {
-    set.iter().flat_map(|l| l.0.to_le_bytes()).collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Records that `lane` exists, if it is not already recorded.
 ///
 /// **One CAS per lane lifetime, not per write.** A CAS per write would put the commit
 /// protocol's contention ceiling back on the write path, which is precisely what lanes
 /// exist to avoid.
 pub async fn register<S: BlobStore>(

---- a_bundle_with_a_mangled_footer_fails_the_fold stdout ----

thread 'a_bundle_with_a_mangled_footer_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:85:5:
assertion failed: e.fold().await.is_err()

---- a_bundle_with_an_impossible_index_offset_fails_the_fold stdout ----

thread 'a_bundle_with_an_impossible_index_offset_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:103:5:
an offset past the object must not be trusted

failures:
    a_bundle_with_a_mangled_footer_fails_the_fold
    a_bundle_with_an_impossible_index_offset_fails_the_fold

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
