*** crates/pstore-engine/src/lanes.rs:69:5: replace register -> Result<(), EngineError> with Ok(())

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace register -> Result<(), EngineError> with Ok(())
@@ -61,38 +61,17 @@
 /// **One CAS per lane lifetime, not per write.** A CAS per write would put the commit
 /// protocol's contention ceiling back on the write path, which is precisely what lanes
 /// exist to avoid.
 pub async fn register<S: BlobStore>(
     store: &S,
     tenant: TenantId,
     lane: LaneId,
 ) -> Result<(), EngineError> {
-    let k = key(tenant);
-    for _ in 0..16 {
-        let (current, pre) = match store.get_with_tag(&k).await {
-            Ok((bytes, tag)) => (decode(&bytes)?, Precondition::Match(tag)),
-            Err(pstore_blob::BlobError::NotFound(_)) => (BTreeSet::new(), Precondition::NotExists),
-            Err(e) => return Err(e.into()),
-        };
-        if current.contains(&lane) {
-            return Ok(());
-        }
-        let mut next = current;
-        next.insert(lane);
-        match store.put_conditional(&k, encode(&next).into(), pre).await {
-            Ok(_) => return Ok(()),
-            // A concurrent registration won. Rebase and re-add: overwriting would drop the
-            // lane the winner just recorded, and that lane's writes would become
-            // unrecoverable without anyone noticing.
-            Err(CasError::Lost | CasError::Contended) => {}
-            Err(CasError::Io(e)) => return Err(EngineError::Blob(e)),
-        }
-    }
-    Err(EngineError::Lost)
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Every lane a writer has ever registered for this tenant. **One read, no LIST.**
 pub async fn live<S: BlobStore>(store: &S, tenant: TenantId) -> Result<Vec<LaneId>, EngineError> {
     match store.get(&key(tenant)).await {
         Ok(bytes) => Ok(decode(&bytes)?.into_iter().collect()),
         Err(pstore_blob::BlobError::NotFound(_)) => Ok(Vec::new()),
         Err(e) => Err(e.into()),

---- a_bundle_with_a_mangled_footer_fails_the_fold stdout ----

thread 'a_bundle_with_a_mangled_footer_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:85:5:
assertion failed: e.fold().await.is_err()

---- a_bundle_with_an_impossible_index_offset_fails_the_fold stdout ----

thread 'a_bundle_with_an_impossible_index_offset_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:103:5:
an offset past the object must not be trusted

failures:
    a_bundle_with_a_mangled_footer_fails_the_fold
    a_bundle_with_an_impossible_index_offset_fails_the_fold

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
