*** crates/pstore-engine/src/lib.rs:114:31: replace + with - in backoff

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace + with - in backoff
@@ -106,17 +106,17 @@
 ///
 /// ⚠️ Jittered, and that is not decoration. Without it optimistic concurrency
 /// **livelocks**: every loser retries immediately, collides with the same peers, and
 /// loses again. It surfaced as a *flaky* test rather than a failing one, which is the
 /// more expensive way to find out. The jitter comes from the lane rather than a random
 /// source so a failing schedule still replays.
 async fn backoff(lane: LaneId, attempt: u32) {
     let base = 1u64 << attempt.min(6);
-    let jitter = (lane.0 % 8) + 1;
+    let jitter = (lane.0 % 8) - /* ~ changed by cargo-mutants ~ */ 1;
     tokio::time::sleep(std::time::Duration::from_micros(base * jitter)).await;
 }
 
 impl<S: BlobStore> Engine<S> {
     /// A writer on one lane of one tenant.
     pub fn new(store: Arc<S>, tenant: TenantId, lane: LaneId) -> Self {
         Self {
             store,

---- a_losing_compactors_output_is_unreferenced stdout ----

thread 'tokio-rt-worker' panicked at /tmp/cargo-mutants-pstore-zLaeUx.tmp/crates/pstore-engine/src/lib.rs:114:18:
attempt to subtract with overflow

thread 'a_losing_compactors_output_is_unreferenced' panicked at crates/pstore-engine/tests/compaction.rs:187:28:
called `Result::unwrap()` on an `Err` value: JoinError::Panic(Id(14), "attempt to subtract with overflow", ...)

---- concurrent_compactors_produce_one_winner stdout ----

thread 'tokio-rt-worker' panicked at /tmp/cargo-mutants-pstore-zLaeUx.tmp/crates/pstore-engine/src/lib.rs:114:18:
attempt to subtract with overflow

thread 'tokio-rt-worker' panicked at /tmp/cargo-mutants-pstore-zLaeUx.tmp/crates/pstore-engine/src/lib.rs:114:18:
attempt to subtract with overflow

thread 'concurrent_compactors_produce_one_winner' panicked at crates/pstore-engine/tests/compaction.rs:145:23:
called `Result::unwrap()` on an `Err` value: JoinError::Panic(Id(27), "attempt to subtract with overflow", ...)

failures:
    a_losing_compactors_output_is_unreferenced
    concurrent_compactors_produce_one_winner

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
