*** crates/pstore-engine/src/lib.rs:125:49: replace ^ with | in nonce_for

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace ^ with | in nonce_for
@@ -117,17 +117,17 @@
 /// two commits byte-different even when everything else about them matches.
 ///
 /// XOR, not OR or AND: both of those lose information, so distinct `(epoch, lane)` pairs
 /// collapse onto the same nonce and the guard silently stops guarding. Mutation testing
 /// found `|` and `&` indistinguishable from `^` to every test in the workspace, which is
 /// why `nonces_never_collide_across_epochs_and_lanes` exists.
 #[must_use]
 pub fn nonce_for(epoch: Epoch, lane: LaneId) -> u64 {
-    epoch.0.wrapping_mul(0x9E37_79B9_7F4A_7C15) ^ lane.0
+    epoch.0.wrapping_mul(0x9E37_79B9_7F4A_7C15) | /* ~ changed by cargo-mutants ~ */ lane.0
 }
 
 /// How long a writer waits before retrying a lost commit.
 ///
 /// ⚠️ Jittered, and that is not decoration. Without it optimistic concurrency
 /// **livelocks**: every loser retries immediately, collides with the same peers, and
 /// loses again. It surfaced as a *flaky* test rather than a failing one, which is the
 /// more expensive way to find out. The jitter comes from the lane rather than a random

---- nonces_never_collide_across_epochs_and_lanes stdout ----

thread 'nonces_never_collide_across_epochs_and_lanes' panicked at crates/pstore-engine/tests/arithmetic.rs:87:17:
nonce 0x9e3779b97f4a7c15 produced by both (1, 0) and (1, 1)

failures:
    nonces_never_collide_across_epochs_and_lanes

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
