*** crates/pstore-engine/src/lib.rs:130:9: replace Engine<S>::write -> Result<(), EngineError> with Ok(())

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace Engine<S>::write -> Result<(), EngineError> with Ok(())
@@ -122,22 +122,17 @@
         Key::new(format!(
             "{:04x}/tnt/{}/idx/{index}/seg/L0/{:020}-{:016x}.seg",
             self.tenant.0 as u16, self.tenant.0, epoch.0, self.lane.0
         ))
     }
 
     /// Buffers documents. **Visible immediately**; durable at the next [`Self::flush`].
     pub async fn write(&self, index: &str, docs: Vec<Document>) -> Result<(), EngineError> {
-        self.mem()
-            .pending
-            .entry(index.to_owned())
-            .or_default()
-            .extend(docs);
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Writes everything buffered as **one bundle object**, whatever it covers.
     ///
     /// `RA = 1 W` for the batch, and for every index in it.
     pub async fn flush(&self) -> Result<Option<Seq>, EngineError> {
         let pending = {
             let mut m = self.mem();

---- a_bundle_with_a_mangled_footer_fails_the_fold stdout ----

thread 'a_bundle_with_a_mangled_footer_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:77:40:
called `Option::unwrap()` on a `None` value

---- a_bundle_with_an_impossible_index_offset_fails_the_fold stdout ----

thread 'a_bundle_with_an_impossible_index_offset_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:94:40:
called `Option::unwrap()` on a `None` value

failures:
    a_bundle_with_a_mangled_footer_fails_the_fold
    a_bundle_with_an_impossible_index_offset_fails_the_fold

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
