*** crates/pstore-engine/src/lib.rs:142:43: replace + with - in backoff_delay

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace + with - in backoff_delay
@@ -134,17 +134,17 @@
 /// that can be stated and checked; a sleep does not.
 #[must_use]
 pub fn backoff_delay(lane: LaneId, attempt: u32) -> std::time::Duration {
     // Doubling, capped: the cap stops a late retry waiting far longer than the operation
     // it is retrying.
     let base = 1u64 << attempt.min(BACKOFF_CAP_SHIFT);
     // 1..=8, never 0: a jitter that can be zero leaves the lanes that draw it colliding
     // in lockstep, which is the livelock this exists to prevent.
-    let jitter = (lane.0 % JITTER_SPREAD) + 1;
+    let jitter = (lane.0 % JITTER_SPREAD) - /* ~ changed by cargo-mutants ~ */ 1;
     std::time::Duration::from_micros(base * jitter)
 }
 
 /// Where the doubling stops.
 const BACKOFF_CAP_SHIFT: u32 = 6;
 /// How many distinct delays a given attempt can produce.
 const JITTER_SPREAD: u64 = 8;

---- lanes_do_not_back_off_in_lockstep stdout ----

thread 'lanes_do_not_back_off_in_lockstep' panicked at crates/pstore-engine/src/lib.rs:142:18:
attempt to subtract with overflow

---- backoff_grows_with_the_attempt stdout ----

thread 'backoff_grows_with_the_attempt' panicked at crates/pstore-engine/src/lib.rs:142:18:
attempt to subtract with overflow

---- backoff_is_capped stdout ----

thread 'backoff_is_capped' panicked at crates/pstore-engine/src/lib.rs:142:18:
attempt to subtract with overflow

failures:
    backoff_grows_with_the_attempt
    backoff_is_capped
    lanes_do_not_back_off_in_lockstep

test result: FAILED. 2 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
