*** crates/pstore-engine/src/lib.rs:142:9: replace Engine<S>::flush -> Result<Option<Seq>, EngineError> with Ok(Some(Default::default()))

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace Engine<S>::flush -> Result<Option<Seq>, EngineError> with Ok(Some(Default::default()))
@@ -134,43 +134,17 @@
             .extend(docs);
         Ok(())
     }
 
     /// Writes everything buffered as **one bundle object**, whatever it covers.
     ///
     /// `RA = 1 W` for the batch, and for every index in it.
     pub async fn flush(&self) -> Result<Option<Seq>, EngineError> {
-        let pending = {
-            let mut m = self.mem();
-            if m.pending.is_empty() {
-                return Ok(None);
-            }
-            std::mem::take(&mut m.pending)
-        };
-        let seq = {
-            let mut s = self
-                .seq
-                .lock()
-                .unwrap_or_else(std::sync::PoisonError::into_inner);
-            let cur = *s;
-            *s = s.next();
-            cur
-        };
-        // The one PUT.
-        self.store
-            .put(&self.lane_key(seq), bundle::encode(&pending).into())
-            .await?;
-        // Only now does it move from pending to durable: a write that failed to land must
-        // not be reported as durable, and must stay visible so it is not lost.
-        let mut m = self.mem();
-        for (idx, docs) in pending {
-            m.durable.entry(idx).or_default().extend(docs);
-        }
-        Ok(Some(seq))
+        Ok(Some(Default::default())) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Replays this lane's unfolded WAL bundles into segments and commits them.
     ///
     /// ⚠️ **Reads the bundles from the blob store, not from memory.** Folding the
     /// in-memory copy would make the WAL write-only: the objects would be paid for and
     /// never read, and a process that restarted could not recover a single acknowledged
     /// write. The memtable exists to make a write *visible*; the bundle is what makes it

---- a_bundle_with_an_impossible_index_offset_fails_the_fold stdout ----

thread 'a_bundle_with_an_impossible_index_offset_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:97:37:
called `Result::unwrap()` on an `Err` value: NotFound("0029/wal/41/0000000000000001/0000000000000000.bundle")

---- a_bundle_with_a_mangled_footer_fails_the_fold stdout ----

thread 'a_bundle_with_a_mangled_footer_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:80:34:
called `Result::unwrap()` on an `Err` value: NotFound("0028/wal/40/0000000000000001/0000000000000000.bundle")

---- folding_nothing_is_a_no_op_not_an_error stdout ----

thread 'folding_nothing_is_a_no_op_not_an_error' panicked at crates/pstore-engine/tests/bundle_errors.rs:128:5:
assertion failed: e.flush().await.unwrap().is_none()

failures:
    a_bundle_with_a_mangled_footer_fails_the_fold
    a_bundle_with_an_impossible_index_offset_fails_the_fold
    folding_nothing_is_a_no_op_not_an_error

test result: FAILED. 4 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
