*** crates/pstore-engine/src/lib.rs:143:43: replace * with + in backoff_delay

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace * with + in backoff_delay
@@ -135,17 +135,17 @@
 #[must_use]
 pub fn backoff_delay(lane: LaneId, attempt: u32) -> std::time::Duration {
     // Doubling, capped: the cap stops a late retry waiting far longer than the operation
     // it is retrying.
     let base = 1u64 << attempt.min(BACKOFF_CAP_SHIFT);
     // 1..=8, never 0: a jitter that can be zero leaves the lanes that draw it colliding
     // in lockstep, which is the livelock this exists to prevent.
     let jitter = (lane.0 % JITTER_SPREAD) + 1;
-    std::time::Duration::from_micros(base * jitter)
+    std::time::Duration::from_micros(base + /* ~ changed by cargo-mutants ~ */ jitter)
 }
 
 /// Where the doubling stops.
 const BACKOFF_CAP_SHIFT: u32 = 6;
 /// How many distinct delays a given attempt can produce.
 const JITTER_SPREAD: u64 = 8;
 
 async fn backoff(lane: LaneId, attempt: u32) {

---- backoff_grows_with_the_attempt stdout ----

thread 'backoff_grows_with_the_attempt' panicked at crates/pstore-engine/tests/arithmetic.rs:35:5:
assertion `left == right` failed
  left: 2µs
 right: 1µs

failures:
    backoff_grows_with_the_attempt

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
