*** crates/pstore-engine/src/lib.rs:178:9: replace Engine<S>::epoch -> Epoch with Default::default()

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace Engine<S>::epoch -> Epoch with Default::default()
@@ -170,20 +170,17 @@
         self.mem
             .lock()
             .unwrap_or_else(std::sync::PoisonError::into_inner)
     }
 
     /// The last epoch this engine committed.
     #[must_use]
     pub fn epoch(&self) -> Epoch {
-        *self
-            .committed
-            .lock()
-            .unwrap_or_else(std::sync::PoisonError::into_inner)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn lane_key(&self, seq: Seq) -> Key {
         bundle_key(self.tenant, self.lane, seq)
     }
 
     fn segment_key(&self, epoch: Epoch, index: &str) -> Key {
         Key::new(format!(

---- a_folded_write_is_still_visible_exactly_once stdout ----

thread 'a_folded_write_is_still_visible_exactly_once' panicked at crates/pstore-engine/tests/engine.rs:173:5:
a fold commits

failures:
    a_folded_write_is_still_visible_exactly_once

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
