*** crates/pstore-engine/src/lib.rs:182:9: replace Engine<S>::fold -> Result<Epoch, EngineError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace Engine<S>::fold -> Result<Epoch, EngineError> with Ok(Default::default())
@@ -174,107 +174,17 @@
     /// in-memory copy would make the WAL write-only: the objects would be paid for and
     /// never read, and a process that restarted could not recover a single acknowledged
     /// write. The memtable exists to make a write *visible*; the bundle is what makes it
     /// *durable*, and only one of those survives a crash.
     ///
     /// Retries a lost CAS by rebasing, which is the protocol: `Lost` means the world
     /// moved, so the attempt is rebuilt against the world that exists now.
     pub async fn fold(&self) -> Result<Epoch, EngineError> {
-        let flushed = *self
-            .seq
-            .lock()
-            .unwrap_or_else(std::sync::PoisonError::into_inner);
-
-        for attempt in 0..MAX_COMMIT_ATTEMPTS {
-            let at = head::read(&*self.store, self.tenant).await?;
-            let from = at.head.watermarks.get(&self.lane.0).copied().unwrap_or(0);
-            if from >= flushed.0 {
-                // Nothing of ours is unfolded. Another committer may have moved the epoch
-                // on, which is not our concern.
-                return Ok(at.head.epoch);
-            }
-
-            // Every unfolded bundle in this lane, fetched together: the sequence numbers
-            // are dense and derived, so there is nothing to discover and nothing to list.
-            let keys: Vec<Key> = (from..flushed.0).map(|n| self.lane_key(Seq(n))).collect();
-            let bodies =
-                futures_util::future::try_join_all(keys.iter().map(|k| self.store.get(k))).await?;
-
-            let mut by_index: BTreeMap<String, Vec<Document>> = BTreeMap::new();
-            for body in &bodies {
-                for (name, entry) in bundle::read_index(body)? {
-                    by_index
-                        .entry(name)
-                        .or_default()
-                        .extend(bundle::read_entry(body, &entry)?);
-                }
-            }
-            if by_index.is_empty() {
-                return Ok(at.head.epoch);
-            }
-
-            let mut next = at.head.clone();
-            next.epoch = next.epoch.next();
-            // The ABA guard: two HEADs differing only in content a content-derived tag is
-            // computed from would otherwise share a tag. Derived from the epoch and lane,
-            // so it is deterministic and needs no clock.
-            next.nonce = next.epoch.0.wrapping_mul(0x9E37_79B9_7F4A_7C15) ^ self.lane.0;
-
-            // One segment per index. Folding every index into one object would make each
-            // index's ref point at the whole thing, and a scan would return its
-            // neighbours' rows.
-            for (idx, docs) in &by_index {
-                let seg_key = self.segment_key(next.epoch, idx);
-                let mut w = SegmentWriter::new(ROWS_PER_BLOCK);
-                for d in docs {
-                    w.push(d.clone());
-                }
-                // Keyed by the epoch being attempted, so a retry rewrites the same bytes
-                // at the same key. A loser leaves an orphan that GC reaps, because no HEAD
-                // references it.
-                self.store.put(&seg_key, w.finish()).await?;
-                next.indexes
-                    .entry(idx.clone())
-                    .or_default()
-                    .push(SegmentRef {
-                        key: seg_key.as_str().to_owned(),
-                        rows: docs.len() as u32,
-                    });
-            }
-            next.watermarks.insert(self.lane.0, flushed.0);
-
-            match head::commit(&*self.store, self.tenant, &at, &next).await {
-                Ok(epoch) => {
-                    // Dropped only after the commit lands, so a lost race leaves the rows
-                    // visible from the memtable rather than briefly from nowhere.
-                    self.mem().durable.clear();
-                    *self
-                        .committed
-                        .lock()
-                        .unwrap_or_else(std::sync::PoisonError::into_inner) = epoch;
-                    return Ok(epoch);
-                }
-                Err(EngineError::Lost | EngineError::Contended)
-                    if attempt < MAX_COMMIT_ATTEMPTS - 1 =>
-                {
-                    // ⚠️ Backoff, and jittered. Without it, optimistic concurrency
-                    // LIVELOCKS: every loser retries immediately, collides with the same
-                    // peers, and loses again. It showed up here as a flaky test rather
-                    // than a failing one, which is the more expensive way to find out.
-                    // The jitter is derived from the lane so two writers never wake
-                    // together, and needs no clock or randomness to be reproducible.
-                    let base = 1u64 << attempt.min(6);
-                    let jitter = (self.lane.0 % 8) + 1;
-                    tokio::time::sleep(std::time::Duration::from_micros(base * jitter)).await;
-                }
-                Err(e) => return Err(e),
-            }
-        }
-        Err(EngineError::Lost)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Every row of an index a filter selects: committed segments plus everything not yet
     /// folded, each appearing **exactly once**.
     pub async fn scan(
         &self,
         index: &str,
         filter: Option<&Filter>,

---- a_bundle_with_an_impossible_index_offset_fails_the_fold stdout ----

thread 'a_bundle_with_an_impossible_index_offset_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:103:5:
an offset past the object must not be trusted

---- a_bundle_with_a_mangled_footer_fails_the_fold stdout ----

thread 'a_bundle_with_a_mangled_footer_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:85:5:
assertion failed: e.fold().await.is_err()

---- a_missing_bundle_fails_the_fold_rather_than_skipping_it stdout ----

thread 'a_missing_bundle_fails_the_fold_rather_than_skipping_it' panicked at crates/pstore-engine/tests/bundle_errors.rs:119:5:
assertion failed: e.fold().await.is_err()

failures:
    a_bundle_with_a_mangled_footer_fails_the_fold
    a_bundle_with_an_impossible_index_offset_fails_the_fold
    a_missing_bundle_fails_the_fold_rather_than_skipping_it

test result: FAILED. 4 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
