*** crates/pstore-engine/src/lib.rs:190:21: replace >= with < in Engine<S>::fold

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace >= with < in Engine<S>::fold
@@ -182,17 +182,17 @@
         let flushed = *self
             .seq
             .lock()
             .unwrap_or_else(std::sync::PoisonError::into_inner);
 
         for attempt in 0..MAX_COMMIT_ATTEMPTS {
             let at = head::read(&*self.store, self.tenant).await?;
             let from = at.head.watermarks.get(&self.lane.0).copied().unwrap_or(0);
-            if from >= flushed.0 {
+            if from < /* ~ changed by cargo-mutants ~ */ flushed.0 {
                 // Nothing of ours is unfolded. Another committer may have moved the epoch
                 // on, which is not our concern.
                 return Ok(at.head.epoch);
             }
 
             // Every unfolded bundle in this lane, fetched together: the sequence numbers
             // are dense and derived, so there is nothing to discover and nothing to list.
             let keys: Vec<Key> = (from..flushed.0).map(|n| self.lane_key(Seq(n))).collect();

---- a_missing_bundle_fails_the_fold_rather_than_skipping_it stdout ----

thread 'a_missing_bundle_fails_the_fold_rather_than_skipping_it' panicked at crates/pstore-engine/tests/bundle_errors.rs:119:5:
assertion failed: e.fold().await.is_err()

---- a_bundle_with_an_impossible_index_offset_fails_the_fold stdout ----

thread 'a_bundle_with_an_impossible_index_offset_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:103:5:
an offset past the object must not be trusted

---- a_bundle_with_a_mangled_footer_fails_the_fold stdout ----

thread 'a_bundle_with_a_mangled_footer_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:85:5:
assertion failed: e.fold().await.is_err()

failures:
    a_bundle_with_a_mangled_footer_fails_the_fold
    a_bundle_with_an_impossible_index_offset_fails_the_fold
    a_missing_bundle_fails_the_fold_rather_than_skipping_it

test result: FAILED. 4 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
