*** crates/pstore-engine/src/lib.rs:212:9: replace Engine<S>::pending_for_test -> Vec<String> with vec![String::new()]

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace Engine<S>::pending_for_test -> Vec<String> with vec![String::new()]
@@ -204,22 +204,17 @@
 
     /// The ids currently buffered and not yet acknowledged.
     ///
     /// Exposed so a recovery test can state precisely which rows a `flush` acknowledges.
     /// Guessing that from the outside would make the test's own bookkeeping the thing
     /// under test.
     #[doc(hidden)]
     pub async fn pending_for_test(&self) -> Vec<String> {
-        self.mem()
-            .pending
-            .values()
-            .flatten()
-            .map(|d| d.id.clone())
-            .collect()
+        vec![String::new()] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Writes everything buffered as **one bundle object**, whatever it covers.
     ///
     /// `RA = 1 W` for the batch, and for every index in it.
     pub async fn flush(&self) -> Result<Option<Seq>, EngineError> {
         let _lane = self.flushing.lock().await;
         let pending = {

---- a_refused_flush_does_not_punch_a_hole_in_the_lane stdout ----

thread 'a_refused_flush_does_not_punch_a_hole_in_the_lane' panicked at crates/pstore-engine/tests/oq91.rs:200:5:
assertion `left == right` failed
  left: [""]
 right: ["b"]

---- recovery_finds_every_unfolded_record_across_seeds stdout ----

thread 'recovery_finds_every_unfolded_record_across_seeds' panicked at crates/pstore-engine/tests/oq91.rs:158:9:
seed 0: 1 acknowledged rows were LOST (8 lanes, 5 deaths): [""]

failures:
    a_refused_flush_does_not_punch_a_hole_in_the_lane
    recovery_finds_every_unfolded_record_across_seeds

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
