*** crates/pstore-engine/src/lib.rs:355:9: replace Engine<S>::replay_for_test with ()

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace Engine<S>::replay_for_test with ()
@@ -347,20 +347,17 @@
     /// Sets how far this lane has been flushed, so a successor can replay a predecessor's
     /// bundles.
     ///
     /// ⚠️ A stand-in. In production a successor discovers the tail by forward-probing the
     /// lane and reading the per-shard lane bitmap — neither of which exists until M2 — so
     /// M1 injects the watermark rather than pretending discovery is solved.
     #[doc(hidden)]
     pub fn replay_for_test(&self, flushed: Seq) {
-        *self
-            .seq
-            .lock()
-            .unwrap_or_else(std::sync::PoisonError::into_inner) = flushed;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Attempts a commit against a **deliberately stale** view of HEAD.
     ///
     /// Exists so the fencing property can be asserted: a caller holding a superseded tag
     /// must be refused. Not part of the engine's real API.
     #[doc(hidden)]
     pub async fn commit_stale_for_test(&self) -> Result<Epoch, EngineError> {

---- a_missing_bundle_fails_the_fold_rather_than_skipping_it stdout ----

thread 'a_missing_bundle_fails_the_fold_rather_than_skipping_it' panicked at crates/pstore-engine/tests/bundle_errors.rs:119:5:
assertion failed: e.fold().await.is_err()

failures:
    a_missing_bundle_fails_the_fold_rather_than_skipping_it

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
