*** crates/pstore-engine/src/lib.rs:403:24: replace match guard attempt < MAX_COMMIT_ATTEMPTS - 1 with false in Engine<S>::fold

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace match guard attempt < MAX_COMMIT_ATTEMPTS - 1 with false in Engine<S>::fold
@@ -395,17 +395,17 @@
                     self.mem().durable.clear();
                     *self
                         .committed
                         .lock()
                         .unwrap_or_else(std::sync::PoisonError::into_inner) = epoch;
                     return Ok(epoch);
                 }
                 Err(EngineError::Lost | EngineError::Contended)
-                    if attempt < MAX_COMMIT_ATTEMPTS - 1 =>
+                    if false /* ~ changed by cargo-mutants ~ */ =>
                 {
                     backoff(self.lane, attempt).await;
                 }
                 Err(e) => return Err(e),
             }
         }
         Err(EngineError::Lost)
     }

---- concurrent_committers_lose_and_duplicate_nothing stdout ----

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/engine.rs:235:41:
called `Result::unwrap()` on an `Err` value: Lost

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/engine.rs:235:41:
called `Result::unwrap()` on an `Err` value: Lost

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/engine.rs:235:41:
called `Result::unwrap()` on an `Err` value: Lost

thread 'concurrent_committers_lose_and_duplicate_nothing' panicked at crates/pstore-engine/tests/engine.rs:242:31:
called `Result::unwrap()` on an `Err` value: JoinError::Panic(Id(6), "called `Result::unwrap()` on an `Err` value: Lost", ...)

failures:
    concurrent_committers_lose_and_duplicate_nothing

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
