*** crates/pstore-engine/src/lib.rs:403:54: replace - with + in Engine<S>::fold

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace - with + in Engine<S>::fold
@@ -395,17 +395,17 @@
                     self.mem().durable.clear();
                     *self
                         .committed
                         .lock()
                         .unwrap_or_else(std::sync::PoisonError::into_inner) = epoch;
                     return Ok(epoch);
                 }
                 Err(EngineError::Lost | EngineError::Contended)
-                    if attempt < MAX_COMMIT_ATTEMPTS - 1 =>
+                    if attempt < MAX_COMMIT_ATTEMPTS + /* ~ changed by cargo-mutants ~ */ 1 =>
                 {
                     backoff(self.lane, attempt).await;
                 }
                 Err(e) => return Err(e),
             }
         }
         Err(EngineError::Lost)
     }

*** result: Success
