*** crates/pstore-engine/src/lib.rs:438:32: replace < with <= in Engine<S>::gc

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace < with <= in Engine<S>::gc
@@ -430,17 +430,17 @@
             next.epoch = next.epoch.next();
             next.nonce = next.epoch.0.wrapping_mul(0x9E37_79B9_7F4A_7C15) ^ self.lane.0;
             for e in &due {
                 next.graveyard.remove(e);
             }
             match head::commit(&*self.store, self.tenant, &at, &next).await {
                 Ok(_) => return Ok(doomed.len()),
                 Err(EngineError::Lost | EngineError::Contended)
-                    if attempt < MAX_COMMIT_ATTEMPTS - 1 =>
+                    if attempt <= /* ~ changed by cargo-mutants ~ */ MAX_COMMIT_ATTEMPTS - 1 =>
                 {
                     backoff(self.lane, attempt).await;
                 }
                 Err(e) => return Err(e),
             }
         }
         Err(EngineError::Lost)
     }

*** result: Success
