*** crates/pstore-engine/src/lib.rs:461:29: delete ! in Engine<S>::gc

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ delete ! in Engine<S>::gc
@@ -453,17 +453,17 @@
                 .collect();
             let doomed: Vec<Key> = due
                 .iter()
                 .filter_map(|e| at.head.graveyard.get(e))
                 .flatten()
                 // ⚠️ Checked against what HEAD names *now*, not against what it named when
                 // the key was buried. Cheap, and the one thing standing between a bug
                 // anywhere in the commit path and deleting live data.
-                .filter(|k| !live.contains(k.as_str()))
+                .filter(|k|  /* ~ changed by cargo-mutants ~ */live.contains(k.as_str()))
                 .map(|k| Key::new(k.clone()))
                 .collect();
 
             // ⚠️ Deleted BEFORE the manifest is pruned, and the order is not arbitrary.
             // Pruning first and then failing to delete loses the only record that these
             // objects exist, and they leak with nothing left to find them by. Deleting
             // first and then failing to prune costs a repeated delete on the next pass,
             // which is idempotent.

---- gc_refuses_to_reap_a_key_head_still_names stdout ----

thread 'gc_refuses_to_reap_a_key_head_still_names' panicked at crates/pstore-engine/tests/gc.rs:214:9:
GC reaped 0006/tnt/6/idx/idx/seg/L0/00000000000000000001-0000000000000001.seg, which HEAD still names

---- a_dereferenced_object_survives_the_retention_window stdout ----

thread 'a_dereferenced_object_survives_the_retention_window' panicked at crates/pstore-engine/tests/gc.rs:136:5:
only 0 objects reaped past the window

---- gc_reaps_a_folded_bundle_once_it_is_beyond_the_window stdout ----

thread 'gc_reaps_a_folded_bundle_once_it_is_beyond_the_window' panicked at crates/pstore-engine/tests/gc.rs:86:5:
GC reaped nothing at all

failures:
    a_dereferenced_object_survives_the_retention_window
    gc_reaps_a_folded_bundle_once_it_is_beyond_the_window
    gc_refuses_to_reap_a_key_head_still_names

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
