*** crates/pstore-engine/src/lib.rs:475:54: replace - with / in Engine<S>::gc

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace - with / in Engine<S>::gc
@@ -467,17 +467,17 @@
             next.epoch = next.epoch.next();
             next.nonce = nonce_for(next.epoch, self.lane);
             for e in &due {
                 next.graveyard.remove(e);
             }
             match head::commit(&*self.store, self.tenant, &at, &next).await {
                 Ok(_) => return Ok(doomed.len()),
                 Err(EngineError::Lost | EngineError::Contended)
-                    if attempt < MAX_COMMIT_ATTEMPTS - 1 =>
+                    if attempt < MAX_COMMIT_ATTEMPTS / /* ~ changed by cargo-mutants ~ */ 1 =>
                 {
                     backoff(self.lane, attempt).await;
                 }
                 Err(e) => return Err(e),
             }
         }
         Err(EngineError::Lost)
     }

*** result: Success
