*** crates/pstore-engine/src/lib.rs:567:33: delete ! in Engine<S>::compact

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ delete ! in Engine<S>::compact
@@ -559,17 +559,17 @@
             next.epoch = next.epoch.next();
             next.nonce = next.epoch.0.wrapping_mul(0x9E37_79B9_7F4A_7C15) ^ self.lane.0;
             // Segments added since we read: kept, in place, after the merged one. Dropping
             // them would silently discard every row folded while we were merging.
             let mut kept: Vec<SegmentRef> = vec![out.clone()];
             kept.extend(
                 current
                     .iter()
-                    .filter(|c| !inputs.iter().any(|i| i.key == c.key))
+                    .filter(|c|  /* ~ changed by cargo-mutants ~ */inputs.iter().any(|i| i.key == c.key))
                     .cloned(),
             );
             next.indexes.insert(index.to_owned(), kept);
             // Same rule for the segments this merge replaced.
             next.graveyard
                 .entry(next.epoch.0)
                 .or_default()
                 .extend(inputs.iter().map(|i| i.key.clone()));

---- compaction_does_not_change_the_answer stdout ----

thread 'compaction_does_not_change_the_answer' panicked at crates/pstore-engine/tests/compaction.rs:77:5:
assertion `left == right` failed: the merge changed the answer
  left: ["d0", "d1", "d2", "d3", "d4", "d5", "d0", "d1", "d2", "d3", "d4", "d5"]
 right: ["d0", "d1", "d2", "d3", "d4", "d5"]

---- compaction_collapses_the_segments_it_merged stdout ----

thread 'compaction_collapses_the_segments_it_merged' panicked at crates/pstore-engine/tests/compaction.rs:91:5:
assertion `left == right` failed: six segments did not become one
  left: Some(7)
 right: Some(1)

---- a_fold_landing_mid_compaction_is_not_swallowed_by_it stdout ----

thread 'a_fold_landing_mid_compaction_is_not_swallowed_by_it' panicked at crates/pstore-engine/tests/compaction.rs:271:5:
the fold's rows were swallowed by the compaction: ["d0", "d1", "d2", "d3", "d4", "d5", "seeded", "d0", "d1", "d2", "d3", "d4", "d5", "seeded"]

failures:
    a_fold_landing_mid_compaction_is_not_swallowed_by_it
    compaction_collapses_the_segments_it_merged
    compaction_does_not_change_the_answer
    concurrent_compactors_produce_one_winner

test result: FAILED. 2 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
