*** crates/pstore-engine/src/lib.rs:588:16: delete ! in Engine<S>::compact

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ delete ! in Engine<S>::compact
@@ -580,17 +580,17 @@
 
         let mut at = at;
         for attempt in 0..MAX_COMMIT_ATTEMPTS {
             let current: Vec<SegmentRef> = at.head.indexes.get(index).cloned().unwrap_or_default();
             // ⚠️ The discard condition. If any input is no longer named by HEAD, another
             // compactor published this merge and ours is stale — republishing it would
             // resurrect rows that a later fold may already have superseded. Losing is the
             // normal outcome of optimistic work, so it is not an error.
-            if !inputs
+            if  /* ~ changed by cargo-mutants ~ */inputs
                 .iter()
                 .all(|i| current.iter().any(|c| c.key == i.key))
             {
                 return Ok(None);
             }
 
             let mut next = at.head.clone();
             next.epoch = next.epoch.next();

*** result: Timeout
