*** crates/pstore-engine/src/lib.rs:596:55: replace == with != in Engine<S>::compact

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace == with != in Engine<S>::compact
@@ -588,17 +588,17 @@
         for attempt in 0..MAX_COMMIT_ATTEMPTS {
             let current: Vec<SegmentRef> = at.head.indexes.get(index).cloned().unwrap_or_default();
             // ⚠️ The discard condition. If any input is no longer named by HEAD, another
             // compactor published this merge and ours is stale — republishing it would
             // resurrect rows that a later fold may already have superseded. Losing is the
             // normal outcome of optimistic work, so it is not an error.
             if !inputs
                 .iter()
-                .all(|i| current.iter().any(|c| c.key == i.key))
+                .all(|i| current.iter().any(|c| c.key != /* ~ changed by cargo-mutants ~ */ i.key))
             {
                 return Ok(None);
             }
 
             let mut next = at.head.clone();
             next.epoch = next.epoch.next();
             next.nonce = nonce_for(next.epoch, self.lane);
             // Segments added since we read: kept, in place, after the merged one. Dropping

---- a_losing_compactors_output_is_unreferenced stdout ----

thread 'a_losing_compactors_output_is_unreferenced' panicked at crates/pstore-engine/tests/compaction.rs:220:5:
assertion `left == right` failed: every compactor but the winner must leave its output unreferenced
  left: 0
 right: 5

---- concurrent_compactors_produce_one_winner stdout ----

thread 'concurrent_compactors_produce_one_winner' panicked at crates/pstore-engine/tests/compaction.rs:153:5:
assertion `left == right` failed: 12 compactors committed; exactly one may win and the rest must discard
  left: 12
 right: 1

failures:
    a_losing_compactors_output_is_unreferenced
    concurrent_compactors_produce_one_winner

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
