*** crates/pstore-engine/src/lib.rs:617:32: replace < with > in Engine<S>::compact

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace < with > in Engine<S>::compact
@@ -609,17 +609,17 @@
             next.graveyard
                 .entry(next.epoch.0)
                 .or_default()
                 .extend(inputs.iter().map(|i| i.key.clone()));
 
             match head::commit(&*self.store, self.tenant, &at, &next).await {
                 Ok(epoch) => return Ok(Some(epoch)),
                 Err(e @ (EngineError::Lost | EngineError::Contended))
-                    if attempt < MAX_COMMIT_ATTEMPTS - 1 =>
+                    if attempt > /* ~ changed by cargo-mutants ~ */ MAX_COMMIT_ATTEMPTS - 1 =>
                 {
                     if matches!(e, EngineError::Lost) {
                         at = head::read(&*self.store, self.tenant).await?;
                     }
                     backoff(self.lane, attempt).await;
                 }
                 Err(e) => return Err(e),
             }

---- a_fold_landing_mid_compaction_is_not_swallowed_by_it stdout ----

thread 'a_fold_landing_mid_compaction_is_not_swallowed_by_it' panicked at crates/pstore-engine/tests/compaction.rs:259:7:
called `Result::unwrap()` on an `Err` value: Lost

---- a_losing_compactors_output_is_unreferenced stdout ----

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/compaction.rs:183:18:
called `Result::unwrap()` on an `Err` value: Lost

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/compaction.rs:183:18:
called `Result::unwrap()` on an `Err` value: Lost

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/compaction.rs:183:18:
called `Result::unwrap()` on an `Err` value: Lost

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/compaction.rs:183:18:
called `Result::unwrap()` on an `Err` value: Lost

---- concurrent_compactors_produce_one_winner stdout ----

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/compaction.rs:140:18:
called `Result::unwrap()` on an `Err` value: Lost

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/compaction.rs:140:18:
called `Result::unwrap()` on an `Err` value: Lost

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/compaction.rs:140:18:
called `Result::unwrap()` on an `Err` value: Lost

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/compaction.rs:140:18:
called `Result::unwrap()` on an `Err` value: Lost

failures:
    a_fold_landing_mid_compaction_is_not_swallowed_by_it
    a_losing_compactors_output_is_unreferenced
    concurrent_compactors_produce_one_winner

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
