*** crates/pstore-engine/src/lib.rs:637:9: replace Engine<S>::scan -> Result<Vec<Document>, EngineError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace Engine<S>::scan -> Result<Vec<Document>, EngineError> with Ok(vec![])
@@ -629,53 +629,17 @@
 
     /// Every row of an index a filter selects: committed segments plus everything not yet
     /// folded, each appearing **exactly once**.
     pub async fn scan(
         &self,
         index: &str,
         filter: Option<&Filter>,
     ) -> Result<Vec<Document>, EngineError> {
-        let at = head::read(&*self.store, self.tenant).await?;
-        let keys: Vec<Key> = at
-            .head
-            .indexes
-            .get(index)
-            .into_iter()
-            .flatten()
-            .map(|r| Key::new(r.key.clone()))
-            .collect();
-
-        // ⚠️ Segments are opened TOGETHER, then scanned together. A loop over segment refs
-        // is functionally identical and turns a ten-segment index into a twenty-one-hop
-        // query -- measured, not guessed -- which is six times the whole latency budget.
-        // Width is free; depth is not.
-        let opened =
-            futures_util::future::try_join_all(keys.iter().map(|k| Segment::open(&*self.store, k)))
-                .await?;
-        let scanned = futures_util::future::try_join_all(
-            opened
-                .iter()
-                .zip(&keys)
-                .map(|(seg, k)| seg.scan(&*self.store, k, filter)),
-        )
-        .await?;
-        let mut out: Vec<Document> = scanned.into_iter().flatten().collect();
-        // Unfolded rows live only in memory. They are not in any segment, so there is
-        // nothing to deduplicate against -- the fold clears them in the same step that
-        // publishes the segment.
-        let m = self.mem();
-        for src in [&m.durable, &m.pending] {
-            for d in src.get(index).into_iter().flatten() {
-                if filter.is_none_or(|f| f.matches(d)) {
-                    out.push(d.clone());
-                }
-            }
-        }
-        Ok(out)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Exact k-nearest neighbours across everything the index contains.
     pub async fn search(
         &self,
         index: &str,
         query: &[f32],
         k: usize,

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:135:5:
rows before the hole must still be folded

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
