*** crates/pstore-engine/src/lib.rs:684:9: replace Engine<S>::search -> Result<Vec<(String, f32)>, EngineError> with Ok(vec![(String::new(), 1.0)])

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace Engine<S>::search -> Result<Vec<(String, f32)>, EngineError> with Ok(vec![(String::new(), 1.0)])
@@ -676,32 +676,17 @@
     /// Exact k-nearest neighbours across everything the index contains.
     pub async fn search(
         &self,
         index: &str,
         query: &[f32],
         k: usize,
         filter: Option<&Filter>,
     ) -> Result<Vec<(String, f32)>, EngineError> {
-        let docs = self.scan(index, filter).await?;
-        let mut scored: Vec<(String, f32)> = docs
-            .into_iter()
-            .map(|d| {
-                let dist = d
-                    .vector
-                    .iter()
-                    .zip(query)
-                    .map(|(a, b)| (a - b) * (a - b))
-                    .sum::<f32>();
-                (d.id, dist)
-            })
-            .collect();
-        scored.sort_by(|a, b| a.1.total_cmp(&b.1).then_with(|| a.0.cmp(&b.0)));
-        scored.truncate(k);
-        Ok(scored)
+        Ok(vec![(String::new(), 1.0)]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Attempts a commit against a **deliberately stale** view of HEAD.
     ///
     /// Exists so the fencing property can be asserted: a caller holding a superseded tag
     /// must be refused. Not part of the engine's real API.
     #[doc(hidden)]
     pub async fn commit_stale_for_test(&self) -> Result<Epoch, EngineError> {

---- write_read_filter_and_search_one_index stdout ----

thread 'write_read_filter_and_search_one_index' panicked at crates/pstore-engine/tests/end_to_end.rs:80:5:
assertion `left == right` failed: filtered search disagrees with brute force
  left: [""]
 right: ["sku-0350", "sku-0349", "sku-0351", "sku-0348", "sku-0352"]

failures:
    write_read_filter_and_search_one_index

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
