*** crates/pstore-engine/src/lib.rs:714:9: replace Engine<S>::commit_stale_for_test -> Result<Epoch, EngineError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace Engine<S>::commit_stale_for_test -> Result<Epoch, EngineError> with Ok(Default::default())
@@ -706,19 +706,11 @@
     }
 
     /// Attempts a commit against a **deliberately stale** view of HEAD.
     ///
     /// Exists so the fencing property can be asserted: a caller holding a superseded tag
     /// must be refused. Not part of the engine's real API.
     #[doc(hidden)]
     pub async fn commit_stale_for_test(&self) -> Result<Epoch, EngineError> {
-        let stale = HeadAt {
-            head: Head::default(),
-            tag: None,
-        };
-        let next = Head {
-            epoch: Epoch(1),
-            ..Head::default()
-        };
-        head::commit(&*self.store, self.tenant, &stale, &next).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }

---- a_stale_committer_is_fenced stdout ----

thread 'a_stale_committer_is_fenced' panicked at crates/pstore-engine/tests/engine.rs:211:5:
a stale tag must be fenced out

failures:
    a_stale_committer_is_fenced

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
