*** crates/pstore-engine/src/lib.rs:719:13: delete field epoch from struct Head expression in Engine<S>::commit_stale_for_test

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ delete field epoch from struct Head expression in Engine<S>::commit_stale_for_test
@@ -711,14 +711,14 @@
     /// must be refused. Not part of the engine's real API.
     #[doc(hidden)]
     pub async fn commit_stale_for_test(&self) -> Result<Epoch, EngineError> {
         let stale = HeadAt {
             head: Head::default(),
             tag: None,
         };
         let next = Head {
-            epoch: Epoch(1),
+             /* ~ changed by cargo-mutants ~ */
             ..Head::default()
         };
         head::commit(&*self.store, self.tenant, &stale, &next).await
     }
 }

*** result: Success
