*** crates/pstore-format/src/codec.rs:107:9: replace Dec<'a>::bytes -> Result<&'a[u8], FormatError> with Ok(Vec::leak(vec![1]))

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Dec<'a>::bytes -> Result<&'a[u8], FormatError> with Ok(Vec::leak(vec![1]))
@@ -99,18 +99,17 @@
     pub(crate) fn f32(&mut self) -> Result<f32, FormatError> {
         Ok(f32::from_le_bytes(
             self.take(4)?
                 .try_into()
                 .map_err(|_| FormatError::Truncated)?,
         ))
     }
     pub(crate) fn bytes(&mut self) -> Result<&'a [u8], FormatError> {
-        let n = self.u32()? as usize;
-        self.take(n)
+        Ok(Vec::leak(vec![1])) /* ~ changed by cargo-mutants ~ */
     }
     pub(crate) fn string(&mut self) -> Result<String, FormatError> {
         String::from_utf8(self.bytes()?.to_vec()).map_err(|_| FormatError::Corrupt("bad utf8"))
     }
     pub(crate) fn raw(&mut self, n: usize) -> Result<&'a [u8], FormatError> {
         self.take(n)
     }
 }

---- codec::tests::a_string_field_rejects_invalid_utf8 stdout ----

thread 'codec::tests::a_string_field_rejects_invalid_utf8' panicked at crates/pstore-format/src/codec.rs:182:37:
called `Result::unwrap_err()` on an `Ok` value: "\u{1}"

---- codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking stdout ----

thread 'codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking' panicked at crates/pstore-format/src/codec.rs:169:9:
assertion failed: Dec::new(&[1, 2, 3]).bytes().is_err()

---- codec::tests::every_primitive_round_trips stdout ----

thread 'codec::tests::every_primitive_round_trips' panicked at crates/pstore-format/src/codec.rs:155:9:
assertion `left == right` failed
  left: [1]
 right: [104, 101, 108, 108, 111]

failures:
    codec::tests::a_string_field_rejects_invalid_utf8
    codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking
    codec::tests::every_primitive_round_trips

test result: FAILED. 1 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
