*** crates/pstore-format/src/codec.rs:124:11: replace ^= with &= in checksum

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace ^= with &= in checksum
@@ -116,17 +116,17 @@
 }
 
 /// FNV-1a over the index section, so tampering is caught before it is served as data.
 ///
 /// Not cryptographic and not meant to be: it detects corruption, not an adversary.
 pub(crate) fn checksum(bytes: &[u8]) -> u64 {
     let mut h: u64 = 0xcbf2_9ce4_8422_2325;
     for b in bytes {
-        h ^= u64::from(*b);
+        h &= /* ~ changed by cargo-mutants ~ */ u64::from(*b);
         h = h.wrapping_mul(0x1000_0000_01b3);
     }
     h
 }
 
 #[cfg(test)]
 #[allow(
     clippy::unwrap_used,

---- a_tampered_index_section_is_caught_by_the_checksum stdout ----

thread 'a_tampered_index_section_is_caught_by_the_checksum' panicked at crates/pstore-format/tests/corrupt.rs:66:29:

failures:
    a_tampered_index_section_is_caught_by_the_checksum

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
