*** crates/pstore-format/src/codec.rs:28:9: replace Enc::i64 with ()

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Enc::i64 with ()
@@ -20,17 +20,17 @@
     }
     pub(crate) fn u32(&mut self, v: u32) {
         self.0.extend_from_slice(&v.to_le_bytes());
     }
     pub(crate) fn u64(&mut self, v: u64) {
         self.0.extend_from_slice(&v.to_le_bytes());
     }
     pub(crate) fn i64(&mut self, v: i64) {
-        self.0.extend_from_slice(&v.to_le_bytes());
+        () /* ~ changed by cargo-mutants ~ */
     }
     pub(crate) fn f32(&mut self, v: f32) {
         self.0.extend_from_slice(&v.to_le_bytes());
     }
     pub(crate) fn bytes(&mut self, v: &[u8]) {
         // Length-prefixed, so a decoder never has to guess where a field ends.
         self.u32(v.len() as u32);
         self.0.extend_from_slice(v);

---- codec::tests::every_primitive_round_trips stdout ----

thread 'codec::tests::every_primitive_round_trips' panicked at crates/pstore-format/src/codec.rs:154:9:
assertion `left == right` failed
  left: 22544384000
 right: -42

failures:
    codec::tests::every_primitive_round_trips

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
