*** crates/pstore-format/src/codec.rs:39:9: replace Enc::raw with ()

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Enc::raw with ()
@@ -31,17 +31,17 @@
         self.0.extend_from_slice(&v.to_le_bytes());
     }
     pub(crate) fn bytes(&mut self, v: &[u8]) {
         // Length-prefixed, so a decoder never has to guess where a field ends.
         self.u32(v.len() as u32);
         self.0.extend_from_slice(v);
     }
     pub(crate) fn raw(&mut self, v: &[u8]) {
-        self.0.extend_from_slice(v);
+        () /* ~ changed by cargo-mutants ~ */
     }
     pub(crate) fn len(&self) -> usize {
         self.0.len()
     }
 }
 
 /// Reads primitives, refusing rather than panicking when the input runs out.
 ///

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-format/src/writer.rs:124:13:
attempt to subtract with overflow

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
