*** crates/pstore-format/src/codec.rs:42:9: replace Enc::len -> usize with 0

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Enc::len -> usize with 0
@@ -34,17 +34,17 @@
         // Length-prefixed, so a decoder never has to guess where a field ends.
         self.u32(v.len() as u32);
         self.0.extend_from_slice(v);
     }
     pub(crate) fn raw(&mut self, v: &[u8]) {
         self.0.extend_from_slice(v);
     }
     pub(crate) fn len(&self) -> usize {
-        self.0.len()
+        0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Reads primitives, refusing rather than panicking when the input runs out.
 ///
 /// Every method returns `Result`: a truncated or tampered segment must be an error, not a
 /// wrong answer served as data.
 #[derive(Debug)]

---- a_future_version_is_refused_rather_than_guessed_at stdout ----

thread 'a_future_version_is_refused_rather_than_guessed_at' panicked at crates/pstore-format/src/writer.rs:123:9:
assertion `left == right` failed
  left: 0
 right: 42

---- a_tampered_index_section_is_caught_by_the_checksum stdout ----

thread 'a_tampered_index_section_is_caught_by_the_checksum' panicked at crates/pstore-format/src/writer.rs:123:9:
assertion `left == right` failed
  left: 0
 right: 42

---- a_scan_of_a_segment_whose_blocks_are_gone_is_an_error stdout ----

thread 'a_scan_of_a_segment_whose_blocks_are_gone_is_an_error' panicked at crates/pstore-format/src/writer.rs:123:9:
assertion `left == right` failed
  left: 0
 right: 42

failures:
    a_future_version_is_refused_rather_than_guessed_at
    a_scan_of_a_segment_whose_blocks_are_gone_is_an_error
    a_segment_with_an_impossible_block_count_is_refused
    a_tampered_index_section_is_caught_by_the_checksum
    a_truncated_segment_is_an_error
    an_unknown_value_tag_is_an_error

test result: FAILED. 4 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
