*** crates/pstore-format/src/codec.rs:69:9: replace Dec<'a>::u8 -> Result<u8, FormatError> with Ok(0)

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Dec<'a>::u8 -> Result<u8, FormatError> with Ok(0)
@@ -61,17 +61,17 @@
     fn take(&mut self, n: usize) -> Result<&'a [u8], FormatError> {
         let end = self.pos.checked_add(n).ok_or(FormatError::Truncated)?;
         let out = self.buf.get(self.pos..end).ok_or(FormatError::Truncated)?;
         self.pos = end;
         Ok(out)
     }
 
     pub(crate) fn u8(&mut self) -> Result<u8, FormatError> {
-        self.take(1)?.first().copied().ok_or(FormatError::Truncated)
+        Ok(0) /* ~ changed by cargo-mutants ~ */
     }
     pub(crate) fn u16(&mut self) -> Result<u16, FormatError> {
         Ok(u16::from_le_bytes(
             self.take(2)?
                 .try_into()
                 .map_err(|_| FormatError::Truncated)?,
         ))
     }

---- codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking stdout ----

thread 'codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking' panicked at crates/pstore-format/src/codec.rs:164:9:
assertion failed: Dec::new(&[]).u8().is_err()

---- codec::tests::every_primitive_round_trips stdout ----

thread 'codec::tests::every_primitive_round_trips' panicked at crates/pstore-format/src/codec.rs:150:9:
assertion `left == right` failed
  left: 0
 right: 7

failures:
    codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking
    codec::tests::every_primitive_round_trips

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
