*** crates/pstore-format/src/codec.rs:72:9: replace Dec<'a>::u16 -> Result<u16, FormatError> with Ok(0)

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Dec<'a>::u16 -> Result<u16, FormatError> with Ok(0)
@@ -64,21 +64,17 @@
         self.pos = end;
         Ok(out)
     }
 
     pub(crate) fn u8(&mut self) -> Result<u8, FormatError> {
         self.take(1)?.first().copied().ok_or(FormatError::Truncated)
     }
     pub(crate) fn u16(&mut self) -> Result<u16, FormatError> {
-        Ok(u16::from_le_bytes(
-            self.take(2)?
-                .try_into()
-                .map_err(|_| FormatError::Truncated)?,
-        ))
+        Ok(0) /* ~ changed by cargo-mutants ~ */
     }
     pub(crate) fn u32(&mut self) -> Result<u32, FormatError> {
         Ok(u32::from_le_bytes(
             self.take(4)?
                 .try_into()
                 .map_err(|_| FormatError::Truncated)?,
         ))
     }

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:134:41:
called `Result::unwrap()` on an `Err` value: Format("unsupported segment version 0")

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
