*** crates/pstore-format/src/codec.rs:72:9: replace Dec<'a>::u16 -> Result<u16, FormatError> with Ok(1)

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Dec<'a>::u16 -> Result<u16, FormatError> with Ok(1)
@@ -64,21 +64,17 @@
         self.pos = end;
         Ok(out)
     }
 
     pub(crate) fn u8(&mut self) -> Result<u8, FormatError> {
         self.take(1)?.first().copied().ok_or(FormatError::Truncated)
     }
     pub(crate) fn u16(&mut self) -> Result<u16, FormatError> {
-        Ok(u16::from_le_bytes(
-            self.take(2)?
-                .try_into()
-                .map_err(|_| FormatError::Truncated)?,
-        ))
+        Ok(1) /* ~ changed by cargo-mutants ~ */
     }
     pub(crate) fn u32(&mut self) -> Result<u32, FormatError> {
         Ok(u32::from_le_bytes(
             self.take(4)?
                 .try_into()
                 .map_err(|_| FormatError::Truncated)?,
         ))
     }

---- codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking stdout ----

thread 'codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking' panicked at crates/pstore-format/src/codec.rs:161:9:
assertion failed: Dec::new(&[1]).u16().is_err()

---- codec::tests::every_primitive_round_trips stdout ----

thread 'codec::tests::every_primitive_round_trips' panicked at crates/pstore-format/src/codec.rs:147:9:
assertion `left == right` failed
  left: 1
 right: 1000

failures:
    codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking
    codec::tests::every_primitive_round_trips

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
