*** crates/pstore-format/src/codec.rs:86:9: replace Dec<'a>::u64 -> Result<u64, FormatError> with Ok(0)

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Dec<'a>::u64 -> Result<u64, FormatError> with Ok(0)
@@ -78,21 +78,17 @@
     pub(crate) fn u32(&mut self) -> Result<u32, FormatError> {
         Ok(u32::from_le_bytes(
             self.take(4)?
                 .try_into()
                 .map_err(|_| FormatError::Truncated)?,
         ))
     }
     pub(crate) fn u64(&mut self) -> Result<u64, FormatError> {
-        Ok(u64::from_le_bytes(
-            self.take(8)?
-                .try_into()
-                .map_err(|_| FormatError::Truncated)?,
-        ))
+        Ok(0) /* ~ changed by cargo-mutants ~ */
     }
     pub(crate) fn i64(&mut self) -> Result<i64, FormatError> {
         Ok(i64::from_le_bytes(
             self.take(8)?
                 .try_into()
                 .map_err(|_| FormatError::Truncated)?,
         ))
     }

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:134:41:
called `Result::unwrap()` on an `Err` value: Format("segment corrupt: bad trailing magic")

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
