*** crates/pstore-format/src/codec.rs:93:9: replace Dec<'a>::i64 -> Result<i64, FormatError> with Ok(-1)

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Dec<'a>::i64 -> Result<i64, FormatError> with Ok(-1)
@@ -85,21 +85,17 @@
     pub(crate) fn u64(&mut self) -> Result<u64, FormatError> {
         Ok(u64::from_le_bytes(
             self.take(8)?
                 .try_into()
                 .map_err(|_| FormatError::Truncated)?,
         ))
     }
     pub(crate) fn i64(&mut self) -> Result<i64, FormatError> {
-        Ok(i64::from_le_bytes(
-            self.take(8)?
-                .try_into()
-                .map_err(|_| FormatError::Truncated)?,
-        ))
+        Ok(-1) /* ~ changed by cargo-mutants ~ */
     }
     pub(crate) fn f32(&mut self) -> Result<f32, FormatError> {
         Ok(f32::from_le_bytes(
             self.take(4)?
                 .try_into()
                 .map_err(|_| FormatError::Truncated)?,
         ))
     }

---- codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking stdout ----

thread 'codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking' panicked at crates/pstore-format/src/codec.rs:164:9:
assertion failed: Dec::new(&[1; 7]).i64().is_err()

---- codec::tests::every_primitive_round_trips stdout ----

thread 'codec::tests::every_primitive_round_trips' panicked at crates/pstore-format/src/codec.rs:150:9:
assertion `left == right` failed
  left: -1
 right: -42

failures:
    codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking
    codec::tests::every_primitive_round_trips

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
