*** crates/pstore-format/src/docs.rs:13:5: replace encode_docs -> Vec<u8> with vec![]

*** mutation diff:
--- crates/pstore-format/src/docs.rs
+++ replace encode_docs -> Vec<u8> with vec![]
@@ -5,40 +5,17 @@
 
 use crate::codec::{Dec, Enc};
 use crate::{Document, FormatError, Value};
 use std::collections::BTreeMap;
 
 /// Encodes documents as a self-delimiting run.
 #[must_use]
 pub fn encode_docs(docs: &[Document]) -> Vec<u8> {
-    let mut e = Enc::default();
-    e.u32(docs.len() as u32);
-    for d in docs {
-        e.bytes(d.id.as_bytes());
-        e.u32(d.vector.len() as u32);
-        for f in &d.vector {
-            e.f32(*f);
-        }
-        e.u32(d.attrs.len() as u32);
-        for (k, v) in &d.attrs {
-            e.bytes(k.as_bytes());
-            match v {
-                Value::Int(n) => {
-                    e.u8(0);
-                    e.i64(*n);
-                }
-                Value::Str(s) => {
-                    e.u8(1);
-                    e.bytes(s.as_bytes());
-                }
-            }
-        }
-    }
-    e.0
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decodes a run written by [`encode_docs`], refusing anything malformed.
 pub fn decode_docs(buf: &[u8]) -> Result<Vec<Document>, FormatError> {
     let mut d = Dec::new(buf);
     let n = d.u32()? as usize;
     let mut out = Vec::with_capacity(n.min(1 << 20));
     for _ in 0..n {

*** result: Success
