*** crates/pstore-format/src/docs.rs:56:17: delete match arm 0 in decode_docs

*** mutation diff:
--- crates/pstore-format/src/docs.rs
+++ delete match arm 0 in decode_docs
@@ -48,17 +48,17 @@
         for _ in 0..dims {
             vector.push(d.f32()?);
         }
         let an = d.u32()? as usize;
         let mut attrs = BTreeMap::new();
         for _ in 0..an {
             let k = d.string()?;
             let v = match d.u8()? {
-                0 => Value::Int(d.i64()?),
+                 /* ~ changed by cargo-mutants ~ */
                 1 => Value::Str(d.string()?),
                 _ => return Err(FormatError::Corrupt("unknown value tag")),
             };
             attrs.insert(k, v);
         }
         out.push(Document { id, vector, attrs });
     }
     Ok(out)

---- a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing stdout ----

thread 'a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing' panicked at crates/pstore-format/tests/search.rs:111:48:
called `Result::unwrap()` on an `Err` value: Corrupt("unknown value tag")

---- search_respects_a_filter stdout ----

thread 'search_respects_a_filter' panicked at crates/pstore-format/tests/search.rs:194:10:
called `Result::unwrap()` on an `Err` value: Corrupt("unknown value tag")

---- search_returns_k_results_when_k_exceeds_the_segment stdout ----

thread 'search_returns_k_results_when_k_exceeds_the_segment' panicked at crates/pstore-format/tests/search.rs:170:14:
called `Result::unwrap()` on an `Err` value: Corrupt("unknown value tag")

failures:
    a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing
    a_string_filter_cannot_prune_but_still_filters
    pruning_does_not_change_the_answer
    search_respects_a_filter
    search_returns_k_results_when_k_exceeds_the_segment
    zone_maps_skip_blocks_that_cannot_match

test result: FAILED. 2 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
