*** crates/pstore-format/src/docs.rs:62:5: replace encode_docs -> Vec<u8> with vec![0]

*** mutation diff:
--- crates/pstore-format/src/docs.rs
+++ replace encode_docs -> Vec<u8> with vec![0]
@@ -54,27 +54,17 @@
 
 /// Encodes documents **with their vectors**, for the WAL bundle.
 ///
 /// ⚠️ Unlike a segment block, a bundle is the durable record of a write before anything has
 /// been folded, so it must carry everything needed to reconstruct the document — vectors
 /// included. A segment block does not, because segments keep vectors in their own section.
 #[must_use]
 pub fn encode_docs(docs: &[Document]) -> Vec<u8> {
-    let mut e = Enc::default();
-    e.u32(docs.len() as u32);
-    for d in docs {
-        e.bytes(d.id.as_bytes());
-        e.u32(d.vector.len() as u32);
-        for f in &d.vector {
-            e.f32(*f);
-        }
-        encode_attrs(&mut e, &d.attrs);
-    }
-    e.0
+    vec![0] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decodes a run written by [`encode_docs`], refusing anything malformed.
 pub fn decode_docs(buf: &[u8]) -> Result<Vec<Document>, FormatError> {
     let mut d = Dec::new(buf);
     let n = d.u32()? as usize;
     let mut out = Vec::with_capacity(n.min(1 << 20));
     for _ in 0..n {

---- documents_round_trip_through_the_shared_codec stdout ----

thread 'documents_round_trip_through_the_shared_codec' panicked at crates/pstore-engine/tests/bundle_errors.rs:38:49:
called `Result::unwrap()` on an `Err` value: Truncated

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:133:20:
called `Result::unwrap()` on an `Err` value: Format("segment truncated")

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped
    documents_round_trip_through_the_shared_codec

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
