*** crates/pstore-format/src/docs.rs:77:5: replace decode_docs -> Result<Vec<Document>, FormatError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-format/src/docs.rs
+++ replace decode_docs -> Result<Vec<Document>, FormatError> with Ok(vec![])
@@ -69,30 +69,17 @@
         }
         encode_attrs(&mut e, &d.attrs);
     }
     e.0
 }
 
 /// Decodes a run written by [`encode_docs`], refusing anything malformed.
 pub fn decode_docs(buf: &[u8]) -> Result<Vec<Document>, FormatError> {
-    let mut d = Dec::new(buf);
-    let n = d.u32()? as usize;
-    let mut out = Vec::with_capacity(n.min(1 << 20));
-    for _ in 0..n {
-        let id = d.string()?;
-        let dims = d.u32()? as usize;
-        let mut vector = Vec::with_capacity(dims.min(1 << 16));
-        for _ in 0..dims {
-            vector.push(d.f32()?);
-        }
-        let attrs = decode_attrs(&mut d)?;
-        out.push(Document { id, vector, attrs });
-    }
-    Ok(out)
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Encodes segment-block rows: id and attributes, **no vector**.
 #[must_use]
 pub fn encode_rows(docs: &[Document]) -> Vec<u8> {
     let mut e = Enc::default();
     e.u32(docs.len() as u32);
     for d in docs {

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:135:5:
rows before the hole must still be folded

---- a_truncated_document_run_is_refused_at_every_length stdout ----

thread 'a_truncated_document_run_is_refused_at_every_length' panicked at crates/pstore-engine/tests/bundle_errors.rs:46:9:
decoded a run cut to 0

---- documents_round_trip_through_the_shared_codec stdout ----

thread 'documents_round_trip_through_the_shared_codec' panicked at crates/pstore-engine/tests/bundle_errors.rs:38:5:
assertion `left == right` failed
  left: []
 right: [Document { id: "a", vector: [1.0], attrs: {"n": Int(1), "s": Str("v1")} }, Document { id: "b", vector: [-2.0], attrs: {"n": Int(-2), "s": Str("v-2")} }, Document { id: "c", vector: [], attrs: {} }]

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped
    a_truncated_document_run_is_refused_at_every_length
    documents_round_trip_through_the_shared_codec

test result: FAILED. 4 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
