*** crates/pstore-format/src/docs.rs:96:5: replace encode_rows -> Vec<u8> with vec![1]

*** mutation diff:
--- crates/pstore-format/src/docs.rs
+++ replace encode_rows -> Vec<u8> with vec![1]
@@ -88,23 +88,17 @@
         out.push(Document { id, vector, attrs });
     }
     Ok(out)
 }
 
 /// Encodes segment-block rows: id and attributes, **no vector**.
 #[must_use]
 pub fn encode_rows(docs: &[Document]) -> Vec<u8> {
-    let mut e = Enc::default();
-    e.u32(docs.len() as u32);
-    for d in docs {
-        e.bytes(d.id.as_bytes());
-        encode_attrs(&mut e, &d.attrs);
-    }
-    e.0
+    vec![1] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Decodes segment-block rows. Vectors come back empty and are filled from the
 /// [`crate::Section::Vectors`] section by the caller that wants them.
 pub fn decode_rows(buf: &[u8]) -> Result<Vec<Document>, FormatError> {
     let mut d = Dec::new(buf);
     let n = d.u32()? as usize;
     let mut out = Vec::with_capacity(n.min(1 << 20));

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:134:41:
called `Result::unwrap()` on an `Err` value: Format("segment truncated")

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
