*** crates/pstore-format/src/lib.rs:100:9: replace Filter::matches -> bool with true

*** mutation diff:
--- crates/pstore-format/src/lib.rs
+++ replace Filter::matches -> bool with true
@@ -92,21 +92,17 @@
         match self {
             Self::Eq(c, _) | Self::Gt(c, _) | Self::Lt(c, _) => c,
         }
     }
 
     /// Whether one row satisfies it.
     #[must_use]
     pub fn matches(&self, doc: &Document) -> bool {
-        match self {
-            Self::Eq(c, v) => doc.attrs.get(c) == Some(v),
-            Self::Gt(c, n) => matches!(doc.attrs.get(c), Some(Value::Int(v)) if v > n),
-            Self::Lt(c, n) => matches!(doc.attrs.get(c), Some(Value::Int(v)) if v < n),
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Whether a block whose integer column spans `min..=max` **could** contain a match.
     ///
     /// ⚠️ Must never answer `false` for a block that could match: a wrong `false` silently
     /// drops rows, which reads as a recall bug rather than an error. Answering `true` for a
     /// block that cannot match is merely wasted work.
     #[must_use]

---- filters_match_rows_by_type stdout ----

thread 'filters_match_rows_by_type' panicked at crates/pstore-format/tests/corrupt.rs:143:5:
assertion failed: !Filter::Eq("n".to_owned(), Value::Int(6)).matches(&d)

failures:
    filters_match_rows_by_type

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
