*** crates/pstore-format/src/lib.rs:100:9: replace Filter::matches -> bool with false

*** mutation diff:
--- crates/pstore-format/src/lib.rs
+++ replace Filter::matches -> bool with false
@@ -92,21 +92,17 @@
         match self {
             Self::Eq(c, _) | Self::Gt(c, _) | Self::Lt(c, _) => c,
         }
     }
 
     /// Whether one row satisfies it.
     #[must_use]
     pub fn matches(&self, doc: &Document) -> bool {
-        match self {
-            Self::Eq(c, v) => doc.attrs.get(c) == Some(v),
-            Self::Gt(c, n) => matches!(doc.attrs.get(c), Some(Value::Int(v)) if v > n),
-            Self::Lt(c, n) => matches!(doc.attrs.get(c), Some(Value::Int(v)) if v < n),
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// Whether a block whose integer column spans `min..=max` **could** contain a match.
     ///
     /// ⚠️ Must never answer `false` for a block that could match: a wrong `false` silently
     /// drops rows, which reads as a recall bug rather than an error. Answering `true` for a
     /// block that cannot match is merely wasted work.
     #[must_use]

---- write_read_filter_and_search_one_index stdout ----

thread 'write_read_filter_and_search_one_index' panicked at crates/pstore-engine/tests/end_to_end.rs:58:5:
the filter must actually select something

failures:
    write_read_filter_and_search_one_index

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
