*** crates/pstore-format/src/lib.rs:118:35: replace > with >= in Filter::could_match

*** mutation diff:
--- crates/pstore-format/src/lib.rs
+++ replace > with >= in Filter::could_match
@@ -110,17 +110,17 @@
     /// drops rows, which reads as a recall bug rather than an error. Answering `true` for a
     /// block that cannot match is merely wasted work.
     #[must_use]
     pub fn could_match(&self, min: i64, max: i64) -> bool {
         match self {
             Self::Eq(_, Value::Int(n)) => *n >= min && *n <= max,
             // A string equality has no ordering to prune on, so every block could match.
             Self::Eq(_, Value::Str(_)) => true,
-            Self::Gt(_, n) => max > *n,
+            Self::Gt(_, n) => max >= /* ~ changed by cargo-mutants ~ */ *n,
             Self::Lt(_, n) => min < *n,
         }
     }
 }
 
 /// Why a segment could not be read.
 #[derive(Debug, Clone, PartialEq, Eq, thiserror::Error)]
 pub enum FormatError {

---- filters_prune_only_what_they_provably_can stdout ----

thread 'filters_prune_only_what_they_provably_can' panicked at crates/pstore-format/tests/corrupt.rs:112:5:
max equal to the bound cannot: Gt is strict

failures:
    filters_prune_only_what_they_provably_can

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
