*** crates/pstore-format/src/lib.rs:119:35: replace < with > in Filter::could_match

*** mutation diff:
--- crates/pstore-format/src/lib.rs
+++ replace < with > in Filter::could_match
@@ -111,17 +111,17 @@
     /// block that cannot match is merely wasted work.
     #[must_use]
     pub fn could_match(&self, min: i64, max: i64) -> bool {
         match self {
             Self::Eq(_, Value::Int(n)) => *n >= min && *n <= max,
             // A string equality has no ordering to prune on, so every block could match.
             Self::Eq(_, Value::Str(_)) => true,
             Self::Gt(_, n) => max > *n,
-            Self::Lt(_, n) => min < *n,
+            Self::Lt(_, n) => min > /* ~ changed by cargo-mutants ~ */ *n,
         }
     }
 }
 
 /// Why a segment could not be read.
 #[derive(Debug, Clone, PartialEq, Eq, thiserror::Error)]
 pub enum FormatError {
     /// The bytes ran out mid-field.

---- filters_prune_only_what_they_provably_can stdout ----

thread 'filters_prune_only_what_they_provably_can' panicked at crates/pstore-format/tests/corrupt.rs:118:5:
min just below the bound could match

failures:
    filters_prune_only_what_they_provably_can

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
