*** crates/pstore-format/src/lib.rs:92:9: replace Filter::column -> &str with ""

*** mutation diff:
--- crates/pstore-format/src/lib.rs
+++ replace Filter::column -> &str with ""
@@ -84,19 +84,17 @@
     /// Integer attribute strictly less than.
     Lt(String, i64),
 }
 
 impl Filter {
     /// The attribute this filter reads.
     #[must_use]
     pub fn column(&self) -> &str {
-        match self {
-            Self::Eq(c, _) | Self::Gt(c, _) | Self::Lt(c, _) => c,
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 
     /// Whether one row satisfies it.
     #[must_use]
     pub fn matches(&self, doc: &Document) -> bool {
         match self {
             Self::Eq(c, v) => doc.attrs.get(c) == Some(v),
             Self::Gt(c, n) => matches!(doc.attrs.get(c), Some(Value::Int(v)) if v > n),

---- filters_prune_only_what_they_provably_can stdout ----

thread 'filters_prune_only_what_they_provably_can' panicked at crates/pstore-format/tests/corrupt.rs:132:5:
assertion `left == right` failed
  left: ""
 right: "n"

failures:
    filters_prune_only_what_they_provably_can

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
