*** crates/pstore-format/src/reader.rs:101:37: replace - with / in Segment::open

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace - with / in Segment::open
@@ -93,17 +93,17 @@
             // reader at once, which segments being immutable makes permanent.
             if id == Section::Blocks as u16 {
                 blocks_span = Some(span.clone());
             }
             sections.insert(id, span);
         }
         let blocks_span = blocks_span.ok_or(FormatError::Corrupt("no block section"))?;
         // The block index sits inside the region already fetched, at a known offset.
-        let lo = (blocks_span.start - meta_offset) as usize;
+        let lo = (blocks_span.start / /* ~ changed by cargo-mutants ~ */ meta_offset) as usize;
         let hi = lo
             .checked_add((blocks_span.end - blocks_span.start) as usize)
             .ok_or(FormatError::Truncated)?;
         let blocks = idx_bytes.get(lo..hi).ok_or(FormatError::Truncated)?;
 
         Ok(Self {
             blocks: Self::decode_index(blocks)?,
             rows,

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:134:41:
called `Result::unwrap()` on an `Err` value: Format("segment truncated")

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
