*** crates/pstore-format/src/reader.rs:105:9: replace Segment::row_count -> usize with 0

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace Segment::row_count -> usize with 0
@@ -97,17 +97,17 @@
             });
         }
         Ok(blocks)
     }
 
     /// Rows in the segment.
     #[must_use]
     pub fn row_count(&self) -> usize {
-        self.rows as usize
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Blocks in the segment.
     #[must_use]
     pub fn block_count(&self) -> usize {
         self.blocks.len()
     }

---- a_segment_is_readable_from_its_key_alone stdout ----

thread 'a_segment_is_readable_from_its_key_alone' panicked at crates/pstore-format/tests/segment.rs:63:5:
assertion `left == right` failed
  left: 0
 right: 9

---- a_segment_round_trips_through_the_blob_store stdout ----

thread 'a_segment_round_trips_through_the_blob_store' panicked at crates/pstore-format/tests/segment.rs:44:5:
assertion `left == right` failed
  left: 0
 right: 50

---- a_small_segment_opens_in_one_read stdout ----

thread 'a_small_segment_opens_in_one_read' panicked at crates/pstore-format/tests/segment.rs:97:5:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    a_segment_is_readable_from_its_key_alone
    a_segment_round_trips_through_the_blob_store
    a_segment_whose_index_section_overflows_the_suffix_takes_two_reads
    a_small_segment_opens_in_one_read

test result: FAILED. 3 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
