*** crates/pstore-format/src/reader.rs:109:9: replace Segment::block_count -> usize with 1

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace Segment::block_count -> usize with 1
@@ -101,17 +101,17 @@
     #[must_use]
     pub fn row_count(&self) -> usize {
         self.rows as usize
     }
 
     /// Blocks in the segment.
     #[must_use]
     pub fn block_count(&self) -> usize {
-        self.blocks.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Which blocks a filter cannot rule out.
     ///
     /// A block is kept unless its zone map proves no row in it can match. **Erring toward
     /// keeping is mandatory**: a wrongly dropped block silently loses rows.
     #[must_use]
     pub fn blocks_to_read(&self, filter: Option<&Filter>) -> Vec<usize> {

---- zone_maps_skip_blocks_that_cannot_match stdout ----

thread 'zone_maps_skip_blocks_that_cannot_match' panicked at crates/pstore-format/tests/search.rs:38:5:
assertion `left == right` failed
  left: 1
 right: 40

failures:
    zone_maps_skip_blocks_that_cannot_match

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
