*** crates/pstore-format/src/reader.rs:143:9: replace Segment::fetch_section -> Result<Option<Bytes>, FormatError> with Ok(None)

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace Segment::fetch_section -> Result<Option<Bytes>, FormatError> with Ok(None)
@@ -135,20 +135,17 @@
     /// One ranged read. The caller decides *which* section, which is how a rung-0 scan
     /// avoids the full-precision bytes entirely rather than fetching and discarding them.
     pub async fn fetch_section<S: BlobStore>(
         &self,
         store: &S,
         key: &Key,
         section: Section,
     ) -> Result<Option<Bytes>, FormatError> {
-        let Some(span) = self.section(section) else {
-            return Ok(None);
-        };
-        Ok(Some(store.get_range(key, span).await?))
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Bytes per row in the vectors section, or 0 if there is none.
     fn vector_row_len(&self) -> usize {
         match (self.section(Section::Vectors), self.rows) {
             (Some(span), rows) if rows > 0 => (span.end - span.start) as usize / rows as usize,
             _ => 0,
         }

---- a_quantised_scan_reads_no_full_precision_bytes stdout ----

thread 'a_quantised_scan_reads_no_full_precision_bytes' panicked at crates/pstore-format/tests/sections.rs:126:10:
called `Option::unwrap()` on a `None` value

failures:
    a_quantised_scan_reads_no_full_precision_bytes

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
