*** crates/pstore-format/src/reader.rs:151:41: replace + with - in Segment::scan

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace + with - in Segment::scan
@@ -143,17 +143,17 @@
     ) -> Result<Vec<Document>, FormatError> {
         let wanted = self.blocks_to_read(filter);
         if wanted.is_empty() {
             return Ok(Vec::new());
         }
         let ranges: Vec<_> = wanted
             .iter()
             .filter_map(|i| self.blocks.get(*i))
-            .map(|b| b.offset..b.offset + u64::from(b.len))
+            .map(|b| b.offset..b.offset - /* ~ changed by cargo-mutants ~ */ u64::from(b.len))
             .collect();
         let bufs = store.get_ranges(key, &ranges).await?;
 
         let mut out = Vec::new();
         for buf in &bufs {
             for doc in Self::decode_block(buf)? {
                 if filter.is_none_or(|f| f.matches(&doc)) {
                     out.push(doc);

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at /tmp/cargo-mutants-pstore-R9GKOv.tmp/crates/pstore-format/src/reader.rs:151:32:
attempt to subtract with overflow

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
