*** crates/pstore-format/src/reader.rs:151:9: replace Segment::vector_row_len -> usize with 1

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace Segment::vector_row_len -> usize with 1
@@ -143,20 +143,17 @@
         let Some(span) = self.section(section) else {
             return Ok(None);
         };
         Ok(Some(store.get_range(key, span).await?))
     }
 
     /// Bytes per row in the vectors section, or 0 if there is none.
     fn vector_row_len(&self) -> usize {
-        match (self.section(Section::Vectors), self.rows) {
-            (Some(span), rows) if rows > 0 => (span.end - span.start) as usize / rows as usize,
-            _ => 0,
-        }
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// The full-precision vectors, one row at a time.
     ///
     /// Width is derived by dividing the section by the row count, so the format needs no
     /// separate dimension field and cannot disagree with itself about one.
     pub async fn vectors<S: BlobStore>(
         &self,

---- search_and_filter_work_across_the_memtable_and_segments stdout ----

thread 'search_and_filter_work_across_the_memtable_and_segments' panicked at crates/pstore-engine/tests/engine.rs:318:5:
assertion `left == right` failed: nearest must be found wherever it lives
  left: "d0"
 right: "d25"

failures:
    search_and_filter_work_across_the_memtable_and_segments

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
