*** crates/pstore-format/src/reader.rs:152:40: replace > with >= in Segment::vector_row_len

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace > with >= in Segment::vector_row_len
@@ -144,17 +144,17 @@
             return Ok(None);
         };
         Ok(Some(store.get_range(key, span).await?))
     }
 
     /// Bytes per row in the vectors section, or 0 if there is none.
     fn vector_row_len(&self) -> usize {
         match (self.section(Section::Vectors), self.rows) {
-            (Some(span), rows) if rows > 0 => (span.end - span.start) as usize / rows as usize,
+            (Some(span), rows) if rows >= /* ~ changed by cargo-mutants ~ */ 0 => (span.end - span.start) as usize / rows as usize,
             _ => 0,
         }
     }
 
     /// The full-precision vectors, one row at a time.
     ///
     /// Width is derived by dividing the section by the row count, so the format needs no
     /// separate dimension field and cannot disagree with itself about one.

*** result: Success
