*** crates/pstore-format/src/reader.rs:152:80: replace / with * in Segment::vector_row_len

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace / with * in Segment::vector_row_len
@@ -144,17 +144,17 @@
             return Ok(None);
         };
         Ok(Some(store.get_range(key, span).await?))
     }
 
     /// Bytes per row in the vectors section, or 0 if there is none.
     fn vector_row_len(&self) -> usize {
         match (self.section(Section::Vectors), self.rows) {
-            (Some(span), rows) if rows > 0 => (span.end - span.start) as usize / rows as usize,
+            (Some(span), rows) if rows > 0 => (span.end - span.start) as usize * /* ~ changed by cargo-mutants ~ */ rows as usize,
             _ => 0,
         }
     }
 
     /// The full-precision vectors, one row at a time.
     ///
     /// Width is derived by dividing the section by the row count, so the format needs no
     /// separate dimension field and cannot disagree with itself about one.

---- compaction_does_not_change_the_answer stdout ----

thread 'compaction_does_not_change_the_answer' panicked at crates/pstore-engine/tests/compaction.rs:73:10:
called `Result::unwrap()` on an `Err` value: Format("blob error: range 0..3520 outside object of 266 bytes")

---- a_fold_landing_mid_compaction_is_not_swallowed_by_it stdout ----

thread 'a_fold_landing_mid_compaction_is_not_swallowed_by_it' panicked at crates/pstore-engine/tests/compaction.rs:274:10:
called `Result::unwrap()` on an `Err` value: Format("blob error: range 0..5566 outside object of 296 bytes")

---- concurrent_compactors_produce_one_winner stdout ----

thread 'concurrent_compactors_produce_one_winner' panicked at crates/pstore-engine/tests/compaction.rs:162:10:
called `Result::unwrap()` on an `Err` value: Format("blob error: range 0..8276 outside object of 318 bytes")

failures:
    a_fold_landing_mid_compaction_is_not_swallowed_by_it
    compaction_does_not_change_the_answer
    concurrent_compactors_produce_one_winner

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
