*** crates/pstore-format/src/reader.rs:166:9: replace Segment::vectors -> Result<Vec<Vec<f32>>, FormatError> with Ok(vec![vec![0.0]])

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace Segment::vectors -> Result<Vec<Vec<f32>>, FormatError> with Ok(vec![vec![0.0]])
@@ -158,31 +158,17 @@
     ///
     /// Width is derived by dividing the section by the row count, so the format needs no
     /// separate dimension field and cannot disagree with itself about one.
     pub async fn vectors<S: BlobStore>(
         &self,
         store: &S,
         key: &Key,
     ) -> Result<Vec<Vec<f32>>, FormatError> {
-        let Some(raw) = self.fetch_section(store, key, Section::Vectors).await? else {
-            return Ok(Vec::new());
-        };
-        if self.rows == 0 {
-            return Ok(Vec::new());
-        }
-        let per_row = raw.len() / self.rows as usize;
-        Ok(raw
-            .chunks_exact(per_row.max(1))
-            .map(|row| {
-                row.chunks_exact(4)
-                    .map(|b| f32::from_le_bytes(b.try_into().unwrap_or([0; 4])))
-                    .collect()
-            })
-            .collect())
+        Ok(vec![vec![0.0]]) /* ~ changed by cargo-mutants ~ */
     }
 
     fn decode_index(bytes: &[u8]) -> Result<Vec<BlockMeta>, FormatError> {
         let mut d = Dec::new(bytes);
         let n = d.u32()? as usize;
         let mut blocks = Vec::with_capacity(n.min(1 << 20));
         for _ in 0..n {
             let (offset, len, rows) = (d.u64()?, d.u32()?, d.u32()?);

---- a_small_index_answers_exactly_and_builds_no_index stdout ----

thread 'a_small_index_answers_exactly_and_builds_no_index' panicked at crates/pstore-index/tests/persisted.rs:313:5:
assertion `left == right` failed: an exactly-scanned index was not exact
  left: [0]
 right: [42, 102, 122, 62, 72, 2, 22, 112, 12, 32]

---- exact_rerank_costs_exactly_one_more_round stdout ----

thread 'exact_rerank_costs_exactly_one_more_round' panicked at crates/pstore-index/tests/persisted.rs:151:5:
assertion `left == right` failed: exact took 1 rounds
  left: 1
 right: 2

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:411:5:
`exact` found 0 against `fast`'s 49

failures:
    a_small_index_answers_exactly_and_builds_no_index
    exact_rerank_costs_exactly_one_more_round
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.43s

*** result: Failure(101)
