*** crates/pstore-format/src/reader.rs:169:22: replace == with != in Segment::vectors

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace == with != in Segment::vectors
@@ -161,17 +161,17 @@
     pub async fn vectors<S: BlobStore>(
         &self,
         store: &S,
         key: &Key,
     ) -> Result<Vec<Vec<f32>>, FormatError> {
         let Some(raw) = self.fetch_section(store, key, Section::Vectors).await? else {
             return Ok(Vec::new());
         };
-        if self.rows == 0 {
+        if self.rows != /* ~ changed by cargo-mutants ~ */ 0 {
             return Ok(Vec::new());
         }
         let per_row = raw.len() / self.rows as usize;
         Ok(raw
             .chunks_exact(per_row.max(1))
             .map(|row| {
                 row.chunks_exact(4)
                     .map(|b| f32::from_le_bytes(b.try_into().unwrap_or([0; 4])))

---- a_small_index_answers_exactly_and_builds_no_index stdout ----

thread 'a_small_index_answers_exactly_and_builds_no_index' panicked at crates/pstore-index/tests/persisted.rs:313:5:
assertion `left == right` failed: an exactly-scanned index was not exact
  left: []
 right: [42, 102, 122, 62, 72, 2, 22, 112, 12, 32]

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:411:5:
`exact` found 0 against `fast`'s 49

failures:
    a_small_index_answers_exactly_and_builds_no_index
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.29s

*** result: Failure(101)
