*** crates/pstore-format/src/reader.rs:183:9: replace Segment::search -> Result<Vec<(String, f32)>, FormatError> with Ok(vec![("xyzzy".into(), 1.0)])

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace Segment::search -> Result<Vec<(String, f32)>, FormatError> with Ok(vec![("xyzzy".into(), 1.0)])
@@ -175,42 +175,17 @@
     pub async fn search<S: BlobStore>(
         &self,
         store: &S,
         key: &Key,
         query: &[f32],
         k: usize,
         filter: Option<&Filter>,
     ) -> Result<Vec<(String, f32)>, FormatError> {
-        if k == 0 {
-            return Ok(Vec::new());
-        }
-        let docs = self.scan(store, key, filter).await?;
-        let mut scored = Vec::with_capacity(docs.len());
-        for d in docs {
-            if d.vector.len() != query.len() {
-                return Err(FormatError::DimensionMismatch {
-                    expected: d.vector.len(),
-                    got: query.len(),
-                });
-            }
-            let dist: f32 = d
-                .vector
-                .iter()
-                .zip(query)
-                .map(|(a, b)| (a - b) * (a - b))
-                .sum();
-            scored.push((d.id, dist));
-        }
-        // `total_cmp` rather than `partial_cmp`: a NaN from a malformed vector must order
-        // deterministically instead of making the sort's behaviour undefined. Ties break
-        // on id so the result is reproducible, which is what lets a reference test exist.
-        scored.sort_by(|a, b| a.1.total_cmp(&b.1).then_with(|| a.0.cmp(&b.0)));
-        scored.truncate(k);
-        Ok(scored)
+        Ok(vec![("xyzzy".into(), 1.0)]) /* ~ changed by cargo-mutants ~ */
     }
 
     fn decode_block(buf: &[u8]) -> Result<Vec<Document>, FormatError> {
         let mut d = Dec::new(buf);
         let n = d.u32()? as usize;
         let mut out = Vec::with_capacity(n.min(1 << 20));
         for _ in 0..n {
             let id = d.string()?;

---- search_on_a_dimension_mismatch_is_an_error stdout ----

thread 'search_on_a_dimension_mismatch_is_an_error' panicked at crates/pstore-format/tests/search.rs:210:5:
assertion failed: seg.search(&s, &key, &[0.0, 0.0], 3, None).await.is_err()

---- search_returns_k_results_when_k_exceeds_the_segment stdout ----

thread 'search_returns_k_results_when_k_exceeds_the_segment' panicked at crates/pstore-format/tests/search.rs:167:5:
assertion `left == right` failed
  left: 1
 right: 3

---- exact_search_matches_a_brute_force_reference stdout ----

thread 'exact_search_matches_a_brute_force_reference' panicked at crates/pstore-format/tests/search.rs:154:9:
assertion `left == right` failed: top-10 disagrees with brute force for [0.1, 0.2, 0.3, 0.4]
  left: ["xyzzy"]
 right: ["d452", "d234", "d442", "d165", "d59", "d334", "d362", "d296", "d329", "d438"]

failures:
    exact_search_matches_a_brute_force_reference
    search_on_a_dimension_mismatch_is_an_error
    search_respects_a_filter
    search_returns_k_results_when_k_exceeds_the_segment

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
