*** crates/pstore-format/src/reader.rs:189:31: replace != with == in Segment::search

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace != with == in Segment::search
@@ -181,17 +181,17 @@
         filter: Option<&Filter>,
     ) -> Result<Vec<(String, f32)>, FormatError> {
         if k == 0 {
             return Ok(Vec::new());
         }
         let docs = self.scan(store, key, filter).await?;
         let mut scored = Vec::with_capacity(docs.len());
         for d in docs {
-            if d.vector.len() != query.len() {
+            if d.vector.len() == /* ~ changed by cargo-mutants ~ */ query.len() {
                 return Err(FormatError::DimensionMismatch {
                     expected: d.vector.len(),
                     got: query.len(),
                 });
             }
             let dist: f32 = d
                 .vector
                 .iter()

---- search_on_a_dimension_mismatch_is_an_error stdout ----

thread 'search_on_a_dimension_mismatch_is_an_error' panicked at crates/pstore-format/tests/search.rs:210:5:
assertion failed: seg.search(&s, &key, &[0.0, 0.0], 3, None).await.is_err()

---- search_returns_k_results_when_k_exceeds_the_segment stdout ----

thread 'search_returns_k_results_when_k_exceeds_the_segment' panicked at crates/pstore-format/tests/search.rs:170:14:
called `Result::unwrap()` on an `Err` value: DimensionMismatch { expected: 3, got: 3 }

---- search_respects_a_filter stdout ----

thread 'search_respects_a_filter' panicked at crates/pstore-format/tests/search.rs:194:10:
called `Result::unwrap()` on an `Err` value: DimensionMismatch { expected: 3, got: 3 }

failures:
    exact_search_matches_a_brute_force_reference
    search_on_a_dimension_mismatch_is_an_error
    search_respects_a_filter
    search_returns_k_results_when_k_exceeds_the_segment

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
