*** crates/pstore-format/src/reader.rs:208:9: replace Segment::row_count -> usize with 1

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace Segment::row_count -> usize with 1
@@ -200,17 +200,17 @@
             });
         }
         Ok(blocks)
     }
 
     /// Rows in the segment.
     #[must_use]
     pub fn row_count(&self) -> usize {
-        self.rows as usize
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Blocks in the segment.
     #[must_use]
     pub fn block_count(&self) -> usize {
         self.blocks.len()
     }

---- a_segment_round_trips_through_the_blob_store stdout ----

thread 'a_segment_round_trips_through_the_blob_store' panicked at crates/pstore-format/tests/segment.rs:44:5:
assertion `left == right` failed
  left: 1
 right: 50

---- a_small_segment_opens_in_one_read stdout ----

thread 'a_small_segment_opens_in_one_read' panicked at crates/pstore-format/tests/segment.rs:97:5:
assertion `left == right` failed
  left: 1
 right: 3

---- an_empty_segment_is_legal stdout ----

thread 'an_empty_segment_is_legal' panicked at crates/pstore-format/tests/segment.rs:126:5:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    a_segment_is_readable_from_its_key_alone
    a_segment_round_trips_through_the_blob_store
    a_segment_whose_index_section_overflows_the_suffix_takes_two_reads
    a_small_segment_opens_in_one_read
    an_empty_segment_is_legal

test result: FAILED. 2 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
