*** crates/pstore-format/src/reader.rs:249:9: replace Segment::scan -> Result<Vec<Document>, FormatError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace Segment::scan -> Result<Vec<Document>, FormatError> with Ok(vec![])
@@ -241,74 +241,17 @@
     /// The blocks that survive pruning are fetched in **one coalesced round**, so scanning
     /// costs one round trip regardless of how many blocks match.
     pub async fn scan<S: BlobStore>(
         &self,
         store: &S,
         key: &Key,
         filter: Option<&Filter>,
     ) -> Result<Vec<Document>, FormatError> {
-        let wanted = self.blocks_to_read(filter);
-        if wanted.is_empty() {
-            return Ok(Vec::new());
-        }
-        let ranges: Vec<_> = wanted
-            .iter()
-            .filter_map(|i| self.blocks.get(*i))
-            .map(|b| b.offset..b.offset + u64::from(b.len))
-            .collect();
-        // Row indices, so a decoded row can find its own vector. Blocks are contiguous and
-        // in order, so the base is the sum of the rows before this block.
-        let mut base: Vec<usize> = Vec::with_capacity(self.blocks.len());
-        let mut running = 0usize;
-        for b in &self.blocks {
-            base.push(running);
-            running += b.rows as usize;
-        }
-
-        // ⚠️ Only the vector rows belonging to the blocks being read, not the whole
-        // section. Fetching all of it would undo zone-map pruning in bytes while leaving it
-        // intact in block count -- the plan would still say "one block" and the wire would
-        // still carry the entire segment's vectors.
-        let per_row = self.vector_row_len();
-        let mut all: Vec<std::ops::Range<u64>> = ranges;
-        let block_count = all.len();
-        if let (Some(vec_span), true) = (self.section(Section::Vectors), per_row > 0) {
-            for i in &wanted {
-                let (Some(start), Some(b)) = (base.get(*i), self.blocks.get(*i)) else {
-                    continue;
-                };
-                let lo = vec_span.start + (*start * per_row) as u64;
-                all.push(lo..lo + (b.rows as usize * per_row) as u64);
-            }
-        }
-        // ⚠️ One call, so blocks and vector rows go out TOGETHER. They are different
-        // sections of the same object, both spans are known before either is issued, and
-        // awaiting one before the other would make every scan a two-hop read for no reason
-        // a caller could see. Width is free; depth is not.
-        let bufs = store.get_ranges(key, &all).await?;
-
-        let mut out = Vec::new();
-        for (n, _) in wanted.iter().enumerate() {
-            let Some(buf) = bufs.get(n) else { continue };
-            let rows = Self::decode_block(buf)?;
-            let vecs = bufs.get(block_count + n);
-            for (r, mut doc) in rows.into_iter().enumerate() {
-                if let Some(raw) = vecs.and_then(|v| v.get(r * per_row..(r + 1) * per_row)) {
-                    doc.vector = raw
-                        .chunks_exact(4)
-                        .map(|b| f32::from_le_bytes(b.try_into().unwrap_or([0; 4])))
-                        .collect();
-                }
-                if filter.is_none_or(|f| f.matches(&doc)) {
-                    out.push(doc);
-                }
-            }
-        }
-        Ok(out)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Exact k-nearest-neighbour search by squared L2, over the rows a filter selects.
     ///
     /// Brute force, deliberately (D-10): below a few hundred thousand vectors it is
     /// faster than an approximate index, exactly accurate, needs no maintenance, and
     /// covers the long tail of a millions-of-indexes product. It is also the reference
     /// the approximate path will be measured against, so it must be *exactly* right.

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:135:5:
rows before the hole must still be folded

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
