*** crates/pstore-format/src/reader.rs:264:21: replace += with -= in Segment::scan

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace += with -= in Segment::scan
@@ -256,17 +256,17 @@
             .map(|b| b.offset..b.offset + u64::from(b.len))
             .collect();
         // Row indices, so a decoded row can find its own vector. Blocks are contiguous and
         // in order, so the base is the sum of the rows before this block.
         let mut base: Vec<usize> = Vec::with_capacity(self.blocks.len());
         let mut running = 0usize;
         for b in &self.blocks {
             base.push(running);
-            running += b.rows as usize;
+            running -= /* ~ changed by cargo-mutants ~ */ b.rows as usize;
         }
 
         // ⚠️ Only the vector rows belonging to the blocks being read, not the whole
         // section. Fetching all of it would undo zone-map pruning in bytes while leaving it
         // intact in block count -- the plan would still say "one block" and the wire would
         // still carry the entire segment's vectors.
         let per_row = self.vector_row_len();
         let mut all: Vec<std::ops::Range<u64>> = ranges;

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at /tmp/cargo-mutants-pstore-givrvP.tmp/crates/pstore-format/src/reader.rs:264:13:
attempt to subtract with overflow

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
