*** crates/pstore-format/src/reader.rs:264:21: replace += with *= in Segment::scan

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace += with *= in Segment::scan
@@ -256,17 +256,17 @@
             .map(|b| b.offset..b.offset + u64::from(b.len))
             .collect();
         // Row indices, so a decoded row can find its own vector. Blocks are contiguous and
         // in order, so the base is the sum of the rows before this block.
         let mut base: Vec<usize> = Vec::with_capacity(self.blocks.len());
         let mut running = 0usize;
         for b in &self.blocks {
             base.push(running);
-            running += b.rows as usize;
+            running *= /* ~ changed by cargo-mutants ~ */ b.rows as usize;
         }
 
         // ⚠️ Only the vector rows belonging to the blocks being read, not the whole
         // section. Fetching all of it would undo zone-map pruning in bytes while leaving it
         // intact in block count -- the plan would still say "one block" and the wire would
         // still carry the entire segment's vectors.
         let per_row = self.vector_row_len();
         let mut all: Vec<std::ops::Range<u64>> = ranges;

---- a_cold_search_has_a_sequential_depth_of_at_most_three stdout ----

thread 'a_cold_search_has_a_sequential_depth_of_at_most_three' panicked at crates/pstore-engine/tests/invariants.rs:85:5:
assertion `left == right` failed
  left: "d127"
 right: "d250"

failures:
    a_cold_search_has_a_sequential_depth_of_at_most_three

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
