*** crates/pstore-format/src/reader.rs:279:41: replace + with * in Segment::scan

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace + with * in Segment::scan
@@ -271,17 +271,17 @@
         let per_row = self.vector_row_len();
         let mut all: Vec<std::ops::Range<u64>> = ranges;
         let block_count = all.len();
         if let (Some(vec_span), true) = (self.section(Section::Vectors), per_row > 0) {
             for i in &wanted {
                 let (Some(start), Some(b)) = (base.get(*i), self.blocks.get(*i)) else {
                     continue;
                 };
-                let lo = vec_span.start + (*start * per_row) as u64;
+                let lo = vec_span.start * /* ~ changed by cargo-mutants ~ */ (*start * per_row) as u64;
                 all.push(lo..lo + (b.rows as usize * per_row) as u64);
             }
         }
         // ⚠️ One call, so blocks and vector rows go out TOGETHER. They are different
         // sections of the same object, both spans are known before either is issued, and
         // awaiting one before the other would make every scan a two-hop read for no reason
         // a caller could see. Width is free; depth is not.
         let bufs = store.get_ranges(key, &all).await?;

---- a_cold_read_of_a_large_segment_still_costs_three_rounds stdout ----

thread 'a_cold_read_of_a_large_segment_still_costs_three_rounds' panicked at crates/pstore-engine/tests/depth_at_scale.rs:40:44:
called `Result::unwrap()` on an `Err` value: Format("blob error: range 1126690816..1126692864 outside object of 1196488 bytes")

---- bounding_the_index_does_not_just_move_the_cost_into_bytes stdout ----

thread 'bounding_the_index_does_not_just_move_the_cost_into_bytes' panicked at crates/pstore-engine/tests/depth_at_scale.rs:89:41:
called `Result::unwrap()` on an `Err` value: Format("blob error: range 1126690816..1126692864 outside object of 1196488 bytes")

failures:
    a_cold_read_of_a_large_segment_still_costs_three_rounds
    bounding_the_index_does_not_just_move_the_cost_into_bytes

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
