*** crates/pstore-format/src/reader.rs:280:33: replace + with * in Segment::scan

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace + with * in Segment::scan
@@ -272,17 +272,17 @@
         let mut all: Vec<std::ops::Range<u64>> = ranges;
         let block_count = all.len();
         if let (Some(vec_span), true) = (self.section(Section::Vectors), per_row > 0) {
             for i in &wanted {
                 let (Some(start), Some(b)) = (base.get(*i), self.blocks.get(*i)) else {
                     continue;
                 };
                 let lo = vec_span.start + (*start * per_row) as u64;
-                all.push(lo..lo + (b.rows as usize * per_row) as u64);
+                all.push(lo..lo * /* ~ changed by cargo-mutants ~ */ (b.rows as usize * per_row) as u64);
             }
         }
         // ⚠️ One call, so blocks and vector rows go out TOGETHER. They are different
         // sections of the same object, both spans are known before either is issued, and
         // awaiting one before the other would make every scan a two-hop read for no reason
         // a caller could see. Width is free; depth is not.
         let bufs = store.get_ranges(key, &all).await?;

---- compaction_collapses_the_segments_it_merged stdout ----

thread 'compaction_collapses_the_segments_it_merged' panicked at crates/pstore-engine/tests/compaction.rs:87:28:
called `Result::unwrap()` on an `Err` value: Format("blob error: range 0..224 outside object of 136 bytes")

---- a_losing_compactors_output_is_unreferenced stdout ----

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/compaction.rs:187:18:
called `Result::unwrap()` on an `Err` value: Format("blob error: range 0..224 outside object of 136 bytes")

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/compaction.rs:187:18:
called `Result::unwrap()` on an `Err` value: Format("blob error: range 0..224 outside object of 136 bytes")

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/compaction.rs:187:18:
called `Result::unwrap()` on an `Err` value: Format("blob error: range 0..224 outside object of 136 bytes")

thread 'tokio-rt-worker' panicked at crates/pstore-engine/tests/compaction.rs:187:18:
called `Result::unwrap()` on an `Err` value: Format("blob error: range 0..224 outside object of 136 bytes")

---- compaction_does_not_change_the_answer stdout ----

thread 'compaction_does_not_change_the_answer' panicked at crates/pstore-engine/tests/compaction.rs:56:10:
called `Result::unwrap()` on an `Err` value: Format("blob error: range 0..224 outside object of 136 bytes")

failures:
    a_fold_landing_mid_compaction_is_not_swallowed_by_it
    a_losing_compactors_output_is_unreferenced
    compaction_collapses_the_segments_it_merged
    compaction_does_not_change_the_answer
    concurrent_compactors_produce_one_winner

test result: FAILED. 1 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.01s

*** result: Failure(101)
