*** crates/pstore-format/src/reader.rs:293:45: replace + with - in Segment::scan

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace + with - in Segment::scan
@@ -285,17 +285,17 @@
         // awaiting one before the other would make every scan a two-hop read for no reason
         // a caller could see. Width is free; depth is not.
         let bufs = store.get_ranges(key, &all).await?;
 
         let mut out = Vec::new();
         for (n, _) in wanted.iter().enumerate() {
             let Some(buf) = bufs.get(n) else { continue };
             let rows = Self::decode_block(buf)?;
-            let vecs = bufs.get(block_count + n);
+            let vecs = bufs.get(block_count - /* ~ changed by cargo-mutants ~ */ n);
             for (r, mut doc) in rows.into_iter().enumerate() {
                 if let Some(raw) = vecs.and_then(|v| v.get(r * per_row..(r + 1) * per_row)) {
                     doc.vector = raw
                         .chunks_exact(4)
                         .map(|b| f32::from_le_bytes(b.try_into().unwrap_or([0; 4])))
                         .collect();
                 }
                 if filter.is_none_or(|f| f.matches(&doc)) {

---- a_cold_search_has_a_sequential_depth_of_at_most_three stdout ----

thread 'a_cold_search_has_a_sequential_depth_of_at_most_three' panicked at crates/pstore-engine/tests/invariants.rs:85:5:
assertion `left == right` failed
  left: "d63"
 right: "d250"

failures:
    a_cold_search_has_a_sequential_depth_of_at_most_three

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
