*** crates/pstore-format/src/reader.rs:295:62: replace * with / in Segment::scan

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace * with / in Segment::scan
@@ -287,17 +287,17 @@
         let bufs = store.get_ranges(key, &all).await?;
 
         let mut out = Vec::new();
         for (n, _) in wanted.iter().enumerate() {
             let Some(buf) = bufs.get(n) else { continue };
             let rows = Self::decode_block(buf)?;
             let vecs = bufs.get(block_count + n);
             for (r, mut doc) in rows.into_iter().enumerate() {
-                if let Some(raw) = vecs.and_then(|v| v.get(r * per_row..(r + 1) * per_row)) {
+                if let Some(raw) = vecs.and_then(|v| v.get(r / /* ~ changed by cargo-mutants ~ */ per_row..(r + 1) * per_row)) {
                     doc.vector = raw
                         .chunks_exact(4)
                         .map(|b| f32::from_le_bytes(b.try_into().unwrap_or([0; 4])))
                         .collect();
                 }
                 if filter.is_none_or(|f| f.matches(&doc)) {
                     out.push(doc);
                 }

---- a_cold_search_has_a_sequential_depth_of_at_most_three stdout ----

thread 'a_cold_search_has_a_sequential_depth_of_at_most_three' panicked at crates/pstore-engine/tests/invariants.rs:85:5:
assertion `left == right` failed
  left: "d256"
 right: "d250"

failures:
    a_cold_search_has_a_sequential_depth_of_at_most_three

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
