*** crates/pstore-format/src/reader.rs:295:81: replace * with / in Segment::scan

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace * with / in Segment::scan
@@ -287,17 +287,17 @@
         let bufs = store.get_ranges(key, &all).await?;
 
         let mut out = Vec::new();
         for (n, _) in wanted.iter().enumerate() {
             let Some(buf) = bufs.get(n) else { continue };
             let rows = Self::decode_block(buf)?;
             let vecs = bufs.get(block_count + n);
             for (r, mut doc) in rows.into_iter().enumerate() {
-                if let Some(raw) = vecs.and_then(|v| v.get(r * per_row..(r + 1) * per_row)) {
+                if let Some(raw) = vecs.and_then(|v| v.get(r * per_row..(r + 1) / /* ~ changed by cargo-mutants ~ */ per_row)) {
                     doc.vector = raw
                         .chunks_exact(4)
                         .map(|b| f32::from_le_bytes(b.try_into().unwrap_or([0; 4])))
                         .collect();
                 }
                 if filter.is_none_or(|f| f.matches(&doc)) {
                     out.push(doc);
                 }

---- search_and_filter_work_across_the_memtable_and_segments stdout ----

thread 'search_and_filter_work_across_the_memtable_and_segments' panicked at crates/pstore-engine/tests/engine.rs:318:5:
assertion `left == right` failed: nearest must be found wherever it lives
  left: "d0"
 right: "d25"

failures:
    search_and_filter_work_across_the_memtable_and_segments

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
