*** crates/pstore-format/src/reader.rs:33:22: replace != with == in Segment::open

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace != with == in Segment::open
@@ -25,17 +25,17 @@
         let tail = store.get_suffix(key, SUFFIX_FETCH).await?;
 
         let foot_at = tail
             .len()
             .checked_sub(FOOTER_LEN)
             .ok_or(FormatError::Truncated)?;
         let foot = tail.get(foot_at..).ok_or(FormatError::Truncated)?;
         let mut d = Dec::new(foot);
-        if d.raw(8)? != MAGIC {
+        if d.raw(8)? == /* ~ changed by cargo-mutants ~ */ MAGIC {
             return Err(FormatError::Corrupt("bad magic"));
         }
         let version = d.u16()?;
         if version != VERSION {
             return Err(FormatError::UnsupportedVersion(version));
         }
         let index_offset = d.u64()?;
         let index_len = d.u32()?;

---- a_future_version_is_refused_rather_than_guessed_at stdout ----

thread 'a_future_version_is_refused_rather_than_guessed_at' panicked at crates/pstore-format/tests/corrupt.rs:53:5:
assertion failed: matches!(open_bytes(b).await.unwrap_err(), FormatError::UnsupportedVersion(_))

failures:
    a_future_version_is_refused_rather_than_guessed_at

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
