*** crates/pstore-format/src/reader.rs:356:9: replace Segment::decode_block -> Result<Vec<Document>, FormatError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace Segment::decode_block -> Result<Vec<Document>, FormatError> with Ok(vec![])
@@ -348,11 +348,11 @@
         // on id so the result is reproducible, which is what lets a reference test exist.
         scored.sort_by(|a, b| a.1.total_cmp(&b.1).then_with(|| a.0.cmp(&b.0)));
         scored.truncate(k);
         Ok(scored)
     }
 
     /// Decodes one block's rows. Vectors arrive separately, from their own section.
     fn decode_block(buf: &[u8]) -> Result<Vec<Document>, FormatError> {
-        crate::decode_rows(buf)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:135:5:
rows before the hole must still be folded

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
