*** crates/pstore-format/src/reader.rs:37:20: replace != with == in Segment::open

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace != with == in Segment::open
@@ -29,17 +29,17 @@
             .checked_sub(FOOTER_LEN)
             .ok_or(FormatError::Truncated)?;
         let foot = tail.get(foot_at..).ok_or(FormatError::Truncated)?;
         let mut d = Dec::new(foot);
         if d.raw(8)? != MAGIC {
             return Err(FormatError::Corrupt("bad magic"));
         }
         let version = d.u16()?;
-        if version != VERSION {
+        if version == /* ~ changed by cargo-mutants ~ */ VERSION {
             return Err(FormatError::UnsupportedVersion(version));
         }
         let index_offset = d.u64()?;
         let index_len = d.u32()?;
         let rows = d.u32()?;
         let sum = d.u64()?;
         // The trailing magic is what distinguishes a real footer from bytes that happen to
         // decode: a tampered length field almost never leaves both copies intact.

---- a_future_version_is_refused_rather_than_guessed_at stdout ----

thread 'a_future_version_is_refused_rather_than_guessed_at' panicked at crates/pstore-format/tests/corrupt.rs:54:29:
called `Result::unwrap_err()` on an `Ok` value: Segment { blocks: [BlockMeta { offset: 0, len: 132, rows: 4, zones: {"n": (0, 3)} }, BlockMeta { offset: 132, len: 132, rows: 4, zones: {"n": (4, 7)} }], rows: 8 }

---- a_tampered_index_section_is_caught_by_the_checksum stdout ----

thread 'a_tampered_index_section_is_caught_by_the_checksum' panicked at crates/pstore-format/tests/corrupt.rs:65:5:
assertion failed: matches!(open_bytes(b).await.unwrap_err(), FormatError::ChecksumMismatch |
    FormatError::Truncated | FormatError::Corrupt(_))

failures:
    a_future_version_is_refused_rather_than_guessed_at
    a_tampered_index_section_is_caught_by_the_checksum

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
