*** crates/pstore-format/src/reader.rs:46:22: replace != with == in Segment::open

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace != with == in Segment::open
@@ -38,17 +38,17 @@
             return Err(FormatError::UnsupportedVersion(version));
         }
         let index_offset = d.u64()?;
         let index_len = d.u32()?;
         let rows = d.u32()?;
         let sum = d.u64()?;
         // The trailing magic is what distinguishes a real footer from bytes that happen to
         // decode: a tampered length field almost never leaves both copies intact.
-        if d.raw(8)? != MAGIC {
+        if d.raw(8)? == /* ~ changed by cargo-mutants ~ */ MAGIC {
             return Err(FormatError::Corrupt("bad trailing magic"));
         }
 
         // Where in the object the bytes we hold begin. Derived from the footer's own
         // offsets rather than from a separately-fetched length.
         let seg_len = index_offset + u64::from(index_len) + FOOTER_LEN as u64;
         let tail_start = seg_len.saturating_sub(tail.len() as u64);
         let idx_bytes = {

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:134:41:
called `Result::unwrap()` on an `Err` value: Format("segment corrupt: bad trailing magic")

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
