*** crates/pstore-format/src/reader.rs:52:59: replace + with * in Segment::open

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace + with * in Segment::open
@@ -44,17 +44,17 @@
         // The trailing magic is what distinguishes a real footer from bytes that happen to
         // decode: a tampered length field almost never leaves both copies intact.
         if d.raw(8)? != MAGIC {
             return Err(FormatError::Corrupt("bad trailing magic"));
         }
 
         // Where in the object the bytes we hold begin. Derived from the footer's own
         // offsets rather than from a separately-fetched length.
-        let seg_len = index_offset + u64::from(index_len) + FOOTER_LEN as u64;
+        let seg_len = index_offset + u64::from(index_len) * /* ~ changed by cargo-mutants ~ */ FOOTER_LEN as u64;
         let tail_start = seg_len.saturating_sub(tail.len() as u64);
         let idx_bytes = {
             if index_offset >= tail_start {
                 let lo = (index_offset - tail_start) as usize;
                 let hi = lo
                     .checked_add(index_len as usize)
                     .ok_or(FormatError::Truncated)?;
                 Bytes::copy_from_slice(tail.get(lo..hi).ok_or(FormatError::Truncated)?)

---- a_small_segment_opens_in_one_read stdout ----

thread 'a_small_segment_opens_in_one_read' panicked at crates/pstore-format/tests/segment.rs:96:5:
assertion `left == right` failed
  left: 2
 right: 1

failures:
    a_small_segment_opens_in_one_read

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
