*** crates/pstore-format/src/reader.rs:56:40: replace - with + in Segment::open

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace - with + in Segment::open
@@ -48,17 +48,17 @@
         }
 
         // Where in the object the bytes we hold begin. Derived from the footer's own
         // offsets rather than from a separately-fetched length.
         let seg_len = index_offset + u64::from(index_len) + FOOTER_LEN as u64;
         let tail_start = seg_len.saturating_sub(tail.len() as u64);
         let idx_bytes = {
             if index_offset >= tail_start {
-                let lo = (index_offset - tail_start) as usize;
+                let lo = (index_offset + /* ~ changed by cargo-mutants ~ */ tail_start) as usize;
                 let hi = lo
                     .checked_add(index_len as usize)
                     .ok_or(FormatError::Truncated)?;
                 Bytes::copy_from_slice(tail.get(lo..hi).ok_or(FormatError::Truncated)?)
             } else {
                 // Only now, and only for a segment whose index section is large.
                 store
                     .get_range(key, index_offset..index_offset + u64::from(index_len))

---- exact_search_matches_a_brute_force_reference stdout ----

thread 'exact_search_matches_a_brute_force_reference' panicked at crates/pstore-format/tests/search.rs:134:45:
called `Result::unwrap()` on an `Err` value: Truncated

---- pruning_does_not_change_the_answer stdout ----

thread 'pruning_does_not_change_the_answer' panicked at crates/pstore-format/tests/search.rs:63:45:
called `Result::unwrap()` on an `Err` value: Truncated

---- zone_maps_skip_blocks_that_cannot_match stdout ----

thread 'zone_maps_skip_blocks_that_cannot_match' panicked at crates/pstore-format/tests/search.rs:37:45:
called `Result::unwrap()` on an `Err` value: Truncated

failures:
    exact_search_matches_a_brute_force_reference
    pruning_does_not_change_the_answer
    search_respects_a_filter
    zone_maps_skip_blocks_that_cannot_match

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
