*** crates/pstore-format/src/reader.rs:64:64: replace + with - in Segment::open

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace + with - in Segment::open
@@ -56,17 +56,17 @@
                 let lo = (index_offset - tail_start) as usize;
                 let hi = lo
                     .checked_add(index_len as usize)
                     .ok_or(FormatError::Truncated)?;
                 Bytes::copy_from_slice(tail.get(lo..hi).ok_or(FormatError::Truncated)?)
             } else {
                 // Only now, and only for a segment whose index section is large.
                 store
-                    .get_range(key, index_offset..index_offset + u64::from(index_len))
+                    .get_range(key, index_offset..index_offset - /* ~ changed by cargo-mutants ~ */ u64::from(index_len))
                     .await?
             }
         };
         if checksum(&idx_bytes) != sum {
             return Err(FormatError::ChecksumMismatch);
         }
 
         Ok(Self {

---- a_segment_whose_index_section_overflows_the_suffix_takes_two_reads stdout ----

thread 'a_segment_whose_index_section_overflows_the_suffix_takes_two_reads' panicked at crates/pstore-format/tests/segment.rs:142:45:
called `Result::unwrap()` on an `Err` value: Blob("range 242890..78886 outside object of 406936 bytes")

failures:
    a_segment_whose_index_section_overflows_the_suffix_takes_two_reads

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
