*** crates/pstore-format/src/reader.rs:68:62: replace + with * in Segment::open

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace + with * in Segment::open
@@ -60,17 +60,17 @@
                 let lo = (meta_offset - tail_start) as usize;
                 let hi = lo
                     .checked_add(meta_len as usize)
                     .ok_or(FormatError::Truncated)?;
                 Bytes::copy_from_slice(tail.get(lo..hi).ok_or(FormatError::Truncated)?)
             } else {
                 // Only now, and only for a segment whose meta region is large.
                 store
-                    .get_range(key, meta_offset..meta_offset + u64::from(meta_len))
+                    .get_range(key, meta_offset..meta_offset * /* ~ changed by cargo-mutants ~ */ u64::from(meta_len))
                     .await?
             }
         };
         if checksum(&idx_bytes) != sum {
             return Err(FormatError::ChecksumMismatch);
         }
 
         // The meta region is the directory followed by the block index. Parsing the

---- a_segment_whose_index_section_overflows_the_suffix_takes_two_reads stdout ----

thread 'a_segment_whose_index_section_overflows_the_suffix_takes_two_reads' panicked at crates/pstore-format/tests/segment.rs:153:45:
called `Result::unwrap()` on an `Err` value: Blob("range 226890..37219943160 outside object of 390976 bytes")

failures:
    a_segment_whose_index_section_overflows_the_suffix_takes_two_reads

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
