*** crates/pstore-format/src/writer.rs:104:9: replace SegmentWriter::push with ()

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ replace SegmentWriter::push with ()
@@ -96,17 +96,17 @@
         self
     }
 
     /// Adds a document.
     ///
     /// Buffered rather than sealed on the spot: the block size cannot be chosen until the
     /// row count is known, and choosing it eagerly is what made the index section unbounded.
     pub fn push(&mut self, doc: Document) {
-        self.docs.push(doc);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn seal(&mut self, rows: &[Document]) {
         if rows.is_empty() {
             return;
         }
         let offset = self.body.len() as u64;
         let mut zones: BTreeMap<String, (i64, i64)> = BTreeMap::new();

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:135:5:
rows before the hole must still be folded

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
