*** crates/pstore-format/src/writer.rs:133:19: replace += with -= in SegmentWriter::seal

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ replace += with -= in SegmentWriter::seal
@@ -125,17 +125,17 @@
         let len = blk.len() as u32;
         self.body.raw(&blk);
         self.blocks.push(BlockMeta {
             offset,
             len,
             rows: rows.len() as u32,
             zones,
         });
-        self.rows += rows.len() as u32;
+        self.rows -= /* ~ changed by cargo-mutants ~ */ rows.len() as u32;
     }
 
     /// Encodes the index section for the blocks sealed so far.
     fn encode_index(&self) -> Enc {
         let mut idx = Enc::default();
         idx.u32(self.blocks.len() as u32);
         for b in &self.blocks {
             idx.u64(b.offset);

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-format/src/writer.rs:133:9:
attempt to subtract with overflow

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
