*** crates/pstore-format/src/writer.rs:169:68: replace <= with > in SegmentWriter::finish

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ replace <= with > in SegmentWriter::finish
@@ -161,17 +161,17 @@
         let idx = loop {
             self.blocks.clear();
             self.body = Enc::default();
             self.rows = 0;
             for chunk in docs.chunks(self.rows_per_block) {
                 self.seal(chunk);
             }
             let idx = self.encode_index();
-            if idx.len() <= self.index_budget || self.blocks.len() <= 1 {
+            if idx.len() <= self.index_budget || self.blocks.len() > /* ~ changed by cargo-mutants ~ */ 1 {
                 break idx;
             }
             self.rows_per_block = self.rows_per_block.saturating_mul(2);
         };
 
         // Vectors leave the data blocks entirely and become their own section: row-major,
         // fixed width, so row `i` is a computable byte range and a reader can fetch one row
         // or none without touching the rest.

---- the_block_index_stays_inside_the_suffix_read_at_any_size stdout ----

thread 'the_block_index_stays_inside_the_suffix_read_at_any_size' panicked at crates/pstore-engine/tests/depth_at_scale.rs:62:9:
60000 rows produced a 18804-byte index section, over the 8150-byte budget: the segment now opens in two round trips

---- a_cold_read_of_a_large_segment_still_costs_three_rounds stdout ----

thread 'a_cold_read_of_a_large_segment_still_costs_three_rounds' panicked at crates/pstore-engine/tests/depth_at_scale.rs:42:5:
a 40,000-row segment took 4 sequential round trips

failures:
    a_cold_read_of_a_large_segment_still_costs_three_rounds
    the_block_index_stays_inside_the_suffix_read_at_any_size

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
