*** crates/pstore-format/src/writer.rs:196:12: delete ! in SegmentWriter::finish

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ delete ! in SegmentWriter::finish
@@ -188,17 +188,17 @@
                     v.extend_from_slice(&d.vector.get(j).copied().unwrap_or(0.0).to_le_bytes());
                 }
             }
             v
         };
 
         let mut out = self.body;
         let mut dir: Vec<(Section, u64, u64)> = Vec::new();
-        if !vectors.is_empty() {
+        if  /* ~ changed by cargo-mutants ~ */vectors.is_empty() {
             dir.push((Section::Vectors, out.len() as u64, vectors.len() as u64));
             out.raw(&vectors);
         }
         let mut raw_dir: Vec<(u16, u64, u64)> = Vec::new();
         for (section, bytes) in &self.extra {
             if bytes.is_empty() {
                 continue;
             }

---- search_and_filter_work_across_the_memtable_and_segments stdout ----

thread 'search_and_filter_work_across_the_memtable_and_segments' panicked at crates/pstore-engine/tests/engine.rs:318:5:
assertion `left == right` failed: nearest must be found wherever it lives
  left: "d0"
 right: "d25"

failures:
    search_and_filter_work_across_the_memtable_and_segments

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
