*** crates/pstore-format/src/writer.rs:226:29: replace + with - in SegmentWriter::finish

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ replace + with - in SegmentWriter::finish
@@ -218,17 +218,17 @@
         // for any segment the writer produced, this whole region.
         let meta_offset = out.len() as u64;
         dir.push((
             Section::Blocks,
             0, // patched below, once the directory's own length is known
             idx.len() as u64,
         ));
         let mut meta = Enc::default();
-        meta.u32((dir.len() + raw_dir.len()) as u32);
+        meta.u32((dir.len() - /* ~ changed by cargo-mutants ~ */ raw_dir.len()) as u32);
         for (section, offset, len) in &dir {
             meta.u16(*section as u16);
             meta.u64(*offset);
             meta.u64(*len);
         }
         for (id, offset, len) in &raw_dir {
             meta.u16(*id);
             meta.u64(*offset);

---- a_segment_from_the_future_is_readable_not_refused stdout ----

thread 'a_segment_from_the_future_is_readable_not_refused' panicked at crates/pstore-format/tests/sections.rs:210:45:
called `Result::unwrap()` on an `Err` value: Corrupt("no block section")

failures:
    a_segment_from_the_future_is_readable_not_refused

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
