*** crates/pstore-format/src/writer.rs:226:29: replace + with * in SegmentWriter::finish

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ replace + with * in SegmentWriter::finish
@@ -218,17 +218,17 @@
         // for any segment the writer produced, this whole region.
         let meta_offset = out.len() as u64;
         dir.push((
             Section::Blocks,
             0, // patched below, once the directory's own length is known
             idx.len() as u64,
         ));
         let mut meta = Enc::default();
-        meta.u32((dir.len() + raw_dir.len()) as u32);
+        meta.u32((dir.len() * /* ~ changed by cargo-mutants ~ */ raw_dir.len()) as u32);
         for (section, offset, len) in &dir {
             meta.u16(*section as u16);
             meta.u64(*offset);
             meta.u64(*len);
         }
         for (id, offset, len) in &raw_dir {
             meta.u16(*id);
             meta.u64(*offset);

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:134:41:
called `Result::unwrap()` on an `Err` value: Format("segment corrupt: no block section")

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
