*** crates/pstore-format/src/writer.rs:37:9: replace SegmentWriter::push with ()

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ replace SegmentWriter::push with ()
@@ -29,20 +29,17 @@
             blocks: Vec::new(),
             body: Enc::default(),
             rows: 0,
         }
     }
 
     /// Adds a document, sealing a block when it fills.
     pub fn push(&mut self, doc: Document) {
-        self.pending.push(doc);
-        if self.pending.len() >= self.rows_per_block {
-            self.seal();
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn seal(&mut self) {
         if self.pending.is_empty() {
             return;
         }
         let offset = self.body.len() as u64;
         let mut zones: BTreeMap<String, (i64, i64)> = BTreeMap::new();

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:135:5:
rows before the hole must still be folded

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
