*** crates/pstore-format/src/writer.rs:42:62: replace - with +

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ replace - with +
@@ -34,17 +34,17 @@
     body: Enc,
     rows: u32,
 }
 
 /// Bytes the index section may occupy, so it arrives with the footer.
 ///
 /// The suffix read carries the footer too, so the index gets what is left. A segment whose
 /// index exceeds this opens in two round trips instead of one.
-pub const INDEX_BUDGET: usize = crate::SUFFIX_FETCH as usize - FOOTER_LEN;
+pub const INDEX_BUDGET: usize = crate::SUFFIX_FETCH as usize + /* ~ changed by cargo-mutants ~ */ FOOTER_LEN;
 
 impl SegmentWriter {
     /// A writer that seals a block every `rows_per_block` documents.
     ///
     /// Block size is the one tunable that most directly trades request count against
     /// bytes: too small and a scan issues many ranged reads, too large and a filtered scan
     /// drags in rows it will discard.
     #[must_use]

*** result: Success
