*** crates/pstore-format/src/writer.rs:42:62: replace - with /

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ replace - with /
@@ -34,17 +34,17 @@
     body: Enc,
     rows: u32,
 }
 
 /// Bytes the index section may occupy, so it arrives with the footer.
 ///
 /// The suffix read carries the footer too, so the index gets what is left. A segment whose
 /// index exceeds this opens in two round trips instead of one.
-pub const INDEX_BUDGET: usize = crate::SUFFIX_FETCH as usize - FOOTER_LEN;
+pub const INDEX_BUDGET: usize = crate::SUFFIX_FETCH as usize / /* ~ changed by cargo-mutants ~ */ FOOTER_LEN;
 
 impl SegmentWriter {
     /// A writer that seals a block every `rows_per_block` documents.
     ///
     /// Block size is the one tunable that most directly trades request count against
     /// bytes: too small and a scan issues many ranged reads, too large and a filtered scan
     /// drags in rows it will discard.
     #[must_use]

---- the_block_index_stays_inside_the_suffix_read_at_any_size stdout ----

thread 'the_block_index_stays_inside_the_suffix_read_at_any_size' panicked at crates/pstore-engine/tests/depth_at_scale.rs:62:9:
60000 rows produced a 204-byte index section, over the 195-byte budget: the segment now opens in two round trips

failures:
    the_block_index_stays_inside_the_suffix_read_at_any_size

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.16s

*** result: Failure(101)
