*** crates/pstore-format/src/writer.rs:85:19: replace += with -= in SegmentWriter::seal

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ replace += with -= in SegmentWriter::seal
@@ -77,17 +77,17 @@
         let len = blk.len() as u32;
         self.body.raw(&blk.0);
         self.blocks.push(BlockMeta {
             offset,
             len,
             rows: self.pending.len() as u32,
             zones,
         });
-        self.rows += self.pending.len() as u32;
+        self.rows -= /* ~ changed by cargo-mutants ~ */ self.pending.len() as u32;
         self.pending.clear();
     }
 
     /// Seals the last block and emits the segment.
     #[must_use]
     pub fn finish(mut self) -> Bytes {
         self.seal();

---- a_scan_of_a_segment_whose_blocks_are_gone_is_an_error stdout ----

thread 'a_scan_of_a_segment_whose_blocks_are_gone_is_an_error' panicked at crates/pstore-format/src/writer.rs:85:9:
attempt to subtract with overflow

---- a_future_version_is_refused_rather_than_guessed_at stdout ----

thread 'a_future_version_is_refused_rather_than_guessed_at' panicked at crates/pstore-format/src/writer.rs:85:9:
attempt to subtract with overflow

---- a_segment_with_an_impossible_block_count_is_refused stdout ----

thread 'a_segment_with_an_impossible_block_count_is_refused' panicked at crates/pstore-format/src/writer.rs:85:9:
attempt to subtract with overflow

failures:
    a_future_version_is_refused_rather_than_guessed_at
    a_scan_of_a_segment_whose_blocks_are_gone_is_an_error
    a_segment_with_an_impossible_block_count_is_refused
    a_tampered_index_section_is_caught_by_the_checksum
    a_truncated_segment_is_an_error
    an_unknown_value_tag_is_an_error

test result: FAILED. 4 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
