*** crates/pstore-format/src/writer.rs:92:9: replace SegmentWriter::finish -> Bytes with Default::default()

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ replace SegmentWriter::finish -> Bytes with Default::default()
@@ -84,46 +84,11 @@
         });
         self.rows += self.pending.len() as u32;
         self.pending.clear();
     }
 
     /// Seals the last block and emits the segment.
     #[must_use]
     pub fn finish(mut self) -> Bytes {
-        self.seal();
-
-        let mut idx = Enc::default();
-        idx.u32(self.blocks.len() as u32);
-        for b in &self.blocks {
-            idx.u64(b.offset);
-            idx.u32(b.len);
-            idx.u32(b.rows);
-            idx.u32(b.zones.len() as u32);
-            for (k, (lo, hi)) in &b.zones {
-                idx.bytes(k.as_bytes());
-                idx.i64(*lo);
-                idx.i64(*hi);
-            }
-        }
-
-        let index_offset = self.body.len() as u64;
-        let index_len = idx.len() as u32;
-        let sum = checksum(&idx.0);
-
-        let mut out = self.body;
-        out.raw(&idx.0);
-        // The footer is last and fixed-width, so `Range: -N` finds it without knowing the
-        // object's length -- which is what makes an open possible from the key alone.
-        out.raw(MAGIC);
-        out.u16(VERSION);
-        out.u64(index_offset);
-        out.u32(index_len);
-        out.u32(self.rows);
-        out.u64(sum);
-        out.raw(MAGIC);
-        debug_assert_eq!(
-            out.len() as u64 - index_offset - u64::from(index_len),
-            FOOTER_LEN as u64
-        );
-        Bytes::from(out.0)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }

---- a_truncated_segment_is_an_error stdout ----

thread 'a_truncated_segment_is_an_error' panicked at crates/pstore-format/tests/corrupt.rs:36:46:
attempt to subtract with overflow

---- an_unknown_value_tag_is_an_error stdout ----

thread 'an_unknown_value_tag_is_an_error' panicked at crates/pstore-format/tests/corrupt.rs:85:6:
index out of bounds: the len is 0 but the index is 0

---- a_future_version_is_refused_rather_than_guessed_at stdout ----

thread 'a_future_version_is_refused_rather_than_guessed_at' panicked at crates/pstore-format/tests/corrupt.rs:51:13:
attempt to subtract with overflow

failures:
    a_future_version_is_refused_rather_than_guessed_at
    a_segment_with_an_impossible_block_count_is_refused
    a_tampered_index_section_is_caught_by_the_checksum
    a_truncated_segment_is_an_error
    an_unknown_value_tag_is_an_error

test result: FAILED. 5 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
