*** crates/pstore-index/src/cluster.rs:108:9: replace Clustering::centroids -> &[Vec<f32>] with Vec::leak(Vec::new())

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace Clustering::centroids -> &[Vec<f32>] with Vec::leak(Vec::new())
@@ -100,17 +100,17 @@
     centroids: Vec<Vec<f32>>,
     lists: Vec<Vec<usize>>,
 }
 
 impl Clustering {
     /// The centroid of each posting list.
     #[must_use]
     pub fn centroids(&self) -> &[Vec<f32>] {
-        &self.centroids
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// The rows in each posting list, ascending.
     #[must_use]
     pub fn lists(&self) -> &[Vec<usize>] {
         &self.lists
     }

---- a_centroid_is_the_mean_of_what_it_holds stdout ----

thread 'a_centroid_is_the_mean_of_what_it_holds' panicked at crates/pstore-index/tests/clustering.rs:177:25:
index out of bounds: the len is 0 but the index is 0

failures:
    a_centroid_is_the_mean_of_what_it_holds

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.32s

*** result: Failure(101)
