*** crates/pstore-index/src/cluster.rs:114:9: replace Clustering::lists -> &[Vec<usize>] with Vec::leak(vec![vec![1]])

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace Clustering::lists -> &[Vec<usize>] with Vec::leak(vec![vec![1]])
@@ -106,17 +106,17 @@
     #[must_use]
     pub fn centroids(&self) -> &[Vec<f32>] {
         &self.centroids
     }
 
     /// The rows in each posting list, ascending.
     #[must_use]
     pub fn lists(&self) -> &[Vec<usize>] {
-        &self.lists
+        Vec::leak(vec![vec![1]]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Total squared distance from each vector to the centroid it was assigned.
     ///
     /// The k-means objective, and the only way to tell a *balanced* assignment from a
     /// *good* balanced assignment: both satisfy the capacity bound, and one of them puts
     /// vectors in lists they have no business being in.
     #[must_use]

---- an_empty_corpus_is_not_a_panic stdout ----

thread 'an_empty_corpus_is_not_a_panic' panicked at crates/pstore-index/tests/clustering.rs:209:5:
assertion failed: c.lists().is_empty()

---- a_corpus_smaller_than_one_list_makes_a_single_cluster stdout ----

thread 'a_corpus_smaller_than_one_list_makes_a_single_cluster' panicked at crates/pstore-index/tests/clustering.rs:203:5:
assertion `left == right` failed
  left: 1
 right: 50

---- a_centroid_is_the_mean_of_what_it_holds stdout ----

thread 'a_centroid_is_the_mean_of_what_it_holds' panicked at crates/pstore-index/tests/clustering.rs:180:13:
centroid 0 dim 0 is -1.0469081 but its members average -2.8869112

failures:
    a_centroid_is_the_mean_of_what_it_holds
    a_corpus_smaller_than_one_list_makes_a_single_cluster
    an_empty_corpus_is_not_a_panic
    every_vector_is_reachable_from_at_least_one_list
    the_list_count_follows_the_target_size

test result: FAILED. 3 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.27s

*** result: Failure(101)
