*** crates/pstore-index/src/cluster.rs:141:9: replace Clustering::unconstrained_cost -> f64 with 0.0

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace Clustering::unconstrained_cost -> f64 with 0.0
@@ -133,27 +133,17 @@
     }
 
     /// The same objective if every vector went to its nearest centroid, ignoring capacity.
     ///
     /// A lower bound the balanced assignment cannot beat, so the ratio between them is what
     /// balance actually costs.
     #[must_use]
     pub fn unconstrained_cost(&self, corpus: &[Vec<f32>]) -> f64 {
-        corpus
-            .iter()
-            .map(|v| {
-                f64::from(
-                    self.centroids
-                        .iter()
-                        .map(|c| dist2(v, c))
-                        .fold(f32::INFINITY, f32::min),
-                )
-            })
-            .sum()
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// A clustering from parts, for a reader that has centroids but not assignments.
     ///
     /// A searcher holds the centroid table and reads posting lists by byte range; it never
     /// materialises the row lists, so requiring them would force it to fetch what it is
     /// specifically avoiding.
     #[must_use]

---- balance_is_bought_cheaply_not_at_any_price stdout ----

thread 'balance_is_bought_cheaply_not_at_any_price' panicked at crates/pstore-index/tests/clustering.rs:233:5:
balanced assignment costs 94315 against an unconstrained floor of 0 (infx): the capacity bound is being met by putting vectors in lists they have no business being in

failures:
    balance_is_bought_cheaply_not_at_any_price

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.37s

*** result: Failure(101)
