*** crates/pstore-index/src/cluster.rs:190:33: replace / with % in Clustering::build

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace / with % in Clustering::build
@@ -182,17 +182,17 @@
             // that drifts from its members makes probe selection pick the wrong lists, and
             // recall falls for a reason nothing in the search path can explain.
             for (c, list) in centroids.iter_mut().zip(&lists) {
                 if list.is_empty() {
                     continue;
                 }
                 for (d, slot) in c.iter_mut().enumerate() {
                     let sum: f32 = list.iter().filter_map(|r| corpus.get(*r)?.get(d)).sum();
-                    *slot = sum / list.len() as f32;
+                    *slot = sum % /* ~ changed by cargo-mutants ~ */ list.len() as f32;
                 }
             }
         }
 
         // An empty list costs a centroid, a directory entry, and a probe that can never
         // return anything.
         let keep: Vec<usize> = (0..k)
             .filter(|i| lists.get(*i).is_some_and(|l| !l.is_empty()))

---- a_centroid_is_the_mean_of_what_it_holds stdout ----

thread 'a_centroid_is_the_mean_of_what_it_holds' panicked at crates/pstore-index/tests/clustering.rs:180:13:
centroid 0 dim 0 is -70.36218 but its members average -1.0469081

---- the_list_count_follows_the_target_size stdout ----

thread 'the_list_count_follows_the_target_size' panicked at crates/pstore-index/tests/clustering.rs:160:5:
4,000 vectors at a target of 500 gave 2 lists

failures:
    a_centroid_is_the_mean_of_what_it_holds
    the_list_count_follows_the_target_size

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.02s

*** result: Failure(101)
