*** crates/pstore-index/src/cluster.rs:198:55: delete ! in Clustering::build

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ delete ! in Clustering::build
@@ -190,17 +190,17 @@
                     *slot = sum / list.len() as f32;
                 }
             }
         }
 
         // An empty list costs a centroid, a directory entry, and a probe that can never
         // return anything.
         let keep: Vec<usize> = (0..k)
-            .filter(|i| lists.get(*i).is_some_and(|l| !l.is_empty()))
+            .filter(|i| lists.get(*i).is_some_and(|l|  /* ~ changed by cargo-mutants ~ */l.is_empty()))
             .collect();
         let centroids: Vec<Vec<f32>> = keep
             .iter()
             .filter_map(|i| centroids.get(*i).cloned())
             .collect();
         let mut lists: Vec<Vec<usize>> =
             keep.iter().filter_map(|i| lists.get(*i).cloned()).collect();

---- a_corpus_smaller_than_one_list_makes_a_single_cluster stdout ----

thread 'a_corpus_smaller_than_one_list_makes_a_single_cluster' panicked at crates/pstore-index/tests/clustering.rs:202:5:
assertion `left == right` failed
  left: 0
 right: 1

---- every_vector_is_reachable_from_at_least_one_list stdout ----

thread 'every_vector_is_reachable_from_at_least_one_list' panicked at crates/pstore-index/tests/clustering.rs:108:9:
assertion `left == right` failed: uniform: 2000 vectors are in no posting list
  left: 2000
 right: 0

---- the_list_count_follows_the_target_size stdout ----

thread 'the_list_count_follows_the_target_size' panicked at crates/pstore-index/tests/clustering.rs:160:5:
4,000 vectors at a target of 500 gave 0 lists

failures:
    a_corpus_smaller_than_one_list_makes_a_single_cluster
    clustering_stays_balanced_on_skewed_data
    every_vector_is_reachable_from_at_least_one_list
    the_list_count_follows_the_target_size

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.14s

*** result: Failure(101)
