*** crates/pstore-index/src/cluster.rs:215:25: replace / with * in capacity

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace / with * in capacity
@@ -207,17 +207,17 @@
         // ⚠️ Replication happens AFTER empty lists are dropped, so a boundary vector is
         // never replicated into a list that is about to disappear.
         augment(corpus, &centroids, &mut lists, params);
         Self { centroids, lists }
     }
 }
 
 fn capacity(n: usize, k: usize, balance: f32) -> usize {
-    let mean = n as f32 / k as f32;
+    let mean = n as f32 * /* ~ changed by cargo-mutants ~ */ k as f32;
     // ⚠️ Rounded DOWN against the bound, so the cap is inside it rather than on it. A cap
     // computed as exactly `balance * mean` and then rounded up produces lists one element
     // over the bound the tests assert, which reads as an off-by-one in the test rather than
     // in the cap.
     ((mean * balance).floor() as usize).max(1)
 }
 
 /// Squared L2. The root is monotonic in the same order and costs an operation per vector on

---- clustering_stays_balanced_on_skewed_data stdout ----

thread 'clustering_stays_balanced_on_skewed_data' panicked at crates/pstore-index/tests/clustering.rs:136:5:
largest posting list has 3158 vectors against a mean of 536: over the 4x bound, so one probe costs 5.9x its share of the byte budget

---- balance_is_bought_cheaply_not_at_any_price stdout ----

thread 'balance_is_bought_cheaply_not_at_any_price' panicked at crates/pstore-index/tests/clustering.rs:233:5:
balanced assignment costs 53930 against an unconstrained floor of 30372 (1.78x): the capacity bound is being met by putting vectors in lists they have no business being in

failures:
    balance_is_bought_cheaply_not_at_any_price
    clustering_stays_balanced_on_skewed_data

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.12s

*** result: Failure(101)
