*** crates/pstore-index/src/cluster.rs:215:5: replace capacity -> usize with 1

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace capacity -> usize with 1
@@ -207,22 +207,17 @@
         // ⚠️ Replication happens AFTER empty lists are dropped, so a boundary vector is
         // never replicated into a list that is about to disappear.
         augment(corpus, &centroids, &mut lists, params);
         Self { centroids, lists }
     }
 }
 
 fn capacity(n: usize, k: usize, balance: f32) -> usize {
-    let mean = n as f32 / k as f32;
-    // ⚠️ Rounded DOWN against the bound, so the cap is inside it rather than on it. A cap
-    // computed as exactly `balance * mean` and then rounded up produces lists one element
-    // over the bound the tests assert, which reads as an off-by-one in the test rather than
-    // in the cap.
-    ((mean * balance).floor() as usize).max(1)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Squared L2. The root is monotonic in the same order and costs an operation per vector on
 /// a path that runs `n * k` times.
 fn dist2(a: &[f32], b: &[f32]) -> f32 {
     a.iter().zip(b).map(|(x, y)| (x - y) * (x - y)).sum()
 }

---- augmentation_lifts_recall_by_five_points_at_p_two stdout ----

thread 'augmentation_lifts_recall_by_five_points_at_p_two' panicked at crates/pstore-index/tests/recall.rs:89:5:
augmentation moved recall@10 at p=2 from 0.208 to 0.208, under the 5-point floor: it is costing index size and buying nothing

failures:
    augmentation_lifts_recall_by_five_points_at_p_two

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.92s

*** result: Failure(101)
