*** crates/pstore-index/src/cluster.rs:220:12: replace * with / in capacity

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace * with / in capacity
@@ -212,17 +212,17 @@
 }
 
 fn capacity(n: usize, k: usize, balance: f32) -> usize {
     let mean = n as f32 / k as f32;
     // ⚠️ Rounded DOWN against the bound, so the cap is inside it rather than on it. A cap
     // computed as exactly `balance * mean` and then rounded up produces lists one element
     // over the bound the tests assert, which reads as an off-by-one in the test rather than
     // in the cap.
-    ((mean * balance).floor() as usize).max(1)
+    ((mean / /* ~ changed by cargo-mutants ~ */ balance).floor() as usize).max(1)
 }
 
 /// Squared L2. The root is monotonic in the same order and costs an operation per vector on
 /// a path that runs `n * k` times.
 fn dist2(a: &[f32], b: &[f32]) -> f32 {
     a.iter().zip(b).map(|(x, y)| (x - y) * (x - y)).sum()
 }

---- augmentation_lifts_recall_by_five_points_at_p_two stdout ----

thread 'augmentation_lifts_recall_by_five_points_at_p_two' panicked at crates/pstore-index/tests/recall.rs:89:5:
augmentation moved recall@10 at p=2 from 0.320 to 0.320, under the 5-point floor: it is costing index size and buying nothing

failures:
    augmentation_lifts_recall_by_five_points_at_p_two

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.07s

*** result: Failure(101)
