*** crates/pstore-index/src/cluster.rs:226:37: replace - with / in dist2

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace - with / in dist2
@@ -218,17 +218,17 @@
     // over the bound the tests assert, which reads as an off-by-one in the test rather than
     // in the cap.
     ((mean * balance).floor() as usize).max(1)
 }
 
 /// Squared L2. The root is monotonic in the same order and costs an operation per vector on
 /// a path that runs `n * k` times.
 fn dist2(a: &[f32], b: &[f32]) -> f32 {
-    a.iter().zip(b).map(|(x, y)| (x - y) * (x - y)).sum()
+    a.iter().zip(b).map(|(x, y)| (x / /* ~ changed by cargo-mutants ~ */ y) * (x - y)).sum()
 }
 
 /// Initial centroids, spread rather than sampled.
 ///
 /// Farthest-point traversal from a deterministic start: each new centroid is the corpus
 /// point furthest from every centroid so far. No randomness, so two runs over the same
 /// corpus agree exactly — and unlike random sampling it cannot start with two centroids in
 /// the same dense blob, which is what leaves a whole region to one list.

---- balance_is_bought_cheaply_not_at_any_price stdout ----

thread 'balance_is_bought_cheaply_not_at_any_price' panicked at crates/pstore-index/tests/clustering.rs:233:5:
balanced assignment costs 221392 against an unconstrained floor of -2104883 (-0.11x): the capacity bound is being met by putting vectors in lists they have no business being in

failures:
    balance_is_bought_cheaply_not_at_any_price

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.34s

*** result: Failure(101)
