*** crates/pstore-index/src/cluster.rs:236:5: replace seed_centroids -> Vec<Vec<f32>> with vec![]

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace seed_centroids -> Vec<Vec<f32>> with vec![]
@@ -228,38 +228,17 @@
 
 /// Initial centroids, spread rather than sampled.
 ///
 /// Farthest-point traversal from a deterministic start: each new centroid is the corpus
 /// point furthest from every centroid so far. No randomness, so two runs over the same
 /// corpus agree exactly — and unlike random sampling it cannot start with two centroids in
 /// the same dense blob, which is what leaves a whole region to one list.
 fn seed_centroids(corpus: &[Vec<f32>], k: usize, dim: usize) -> Vec<Vec<f32>> {
-    let mut chosen: Vec<Vec<f32>> = Vec::with_capacity(k);
-    chosen.push(corpus.first().cloned().unwrap_or_else(|| vec![0.0; dim]));
-    let mut best: Vec<f32> = corpus
-        .iter()
-        .map(|v| dist2(v, chosen.first().map_or(&[][..], Vec::as_slice)))
-        .collect();
-    while chosen.len() < k {
-        let (far, _) = best
-            .iter()
-            .enumerate()
-            .fold((0usize, f32::NEG_INFINITY), |acc, (i, d)| {
-                if *d > acc.1 { (i, *d) } else { acc }
-            });
-        let Some(next) = corpus.get(far).cloned() else {
-            break;
-        };
-        for (b, v) in best.iter_mut().zip(corpus) {
-            *b = b.min(dist2(v, &next));
-        }
-        chosen.push(next);
-    }
-    chosen
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Replicates boundary vectors into nearby lists.
 ///
 /// ⚠️ **This is where recall at small `p` comes from.** A vector midway between two
 /// centroids belongs, as far as any query is concerned, to both: a query near the boundary
 /// probes one list and the answer is in the other. Assignment has to pick one; replication
 /// undoes the arbitrariness for the vectors where it matters, and only for those.

---- a_corpus_smaller_than_one_list_makes_a_single_cluster stdout ----

thread 'a_corpus_smaller_than_one_list_makes_a_single_cluster' panicked at crates/pstore-index/tests/clustering.rs:202:5:
assertion `left == right` failed
  left: 0
 right: 1

---- the_list_count_follows_the_target_size stdout ----

thread 'the_list_count_follows_the_target_size' panicked at crates/pstore-index/tests/clustering.rs:160:5:
4,000 vectors at a target of 500 gave 0 lists

---- every_vector_is_reachable_from_at_least_one_list stdout ----

thread 'every_vector_is_reachable_from_at_least_one_list' panicked at crates/pstore-index/tests/clustering.rs:108:9:
assertion `left == right` failed: uniform: 2000 vectors are in no posting list
  left: 2000
 right: 0

failures:
    a_corpus_smaller_than_one_list_makes_a_single_cluster
    clustering_stays_balanced_on_skewed_data
    every_vector_is_reachable_from_at_least_one_list
    the_list_count_follows_the_target_size

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
