*** crates/pstore-index/src/cluster.rs:242:24: replace < with > in seed_centroids

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace < with > in seed_centroids
@@ -234,17 +234,17 @@
 /// the same dense blob, which is what leaves a whole region to one list.
 fn seed_centroids(corpus: &[Vec<f32>], k: usize, dim: usize) -> Vec<Vec<f32>> {
     let mut chosen: Vec<Vec<f32>> = Vec::with_capacity(k);
     chosen.push(corpus.first().cloned().unwrap_or_else(|| vec![0.0; dim]));
     let mut best: Vec<f32> = corpus
         .iter()
         .map(|v| dist2(v, chosen.first().map_or(&[][..], Vec::as_slice)))
         .collect();
-    while chosen.len() < k {
+    while chosen.len() > /* ~ changed by cargo-mutants ~ */ k {
         let (far, _) = best
             .iter()
             .enumerate()
             .fold((0usize, f32::NEG_INFINITY), |acc, (i, d)| {
                 if *d > acc.1 { (i, *d) } else { acc }
             });
         let Some(next) = corpus.get(far).cloned() else {
             break;

---- the_list_count_follows_the_target_size stdout ----

thread 'the_list_count_follows_the_target_size' panicked at crates/pstore-index/tests/clustering.rs:160:5:
4,000 vectors at a target of 500 gave 1 lists

failures:
    the_list_count_follows_the_target_size

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.24s

*** result: Failure(101)
