*** crates/pstore-index/src/cluster.rs:247:23: replace > with >= in seed_centroids

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace > with >= in seed_centroids
@@ -239,17 +239,17 @@
         .iter()
         .map(|v| dist2(v, chosen.first().map_or(&[][..], Vec::as_slice)))
         .collect();
     while chosen.len() < k {
         let (far, _) = best
             .iter()
             .enumerate()
             .fold((0usize, f32::NEG_INFINITY), |acc, (i, d)| {
-                if *d > acc.1 { (i, *d) } else { acc }
+                if *d >= /* ~ changed by cargo-mutants ~ */ acc.1 { (i, *d) } else { acc }
             });
         let Some(next) = corpus.get(far).cloned() else {
             break;
         };
         for (b, v) in best.iter_mut().zip(corpus) {
             *b = b.min(dist2(v, &next));
         }
         chosen.push(next);

*** result: Success
