*** crates/pstore-index/src/cluster.rs:290:36: replace * with / in augment

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace * with / in augment
@@ -282,17 +282,17 @@
             .collect();
         d.sort_by(|a, b| a.1.total_cmp(&b.1).then_with(|| a.0.cmp(&b.0)));
         let Some((_, nearest)) = d.first().copied() else {
             continue;
         };
         // Compared in true distance, not squared: `boundary` is a fraction of a distance,
         // and applying it to a squared value would make the threshold quietly
         // dimension-dependent.
-        let limit = nearest.sqrt() * (1.0 + params.boundary);
+        let limit = nearest.sqrt() / /* ~ changed by cargo-mutants ~ */ (1.0 + params.boundary);
         for (c, dd) in d.iter().skip(1).take(params.replicas) {
             if dd.sqrt() <= limit
                 && let Some(slot) = extra.get_mut(*c)
             {
                 slot.push((row, *dd));
             }
         }
     }

---- augmentation_lifts_recall_by_five_points_at_p_two stdout ----

thread 'augmentation_lifts_recall_by_five_points_at_p_two' panicked at crates/pstore-index/tests/recall.rs:89:5:
augmentation moved recall@10 at p=2 from 0.830 to 0.830, under the 5-point floor: it is costing index size and buying nothing

failures:
    augmentation_lifts_recall_by_five_points_at_p_two

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.59s

*** result: Failure(101)
