*** crates/pstore-index/src/cluster.rs:292:26: replace <= with > in augment

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace <= with > in augment
@@ -284,17 +284,17 @@
         let Some((_, nearest)) = d.first().copied() else {
             continue;
         };
         // Compared in true distance, not squared: `boundary` is a fraction of a distance,
         // and applying it to a squared value would make the threshold quietly
         // dimension-dependent.
         let limit = nearest.sqrt() * (1.0 + params.boundary);
         for (c, dd) in d.iter().skip(1).take(params.replicas) {
-            if dd.sqrt() <= limit
+            if dd.sqrt() > /* ~ changed by cargo-mutants ~ */ limit
                 && let Some(slot) = extra.get_mut(*c)
             {
                 slot.push((row, *dd));
             }
         }
     }
 
     // ⚠️ Pass two enforces the SAME balance bound on the augmented lists. Replication that

---- balance_is_bought_cheaply_not_at_any_price stdout ----

thread 'balance_is_bought_cheaply_not_at_any_price' panicked at crates/pstore-index/tests/clustering.rs:233:5:
balanced assignment costs 547640 against an unconstrained floor of 70881 (7.73x): the capacity bound is being met by putting vectors in lists they have no business being in

failures:
    balance_is_bought_cheaply_not_at_any_price

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.20s

*** result: Failure(101)
