*** crates/pstore-index/src/ladder.rs:58:9: replace Ladder::top -> Vec<(usize, f32)> with vec![(0, 0.0)]

*** mutation diff:
--- crates/pstore-index/src/ladder.rs
+++ replace Ladder::top -> Vec<(usize, f32)> with vec![(0, 0.0)]
@@ -50,19 +50,17 @@
             Rung::Int8 => self.k * 2,
             Rung::Exact => self.k,
         }
     }
 
     fn top(&self, mut scored: Vec<(usize, f32)>, keep: usize) -> Vec<(usize, f32)> {
         // Descending by score; ties broken by id so a result set is reproducible, which is
         // what lets a recall number be compared across runs at all.
-        scored.sort_by(|a, b| b.1.total_cmp(&a.1).then_with(|| a.0.cmp(&b.0)));
-        scored.truncate(keep);
-        scored
+        vec![(0, 0.0)] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Scores every candidate at 1-bit precision and keeps the oversampled top.
     pub fn rung0<I: IntoIterator<Item = (usize, f32)>>(&self, scored: I) -> Vec<(usize, f32)> {
         self.top(scored.into_iter().collect(), self.keep(Rung::OneBit))
     }
 
     /// Re-scores rung 0's survivors at int8 precision.

---- the_exact_rung_reproduces_brute_force_on_what_it_is_given stdout ----

thread 'the_exact_rung_reproduces_brute_force_on_what_it_is_given' panicked at crates/pstore-index/tests/ladder.rs:197:9:
assertion `left == right` failed: the exact rung disagreed with brute force
  left: [0]
 right: [4, 109, 61, 64, 163, 150, 11, 12, 81, 3]

---- int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung stdout ----

thread 'int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung' panicked at crates/pstore-index/tests/ladder.rs:231:9:
assertion `left == right` failed: the oversample did not keep everything
  left: 1
 right: 200

---- a_higher_rung_never_returns_a_worse_top_k stdout ----

thread 'a_higher_rung_never_returns_a_worse_top_k' panicked at crates/pstore-index/tests/ladder.rs:166:5:
recall@10 through the full ladder was 0%, under the 90% floor

failures:
    a_higher_rung_never_returns_a_worse_top_k
    int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung
    the_exact_rung_reproduces_brute_force_on_what_it_is_given

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.38s

*** result: Failure(101)
