*** crates/pstore-index/src/ladder.rs:65:9: replace Ladder::rung0 -> Vec<(usize, f32)> with vec![(1, 0.0)]

*** mutation diff:
--- crates/pstore-index/src/ladder.rs
+++ replace Ladder::rung0 -> Vec<(usize, f32)> with vec![(1, 0.0)]
@@ -57,17 +57,17 @@
         // what lets a recall number be compared across runs at all.
         scored.sort_by(|a, b| b.1.total_cmp(&a.1).then_with(|| a.0.cmp(&b.0)));
         scored.truncate(keep);
         scored
     }
 
     /// Scores every candidate at 1-bit precision and keeps the oversampled top.
     pub fn rung0<I: IntoIterator<Item = (usize, f32)>>(&self, scored: I) -> Vec<(usize, f32)> {
-        self.top(scored.into_iter().collect(), self.keep(Rung::OneBit))
+        vec![(1, 0.0)] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Re-scores rung 0's survivors at int8 precision.
     pub fn rung1<F: FnMut(usize) -> f32>(
         &self,
         candidates: &[(usize, f32)],
         mut score: F,
     ) -> Vec<(usize, f32)> {

---- int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung stdout ----

thread 'int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung' panicked at crates/pstore-index/tests/ladder.rs:231:9:
assertion `left == right` failed: the oversample did not keep everything
  left: 1
 right: 200

---- a_higher_rung_never_returns_a_worse_top_k stdout ----

thread 'a_higher_rung_never_returns_a_worse_top_k' panicked at crates/pstore-index/tests/ladder.rs:166:5:
recall@10 through the full ladder was 0%, under the 90% floor

failures:
    a_higher_rung_never_returns_a_worse_top_k
    int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.40s

*** result: Failure(101)
