*** crates/pstore-index/src/ladder.rs:74:9: replace Ladder::rung1 -> Vec<(usize, f32)> with vec![(1, -1.0)]

*** mutation diff:
--- crates/pstore-index/src/ladder.rs
+++ replace Ladder::rung1 -> Vec<(usize, f32)> with vec![(1, -1.0)]
@@ -66,18 +66,17 @@
     }
 
     /// Re-scores rung 0's survivors at int8 precision.
     pub fn rung1<F: FnMut(usize) -> f32>(
         &self,
         candidates: &[(usize, f32)],
         mut score: F,
     ) -> Vec<(usize, f32)> {
-        let rescored = candidates.iter().map(|(i, _)| (*i, score(*i))).collect();
-        self.top(rescored, self.keep(Rung::Int8))
+        vec![(1, -1.0)] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Re-scores rung 1's survivors exactly.
     pub fn rung2<F: FnMut(usize) -> f32>(
         &self,
         candidates: &[(usize, f32)],
         mut score: F,
     ) -> Vec<(usize, f32)> {

---- int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung stdout ----

thread 'int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung' panicked at crates/pstore-index/tests/ladder.rs:239:9:
assertion `left == right` failed: exact rerank disagreed with brute force
  left: [1]
 right: [115, 22, 61, 110, 38, 116, 94, 139, 19, 37]

---- a_higher_rung_never_returns_a_worse_top_k stdout ----

thread 'a_higher_rung_never_returns_a_worse_top_k' panicked at crates/pstore-index/tests/ladder.rs:159:5:
int8 rerank lost ground: 1 vs 183

failures:
    a_higher_rung_never_returns_a_worse_top_k
    int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.44s

*** result: Failure(101)
