*** crates/pstore-index/src/rabitq.rs:133:9: replace Code::alignment -> f32 with 0.0

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace Code::alignment -> f32 with 0.0
@@ -125,17 +125,17 @@
     #[must_use]
     pub fn bits(&self) -> &[u8] {
         &self.bits
     }
 
     /// `<x̄, x>`, the alignment between the code and the vector it came from.
     #[must_use]
     pub fn alignment(&self) -> f32 {
-        self.alignment
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// `||o - c||`.
     #[must_use]
     pub fn residual_norm(&self) -> f32 {
         self.residual_norm
     }

---- the_rotation_is_randomised_not_merely_orthogonal stdout ----

thread 'the_rotation_is_randomised_not_merely_orthogonal' panicked at crates/pstore-index/tests/rabitq.rs:185:5:
a Hadamard-structured vector encoded with alignment 0.0000; without random sign flips it collapses to about 0.0442 and the code carries almost no information

failures:
    the_rotation_is_randomised_not_merely_orthogonal

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.87s

*** result: Failure(101)
