*** crates/pstore-index/src/rabitq.rs:150:9: replace Code::write_to with ()

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace Code::write_to with ()
@@ -142,19 +142,17 @@
     /// Appends this code's wire form: sign bits, then the alignment.
     ///
     /// ⚠️ The alignment travels **with** the bits. It is measured per vector at encode time
     /// and the estimate is meaningless without it, so a section holding bits alone would be
     /// a section of unusable codes — and would look fine, because the bits would decode.
     /// Four bytes a vector, which is why the 1-bit tier is 22x smaller than float32 rather
     /// than the 24x the bit count alone suggests.
     pub fn write_to(&self, out: &mut Vec<u8>) {
-        out.extend_from_slice(&self.bits);
-        out.extend_from_slice(&self.alignment.to_le_bytes());
-        out.extend_from_slice(&self.residual_norm.to_le_bytes());
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A query, rotated once and ready to score against many codes.
 #[derive(Debug, Clone)]
 pub struct Query(Vec<f32>);
 
 /// A dimension's quantizer. Holds no data-derived state — that is the point.

---- exact_rerank_costs_exactly_one_more_round stdout ----

thread 'exact_rerank_costs_exactly_one_more_round' panicked at crates/pstore-index/tests/persisted.rs:151:5:
assertion `left == right` failed: exact took 0 rounds
  left: 0
 right: 2

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:118:9:
assertion `left == right` failed
  left: 0
 right: 10

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at crates/pstore-index/tests/persisted.rs:277:69:
called `Option::unwrap()` on a `None` value

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    a_rung_zero_query_reads_no_int8_or_float_bytes
    exact_rerank_costs_exactly_one_more_round
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.99s

*** result: Failure(101)
