*** crates/pstore-index/src/rabitq.rs:194:9: replace Quantizer::code_len -> usize with 0

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace Quantizer::code_len -> usize with 0
@@ -186,17 +186,17 @@
             })
             .collect();
         Self { dim, padded, flips }
     }
 
     /// Bytes one code occupies on the wire: sign bits plus the alignment.
     #[must_use]
     pub fn code_len(&self) -> usize {
-        self.padded.div_ceil(8) + 8
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Reads a code back from [`Code::write_to`]'s form.
     ///
     /// Returns `None` for a wrong-length record rather than decoding a shifted one: a
     /// fixed-width section read at the wrong stride yields plausible bits and silently wrong
     /// answers, which is the failure this shape exists to make impossible.
     #[must_use]

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:118:9:
assertion `left == right` failed
  left: 0
 right: 10

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at crates/pstore-index/tests/persisted.rs:277:5:
assertion failed: s.bytes_in(&key, idx.segment().section(Section::RaBitQ).unwrap()) > 0

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:404:5:
`fast` found 0 of the true neighbours against `none`'s 0: the int8 rung is costing a section of every segment and buying nothing

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    a_rung_zero_query_reads_no_int8_or_float_bytes
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.36s

*** result: Failure(101)
