*** crates/pstore-index/src/rabitq.rs:204:9: replace Quantizer::read_code -> Option<Code> with None

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace Quantizer::read_code -> Option<Code> with None
@@ -196,27 +196,17 @@
 
     /// Reads a code back from [`Code::write_to`]'s form.
     ///
     /// Returns `None` for a wrong-length record rather than decoding a shifted one: a
     /// fixed-width section read at the wrong stride yields plausible bits and silently wrong
     /// answers, which is the failure this shape exists to make impossible.
     #[must_use]
     pub fn read_code(&self, raw: &[u8]) -> Option<Code> {
-        if raw.len() != self.code_len() {
-            return None;
-        }
-        let split = self.padded.div_ceil(8);
-        let (bits, tail) = raw.split_at_checked(split)?;
-        Some(Code {
-            bits: bits.to_vec(),
-            alignment: f32::from_le_bytes(tail.get(..4)?.try_into().ok()?),
-            residual_norm: f32::from_le_bytes(tail.get(4..8)?.try_into().ok()?),
-            dim: self.dim,
-        })
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// The dimension this quantizer encodes.
     #[must_use]
     pub fn dim(&self) -> usize {
         self.dim
     }

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:118:9:
assertion `left == right` failed
  left: 0
 right: 10

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:404:5:
`fast` found 0 of the true neighbours against `none`'s 0: the int8 rung is costing a section of every segment and buying nothing

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.26s

*** result: Failure(101)
