*** crates/pstore-index/src/rabitq.rs:220:9: replace Quantizer::dim -> usize with 0

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace Quantizer::dim -> usize with 0
@@ -212,17 +212,17 @@
             residual_norm: f32::from_le_bytes(tail.get(4..8)?.try_into().ok()?),
             dim: self.dim,
         })
     }
 
     /// The dimension this quantizer encodes.
     #[must_use]
     pub fn dim(&self) -> usize {
-        self.dim
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     fn check(&self, v: &[f32]) -> Result<(), QuantError> {
         if v.len() == self.dim {
             Ok(())
         } else {
             Err(QuantError::Dimension {
                 expected: self.dim,

*** result: Success
