*** crates/pstore-index/src/rabitq.rs:224:20: replace == with != in Quantizer::check

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace == with != in Quantizer::check
@@ -216,17 +216,17 @@
 
     /// The dimension this quantizer encodes.
     #[must_use]
     pub fn dim(&self) -> usize {
         self.dim
     }
 
     fn check(&self, v: &[f32]) -> Result<(), QuantError> {
-        if v.len() == self.dim {
+        if v.len() != /* ~ changed by cargo-mutants ~ */ self.dim {
             Ok(())
         } else {
             Err(QuantError::Dimension {
                 expected: self.dim,
                 got: v.len(),
             })
         }
     }

---- int8_rerank_beats_one_bit_on_the_same_pairs stdout ----

thread 'int8_rerank_beats_one_bit_on_the_same_pairs' panicked at crates/pstore-index/tests/ladder.rs:91:51:
called `Result::unwrap()` on an `Err` value: Dimension { expected: 384, got: 384 }

---- int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung stdout ----

thread 'int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung' panicked at crates/pstore-index/tests/ladder.rs:210:58:
called `Result::unwrap()` on an `Err` value: Dimension { expected: 384, got: 384 }

---- a_higher_rung_never_returns_a_worse_top_k stdout ----

thread 'a_higher_rung_never_returns_a_worse_top_k' panicked at crates/pstore-index/tests/ladder.rs:122:58:
called `Result::unwrap()` on an `Err` value: Dimension { expected: 384, got: 384 }

failures:
    a_higher_rung_never_returns_a_worse_top_k
    int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung
    int8_rerank_beats_one_bit_on_the_same_pairs

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
