*** crates/pstore-index/src/rabitq.rs:245:17: replace < with > in Quantizer::rotate

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace < with > in Quantizer::rotate
@@ -237,17 +237,17 @@
     /// are preserved — which is what lets the estimate be compared against the original
     /// vectors' inner product at all.
     fn rotate(&self, v: &[f32]) -> Vec<f32> {
         let mut a = vec![0.0f32; self.padded];
         for ((slot, x), flip) in a.iter_mut().zip(v).zip(&self.flips) {
             *slot = x * flip;
         }
         let mut h = 1;
-        while h < self.padded {
+        while h > /* ~ changed by cargo-mutants ~ */ self.padded {
             for chunk in a.chunks_mut(h * 2) {
                 let (lo, hi) = chunk.split_at_mut(h);
                 for (x, y) in lo.iter_mut().zip(hi.iter_mut()) {
                     let (u, w) = (*x, *y);
                     *x = u + w;
                     *y = u - w;
                 }
             }

---- the_rotation_is_randomised_not_merely_orthogonal stdout ----

thread 'the_rotation_is_randomised_not_merely_orthogonal' panicked at crates/pstore-index/tests/rabitq.rs:185:5:
a Hadamard-structured vector encoded with alignment 0.0383; without random sign flips it collapses to about 0.0442 and the code carries almost no information

---- a_deliberately_wrong_estimator_breaches_the_bound stdout ----

thread 'a_deliberately_wrong_estimator_breaches_the_bound' panicked at crates/pstore-index/tests/rabitq.rs:220:5:
an estimator missing its normalisation breached the bound only 0 times in 2000: the bound is too loose to mean anything

failures:
    a_deliberately_wrong_estimator_breaches_the_bound
    the_rotation_is_randomised_not_merely_orthogonal

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.75s

*** result: Failure(101)
