*** crates/pstore-index/src/rabitq.rs:250:28: replace + with - in Quantizer::rotate

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace + with - in Quantizer::rotate
@@ -242,17 +242,17 @@
             *slot = x * flip;
         }
         let mut h = 1;
         while h < self.padded {
             for chunk in a.chunks_mut(h * 2) {
                 let (lo, hi) = chunk.split_at_mut(h);
                 for (x, y) in lo.iter_mut().zip(hi.iter_mut()) {
                     let (u, w) = (*x, *y);
-                    *x = u + w;
+                    *x = u - /* ~ changed by cargo-mutants ~ */ w;
                     *y = u - w;
                 }
             }
             h *= 2;
         }
         let scale = 1.0 / (self.padded as f32).sqrt();
         for x in a.iter_mut() {
             *x *= scale;

---- a_higher_rung_never_returns_a_worse_top_k stdout ----

thread 'a_higher_rung_never_returns_a_worse_top_k' panicked at crates/pstore-index/tests/ladder.rs:166:5:
recall@10 through the full ladder was 19%, under the 90% floor

failures:
    a_higher_rung_never_returns_a_worse_top_k

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.38s

*** result: Failure(101)
