*** crates/pstore-index/src/rabitq.rs:258:16: replace *= with += in Quantizer::rotate

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace *= with += in Quantizer::rotate
@@ -250,17 +250,17 @@
                     *x = u + w;
                     *y = u - w;
                 }
             }
             h *= 2;
         }
         let scale = 1.0 / (self.padded as f32).sqrt();
         for x in a.iter_mut() {
-            *x *= scale;
+            *x += /* ~ changed by cargo-mutants ~ */ scale;
         }
         a
     }
 
     /// Encodes a vector as its residual from `centroid`.
     ///
     /// See the module docs: quantizing the raw vector instead costs most of the recall,
     /// because everything in one posting list is similar and the shared component is all

---- the_alignment_is_measured_per_vector_not_assumed stdout ----

thread 'the_alignment_is_measured_per_vector_not_assumed' panicked at crates/pstore-index/tests/rabitq.rs:249:5:
every vector got essentially the same bound (0.0000..0.0000): the alignment is being assumed rather than measured, so the bound no longer describes the code it is attached to

---- the_measured_failure_rate_is_below_delta stdout ----

thread 'the_measured_failure_rate_is_below_delta' panicked at crates/pstore-index/tests/rabitq.rs:157:5:
the error bound was breached 5000 times in 5000 pairs (rate 1.00000, delta 1e-3, epsilon 3.9); either the estimator is wrong or RaBitQ's published guarantee does not hold as implemented

failures:
    the_alignment_is_measured_per_vector_not_assumed
    the_measured_failure_rate_is_below_delta

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.05s

*** result: Failure(101)
