*** crates/pstore-index/src/rabitq.rs:273:29: replace - with + in Quantizer::encode_residual

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace - with + in Quantizer::encode_residual
@@ -265,17 +265,17 @@
     /// See the module docs: quantizing the raw vector instead costs most of the recall,
     /// because everything in one posting list is similar and the shared component is all
     /// the 1-bit code can see.
     pub fn encode_residual(&self, v: &[f32], centroid: &[f32]) -> Result<Code, QuantError> {
         self.check(v)?;
         let residual: Vec<f32> = v
             .iter()
             .enumerate()
-            .map(|(i, x)| x - centroid.get(i).copied().unwrap_or(0.0))
+            .map(|(i, x)| x + /* ~ changed by cargo-mutants ~ */ centroid.get(i).copied().unwrap_or(0.0))
             .collect();
         let norm = residual.iter().map(|x| x * x).sum::<f32>().sqrt();
         // A vector sitting exactly on its centroid has no direction to quantize. Its
         // reconstruction is `<c,q>` with a zero scale, which is exactly right.
         let unit: Vec<f32> = if norm > 0.0 {
             residual.iter().map(|x| x / norm).collect()
         } else {
             residual

*** result: Success
