*** crates/pstore-index/src/rabitq.rs:302:19: replace > with < in Quantizer::encode_unit

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace > with < in Quantizer::encode_unit
@@ -294,17 +294,17 @@
         self.check(v)?;
         let r = self.rotate(v);
         let mut bits = vec![0u8; self.padded.div_ceil(8)];
         // `<x̄, x>` where `x̄ = sign(x)/sqrt(padded)`, which is `||x||₁ / sqrt(padded)`.
         // Computed from the rotated vector, over the padded length, because that is the
         // space the estimate lives in.
         let l1: f32 = r.iter().map(|x| x.abs()).sum();
         for (i, x) in r.iter().enumerate() {
-            if *x > 0.0
+            if *x < /* ~ changed by cargo-mutants ~ */ 0.0
                 && let Some(byte) = bits.get_mut(i / 8)
             {
                 *byte |= 1 << (i % 8);
             }
         }
         Ok(Code {
             bits,
             alignment: l1 / (self.padded as f32).sqrt(),

---- a_higher_rung_never_returns_a_worse_top_k stdout ----

thread 'a_higher_rung_never_returns_a_worse_top_k' panicked at crates/pstore-index/tests/ladder.rs:166:5:
recall@10 through the full ladder was 0%, under the 90% floor

failures:
    a_higher_rung_never_returns_a_worse_top_k

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
