*** crates/pstore-index/src/rabitq.rs:310:27: replace / with * in Quantizer::encode_unit

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace / with * in Quantizer::encode_unit
@@ -302,17 +302,17 @@
             if *x > 0.0
                 && let Some(byte) = bits.get_mut(i / 8)
             {
                 *byte |= 1 << (i % 8);
             }
         }
         Ok(Code {
             bits,
-            alignment: l1 / (self.padded as f32).sqrt(),
+            alignment: l1 * /* ~ changed by cargo-mutants ~ */ (self.padded as f32).sqrt(),
             // Overwritten by `encode_residual`; 1.0 means "the vector is its own residual",
             // which is what makes `encode` and `encode_residual` agree for a zero centroid.
             residual_norm: 1.0,
             dim: self.dim,
         })
     }
 
     /// `<x̄, q>` — the raw, **biased** inner product of the code with a rotated query.

---- the_alignment_is_measured_per_vector_not_assumed stdout ----

thread 'the_alignment_is_measured_per_vector_not_assumed' panicked at crates/pstore-index/tests/rabitq.rs:249:5:
every vector got essentially the same bound (0.0000..0.0000): the alignment is being assumed rather than measured, so the bound no longer describes the code it is attached to

---- the_measured_failure_rate_is_below_delta stdout ----

thread 'the_measured_failure_rate_is_below_delta' panicked at crates/pstore-index/tests/rabitq.rs:157:5:
the error bound was breached 5000 times in 5000 pairs (rate 1.00000, delta 1e-3, epsilon 3.9); either the estimator is wrong or RaBitQ's published guarantee does not hold as implemented

failures:
    the_alignment_is_measured_per_vector_not_assumed
    the_measured_failure_rate_is_below_delta

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.05s

*** result: Failure(101)
