*** crates/pstore-index/src/rabitq.rs:320:25: replace / with % in Quantizer::raw

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace / with % in Quantizer::raw
@@ -312,17 +312,17 @@
             // which is what makes `encode` and `encode_residual` agree for a zero centroid.
             residual_norm: 1.0,
             dim: self.dim,
         })
     }
 
     /// `<x̄, q>` — the raw, **biased** inner product of the code with a rotated query.
     fn raw(&self, code: &Code, rotated_query: &[f32]) -> f32 {
-        let scale = 1.0 / (self.padded as f32).sqrt();
+        let scale = 1.0 % /* ~ changed by cargo-mutants ~ */ (self.padded as f32).sqrt();
         let mut acc = 0.0f32;
         for (i, q) in rotated_query.iter().enumerate() {
             let bit = code
                 .bits
                 .get(i / 8)
                 .is_some_and(|b| b & (1 << (i % 8)) != 0);
             acc += if bit { *q } else { -*q };
         }

---- the_measured_failure_rate_is_below_delta stdout ----

thread 'the_measured_failure_rate_is_below_delta' panicked at crates/pstore-index/tests/rabitq.rs:157:5:
the error bound was breached 4916 times in 5000 pairs (rate 0.98320, delta 1e-3, epsilon 3.9); either the estimator is wrong or RaBitQ's published guarantee does not hold as implemented

failures:
    the_measured_failure_rate_is_below_delta

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.05s

*** result: Failure(101)
