*** crates/pstore-index/src/rabitq.rs:350:9: replace Quantizer::estimate_residual -> f32 with 0.0

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace Quantizer::estimate_residual -> f32 with 0.0
@@ -342,17 +342,17 @@
 
     /// Estimates `<o, q>` where the code is a residual from a centroid.
     ///
     /// `centroid_dot` is `<c, q>`, computed **once per probed posting list** rather than
     /// once per candidate — there are thousands of candidates behind each centroid, and
     /// that ratio is the whole reason this is cheap.
     #[must_use]
     pub fn estimate_residual(&self, code: &Code, query: &Query, centroid_dot: f32) -> f32 {
-        centroid_dot + code.residual_norm * self.estimate_prepared(code, query)
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Estimates `<o, q>` from `o`'s code and a prepared query.
     #[must_use]
     pub fn estimate_prepared(&self, code: &Code, query: &Query) -> f32 {
         // ⚠️ The division is the whole construction. `<x̄, q>` is biased low by exactly the
         // factor `<x̄, x>`, which the encoder measured; dividing removes it.
         self.raw(code, &query.0) / code.alignment

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:417:5:
exact rerank found only 27 of 50

failures:
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.03s

*** result: Failure(101)
