*** crates/pstore-index/src/rabitq.rs:358:9: replace Quantizer::estimate_prepared -> f32 with -1.0

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace Quantizer::estimate_prepared -> f32 with -1.0
@@ -350,17 +350,17 @@
         centroid_dot + code.residual_norm * self.estimate_prepared(code, query)
     }
 
     /// Estimates `<o, q>` from `o`'s code and a prepared query.
     #[must_use]
     pub fn estimate_prepared(&self, code: &Code, query: &Query) -> f32 {
         // ⚠️ The division is the whole construction. `<x̄, q>` is biased low by exactly the
         // factor `<x̄, x>`, which the encoder measured; dividing removes it.
-        self.raw(code, &query.0) / code.alignment
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Estimates `<o, q>` from `o`'s code and a unit query.
     pub fn estimate(&self, code: &Code, query: &[f32]) -> Result<f32, QuantError> {
         Ok(self.estimate_prepared(code, &self.prepare(query)?))
     }
 
     /// The same estimate **without** the normalisation, so a test can show the bound is

---- a_higher_rung_never_returns_a_worse_top_k stdout ----

thread 'a_higher_rung_never_returns_a_worse_top_k' panicked at crates/pstore-index/tests/ladder.rs:166:5:
recall@10 through the full ladder was 18%, under the 90% floor

failures:
    a_higher_rung_never_returns_a_worse_top_k

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.34s

*** result: Failure(101)
