*** crates/pstore-index/src/rabitq.rs:363:9: replace Quantizer::estimate -> Result<f32, QuantError> with Ok(-1.0)

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace Quantizer::estimate -> Result<f32, QuantError> with Ok(-1.0)
@@ -355,17 +355,17 @@
     pub fn estimate_prepared(&self, code: &Code, query: &Query) -> f32 {
         // ⚠️ The division is the whole construction. `<x̄, q>` is biased low by exactly the
         // factor `<x̄, x>`, which the encoder measured; dividing removes it.
         self.raw(code, &query.0) / code.alignment
     }
 
     /// Estimates `<o, q>` from `o`'s code and a unit query.
     pub fn estimate(&self, code: &Code, query: &[f32]) -> Result<f32, QuantError> {
-        Ok(self.estimate_prepared(code, &self.prepare(query)?))
+        Ok(-1.0) /* ~ changed by cargo-mutants ~ */
     }
 
     /// The same estimate **without** the normalisation, so a test can show the bound is
     /// tight enough to reject it.
     #[doc(hidden)]
     pub fn estimate_unnormalized_for_test(&self, code: &Code, query: &Query) -> f32 {
         self.raw(code, &query.0)
     }

---- a_dimension_mismatch_is_an_error_not_a_wrong_answer stdout ----

thread 'a_dimension_mismatch_is_an_error_not_a_wrong_answer' panicked at crates/pstore-index/tests/rabitq.rs:262:5:
assertion failed: q.estimate(&code, &[0.0; 8]).is_err()

---- the_measured_failure_rate_is_below_delta stdout ----

thread 'the_measured_failure_rate_is_below_delta' panicked at crates/pstore-index/tests/rabitq.rs:157:5:
the error bound was breached 5000 times in 5000 pairs (rate 1.00000, delta 1e-3, epsilon 3.9); either the estimator is wrong or RaBitQ's published guarantee does not hold as implemented

failures:
    a_dimension_mismatch_is_an_error_not_a_wrong_answer
    the_measured_failure_rate_is_below_delta

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.58s

*** result: Failure(101)
