*** crates/pstore-index/src/rabitq.rs:380:9: replace Quantizer::error_bound -> f32 with 1.0

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace Quantizer::error_bound -> f32 with 1.0
@@ -372,13 +372,11 @@
 
     /// The error bound for this code, at [`BOUND_EPSILON`].
     ///
     /// Widens as the code's alignment falls: a vector the sign pattern represents poorly is
     /// one the estimate is allowed to be more wrong about. That dependence is why the bound
     /// is a function of the code rather than a constant.
     #[must_use]
     pub fn error_bound(&self, code: &Code) -> f32 {
-        let a = code.alignment.max(f32::EPSILON);
-        let d = (self.padded.max(2) - 1) as f32;
-        BOUND_EPSILON * ((1.0 - a * a).max(0.0) / d).sqrt() / a
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 }

---- the_alignment_is_measured_per_vector_not_assumed stdout ----

thread 'the_alignment_is_measured_per_vector_not_assumed' panicked at crates/pstore-index/tests/rabitq.rs:249:5:
every vector got essentially the same bound (1.0000..1.0000): the alignment is being assumed rather than measured, so the bound no longer describes the code it is attached to

---- a_deliberately_wrong_estimator_breaches_the_bound stdout ----

thread 'a_deliberately_wrong_estimator_breaches_the_bound' panicked at crates/pstore-index/tests/rabitq.rs:220:5:
an estimator missing its normalisation breached the bound only 0 times in 2000: the bound is too loose to mean anything

failures:
    a_deliberately_wrong_estimator_breaches_the_bound
    the_alignment_is_measured_per_vector_not_assumed

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.96s

*** result: Failure(101)
