*** crates/pstore-index/src/rabitq.rs:382:23: replace * with + in Quantizer::error_bound

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace * with + in Quantizer::error_bound
@@ -374,11 +374,11 @@
     ///
     /// Widens as the code's alignment falls: a vector the sign pattern represents poorly is
     /// one the estimate is allowed to be more wrong about. That dependence is why the bound
     /// is a function of the code rather than a constant.
     #[must_use]
     pub fn error_bound(&self, code: &Code) -> f32 {
         let a = code.alignment.max(f32::EPSILON);
         let d = (self.padded.max(2) - 1) as f32;
-        BOUND_EPSILON * ((1.0 - a * a).max(0.0) / d).sqrt() / a
+        BOUND_EPSILON + /* ~ changed by cargo-mutants ~ */ ((1.0 - a * a).max(0.0) / d).sqrt() / a
     }
 }

---- a_deliberately_wrong_estimator_breaches_the_bound stdout ----

thread 'a_deliberately_wrong_estimator_breaches_the_bound' panicked at crates/pstore-index/tests/rabitq.rs:220:5:
an estimator missing its normalisation breached the bound only 0 times in 2000: the bound is too loose to mean anything

failures:
    a_deliberately_wrong_estimator_breaches_the_bound

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.06s

*** result: Failure(101)
