*** crates/pstore-index/src/rabitq.rs:382:61: replace / with % in Quantizer::error_bound

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace / with % in Quantizer::error_bound
@@ -374,11 +374,11 @@
     ///
     /// Widens as the code's alignment falls: a vector the sign pattern represents poorly is
     /// one the estimate is allowed to be more wrong about. That dependence is why the bound
     /// is a function of the code rather than a constant.
     #[must_use]
     pub fn error_bound(&self, code: &Code) -> f32 {
         let a = code.alignment.max(f32::EPSILON);
         let d = (self.padded.max(2) - 1) as f32;
-        BOUND_EPSILON * ((1.0 - a * a).max(0.0) / d).sqrt() / a
+        BOUND_EPSILON * ((1.0 - a * a).max(0.0) / d).sqrt() % /* ~ changed by cargo-mutants ~ */ a
     }
 }

---- the_measured_failure_rate_is_below_delta stdout ----

thread 'the_measured_failure_rate_is_below_delta' panicked at crates/pstore-index/tests/rabitq.rs:157:5:
the error bound was breached 6 times in 5000 pairs (rate 0.00120, delta 1e-3, epsilon 3.9); either the estimator is wrong or RaBitQ's published guarantee does not hold as implemented

failures:
    the_measured_failure_rate_is_below_delta

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.44s

*** result: Failure(101)
