*** crates/pstore-index/src/rabitq.rs:92:9: replace <impl fmt::Display for QuantError>::fmt -> fmt::Result with Ok(Default::default())

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace <impl fmt::Display for QuantError>::fmt -> fmt::Result with Ok(Default::default())
@@ -84,21 +84,17 @@
         expected: usize,
         /// What it was given.
         got: usize,
     },
 }
 
 impl fmt::Display for QuantError {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
-        match self {
-            Self::Dimension { expected, got } => {
-                write!(f, "expected {expected} dimensions, got {got}")
-            }
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl core::error::Error for QuantError {}
 
 /// One vector's 1-bit code, with the scalar that makes it unbiased.
 #[derive(Debug, Clone, PartialEq)]
 pub struct Code {

*** result: Success
