*** crates/pstore-index/src/search.rs:19:5: replace probe -> Vec<usize> with vec![1]

*** mutation diff:
--- crates/pstore-index/src/search.rs
+++ replace probe -> Vec<usize> with vec![1]
@@ -11,26 +11,17 @@
 
 /// Which lists a query should read.
 ///
 /// `p` is free in **depth** and costs **bytes**: 64 lists is the same one round trip as 8,
 /// and eight times the transfer. That asymmetry is the lever a memory-resident index does
 /// not have, and it is why `p` is the recall knob rather than a graph traversal depth.
 #[must_use]
 pub fn probe(clustering: &Clustering, query: &[f32], p: usize) -> Vec<usize> {
-    let mut d: Vec<(usize, f32)> = clustering
-        .centroids()
-        .iter()
-        .enumerate()
-        .map(|(i, c)| (i, dist2(query, c)))
-        .collect();
-    // Ties by index so a probe set is reproducible; recall is compared across runs.
-    d.sort_by(|a, b| a.1.total_cmp(&b.1).then_with(|| a.0.cmp(&b.0)));
-    d.truncate(p.max(1));
-    d.into_iter().map(|(i, _)| i).collect()
+    vec![1] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Which lists a query should read, dropping those too far to contribute.
 ///
 /// ⚠️ Query-aware pruning: a query sitting **on** a centroid has one obviously-right list
 /// and the rest are noise, while a query equidistant between several genuinely needs them
 /// all. Probing a fixed `p` either over-fetches for the easy query or under-fetches for the
 /// hard one. `slack` is how much further than the nearest centroid a list may be and still

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:404:5:
`fast` found 0 of the true neighbours against `none`'s 0: the int8 rung is costing a section of every segment and buying nothing

---- probing_more_lists_costs_bytes_not_depth stdout ----

thread 'probing_more_lists_costs_bytes_not_depth' panicked at crates/pstore-index/tests/persisted.rs:213:5:
p=64 moved 3784 bytes against p=4's 3784: probing wider is not costing bytes, so it is probably not probing wider

failures:
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.25s

*** result: Failure(101)
