*** crates/pstore-index/src/search.rs:50:25: replace * with + in probe_pruned

*** mutation diff:
--- crates/pstore-index/src/search.rs
+++ replace * with + in probe_pruned
@@ -42,17 +42,17 @@
         .first()
         .and_then(|i| clustering.centroids().get(*i))
         .map(|c| dist2(query, c).sqrt())
     else {
         return chosen;
     };
     // True distance, not squared: `slack` is a fraction of a distance, and applying it to a
     // squared value makes the threshold quietly dimension-dependent.
-    let limit = nearest * (1.0 + slack);
+    let limit = nearest + /* ~ changed by cargo-mutants ~ */ (1.0 + slack);
     let kept: Vec<usize> = chosen
         .iter()
         .copied()
         .filter(|i| {
             clustering
                 .centroids()
                 .get(*i)
                 .is_some_and(|c| dist2(query, c).sqrt() <= limit)

---- an_easy_query_prunes_more_than_a_hard_one stdout ----

thread 'an_easy_query_prunes_more_than_a_hard_one' panicked at crates/pstore-index/tests/recall.rs:137:5:
pruning kept 16 lists for a query on a centroid and 16 for one between two: it is not query-aware

failures:
    an_easy_query_prunes_more_than_a_hard_one

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.23s

*** result: Failure(101)
