*** crates/pstore-index/src/search.rs:58:57: replace <= with > in probe_pruned

*** mutation diff:
--- crates/pstore-index/src/search.rs
+++ replace <= with > in probe_pruned
@@ -50,17 +50,17 @@
     let limit = nearest * (1.0 + slack);
     let kept: Vec<usize> = chosen
         .iter()
         .copied()
         .filter(|i| {
             clustering
                 .centroids()
                 .get(*i)
-                .is_some_and(|c| dist2(query, c).sqrt() <= limit)
+                .is_some_and(|c| dist2(query, c).sqrt() > /* ~ changed by cargo-mutants ~ */ limit)
         })
         .collect();
     // Never empty: pruning that can return nothing turns a hard query into no answer at
     // all, which is a worse failure than fetching a list that did not help.
     if kept.is_empty() { chosen } else { kept }
 }
 
 /// Every row reachable through `lists`, deduplicated.

---- an_easy_query_prunes_more_than_a_hard_one stdout ----

thread 'an_easy_query_prunes_more_than_a_hard_one' panicked at crates/pstore-index/tests/recall.rs:137:5:
pruning kept 15 lists for a query on a centroid and 14 for one between two: it is not query-aware

failures:
    an_easy_query_prunes_more_than_a_hard_one

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.79s

*** result: Failure(101)
