*** crates/pstore-index/src/sq8.rs:104:25: replace + with - in estimate_raw

*** mutation diff:
--- crates/pstore-index/src/sq8.rs
+++ replace + with - in estimate_raw
@@ -96,17 +96,17 @@
 /// Estimates `<o, q>` from one row's wire form.
 #[must_use]
 pub fn estimate_raw(record: &[u8], query: &[f32]) -> f32 {
     let Some(split) = record.len().checked_sub(8) else {
         return f32::NEG_INFINITY;
     };
     let (codes, tail) = record.split_at(split);
     let f = |at: usize| {
-        tail.get(at..at + 4)
+        tail.get(at..at - /* ~ changed by cargo-mutants ~ */ 4)
             .and_then(|b| b.try_into().ok())
             .map_or(0.0, f32::from_le_bytes)
     };
     let (offset, step) = (f(0), f(4));
     let mut sum_q = 0.0f32;
     let mut acc = 0.0f32;
     for (b, q) in codes.iter().zip(query) {
         sum_q += *q;

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/src/sq8.rs:104:22:
attempt to subtract with overflow

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/src/sq8.rs:104:22:
attempt to subtract with overflow

---- probing_more_lists_costs_bytes_not_depth stdout ----

thread 'probing_more_lists_costs_bytes_not_depth' panicked at crates/pstore-index/src/sq8.rs:104:22:
attempt to subtract with overflow

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.37s

*** result: Failure(101)
