*** crates/pstore-index/src/sq8.rs:112:15: replace += with *= in estimate_raw

*** mutation diff:
--- crates/pstore-index/src/sq8.rs
+++ replace += with *= in estimate_raw
@@ -104,17 +104,17 @@
         tail.get(at..at + 4)
             .and_then(|b| b.try_into().ok())
             .map_or(0.0, f32::from_le_bytes)
     };
     let (offset, step) = (f(0), f(4));
     let mut sum_q = 0.0f32;
     let mut acc = 0.0f32;
     for (b, q) in codes.iter().zip(query) {
-        sum_q += *q;
+        sum_q *= /* ~ changed by cargo-mutants ~ */ *q;
         acc += f32::from(*b) * *q;
     }
     offset * sum_q + step * acc
 }
 
 /// Estimates `<o, q>` from `o`'s code.
 ///
 /// Expanded rather than reconstructing first: `<o,q> ≈ offset·Σq + step·Σ(c·q)`, which is

*** result: Success
