*** crates/pstore-index/src/sq8.rs:115:12: replace * with + in estimate_raw

*** mutation diff:
--- crates/pstore-index/src/sq8.rs
+++ replace * with + in estimate_raw
@@ -107,17 +107,17 @@
     };
     let (offset, step) = (f(0), f(4));
     let mut sum_q = 0.0f32;
     let mut acc = 0.0f32;
     for (b, q) in codes.iter().zip(query) {
         sum_q += *q;
         acc += f32::from(*b) * *q;
     }
-    offset * sum_q + step * acc
+    offset + /* ~ changed by cargo-mutants ~ */ sum_q + step * acc
 }
 
 /// Estimates `<o, q>` from `o`'s code.
 ///
 /// Expanded rather than reconstructing first: `<o,q> ≈ offset·Σq + step·Σ(c·q)`, which is
 /// one pass and no allocation on a path that runs once per candidate.
 #[must_use]
 pub fn estimate(c: &Code, query: &[f32]) -> f32 {

*** result: Success
