*** crates/pstore-index/src/sq8.rs:115:27: replace * with + in estimate_raw

*** mutation diff:
--- crates/pstore-index/src/sq8.rs
+++ replace * with + in estimate_raw
@@ -107,17 +107,17 @@
     };
     let (offset, step) = (f(0), f(4));
     let mut sum_q = 0.0f32;
     let mut acc = 0.0f32;
     for (b, q) in codes.iter().zip(query) {
         sum_q += *q;
         acc += f32::from(*b) * *q;
     }
-    offset * sum_q + step * acc
+    offset * sum_q + step + /* ~ changed by cargo-mutants ~ */ acc
 }
 
 /// Estimates `<o, q>` from `o`'s code.
 ///
 /// Expanded rather than reconstructing first: `<o,q> ≈ offset·Σq + step·Σ(c·q)`, which is
 /// one pass and no allocation on a path that runs once per candidate.
 #[must_use]
 pub fn estimate(c: &Code, query: &[f32]) -> f32 {

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:404:5:
`fast` found 25 of the true neighbours against `none`'s 26: the int8 rung is costing a section of every segment and buying nothing

failures:
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.99s

*** result: Failure(101)
