*** crates/pstore-index/src/sq8.rs:128:13: replace += with -= in estimate

*** mutation diff:
--- crates/pstore-index/src/sq8.rs
+++ replace += with -= in estimate
@@ -120,12 +120,12 @@
 /// Expanded rather than reconstructing first: `<o,q> ≈ offset·Σq + step·Σ(c·q)`, which is
 /// one pass and no allocation on a path that runs once per candidate.
 #[must_use]
 pub fn estimate(c: &Code, query: &[f32]) -> f32 {
     let mut sum_q = 0.0f32;
     let mut acc = 0.0f32;
     for (b, q) in c.codes.iter().zip(query) {
         sum_q += *q;
-        acc += f32::from(*b) * *q;
+        acc -= /* ~ changed by cargo-mutants ~ */ f32::from(*b) * *q;
     }
     c.offset * sum_q + c.step * acc
 }

---- int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung stdout ----

thread 'int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung' panicked at crates/pstore-index/tests/ladder.rs:239:9:
assertion `left == right` failed: exact rerank disagreed with brute force
  left: [167, 151, 111, 4, 73, 53, 122, 90, 27, 28]
 right: [115, 22, 61, 110, 38, 116, 94, 139, 19, 37]

---- a_higher_rung_never_returns_a_worse_top_k stdout ----

thread 'a_higher_rung_never_returns_a_worse_top_k' panicked at crates/pstore-index/tests/ladder.rs:159:5:
int8 rerank lost ground: 0 vs 183

---- int8_rerank_beats_one_bit_on_the_same_pairs stdout ----

thread 'int8_rerank_beats_one_bit_on_the_same_pairs' panicked at crates/pstore-index/tests/ladder.rs:95:5:
int8 mean error 0.233048 is not decisively better than 1-bit 0.027332; rung 1 is not paying for its bytes

failures:
    a_higher_rung_never_returns_a_worse_top_k
    int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung
    int8_rerank_beats_one_bit_on_the_same_pairs

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.42s

*** result: Failure(101)
