*** crates/pstore-index/src/sq8.rs:54:22: replace - with / in encode

*** mutation diff:
--- crates/pstore-index/src/sq8.rs
+++ replace - with / in encode
@@ -46,17 +46,17 @@
         .map(|x| {
             if step > 0.0 {
                 // ⚠️ `round`, not truncate. Truncation shifts every coordinate down by
                 // about half a step, so the reconstructed vector is displaced by a constant
                 // offset in every dimension at once rather than scattered around the
                 // original. Against a zero-mean query that mostly cancels in the inner
                 // product, which is why no accuracy test catches it -- only the
                 // reconstruction bound does.
-                (((x - lo) / step).round()).clamp(0.0, 255.0) as u8
+                (((x / /* ~ changed by cargo-mutants ~ */ lo) / step).round()).clamp(0.0, 255.0) as u8
             } else {
                 0
             }
         })
         .collect();
     Code {
         codes,
         offset: if lo.is_finite() { lo } else { 0.0 },

---- int8_reconstructs_within_one_quantisation_step stdout ----

thread 'int8_reconstructs_within_one_quantisation_step' panicked at crates/pstore-index/tests/ladder.rs:70:13:
reconstructed -0.14562207 from 0.06637985, step 0.0010935508: further than half a step, so the codes are truncated rather than rounded

---- int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung stdout ----

thread 'int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung' panicked at crates/pstore-index/tests/ladder.rs:239:9:
assertion `left == right` failed: exact rerank disagreed with brute force
  left: [135, 111, 10, 41, 169, 184, 9, 144, 164, 21]
 right: [115, 22, 61, 110, 38, 116, 94, 139, 19, 37]

---- a_higher_rung_never_returns_a_worse_top_k stdout ----

thread 'a_higher_rung_never_returns_a_worse_top_k' panicked at crates/pstore-index/tests/ladder.rs:159:5:
int8 rerank lost ground: 1 vs 183

failures:
    a_higher_rung_never_returns_a_worse_top_k
    int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung
    int8_reconstructs_within_one_quantisation_step
    int8_rerank_beats_one_bit_on_the_same_pairs

test result: FAILED. 2 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.60s

*** result: Failure(101)
