*** crates/pstore-index/src/sq8.rs:70:5: replace decode -> Vec<f32> with vec![]

*** mutation diff:
--- crates/pstore-index/src/sq8.rs
+++ replace decode -> Vec<f32> with vec![]
@@ -62,20 +62,17 @@
         offset: if lo.is_finite() { lo } else { 0.0 },
         step,
     }
 }
 
 /// Reconstructs the approximate vector.
 #[must_use]
 pub fn decode(c: &Code) -> Vec<f32> {
-    c.codes
-        .iter()
-        .map(|b| c.offset + f32::from(*b) * c.step)
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Bytes one row occupies on the wire: the codes, then the offset and step.
 #[must_use]
 pub fn record_len(dim: usize) -> usize {
     dim + 8
 }

*** result: Success
