*** crates/pstore-index/src/sq8.rs:79:5: replace record_len -> usize with 0

*** mutation diff:
--- crates/pstore-index/src/sq8.rs
+++ replace record_len -> usize with 0
@@ -71,17 +71,17 @@
         .iter()
         .map(|b| c.offset + f32::from(*b) * c.step)
         .collect()
 }
 
 /// Bytes one row occupies on the wire: the codes, then the offset and step.
 #[must_use]
 pub fn record_len(dim: usize) -> usize {
-    dim + 8
+    0 /* ~ changed by cargo-mutants ~ */
 }
 
 /// Appends a code's wire form: codes, then `offset` and `step`.
 ///
 /// ⚠️ The scale travels **with** the codes, and it has to. The quantization is per vector —
 /// a global scale would be fitted state, which is per-tenant training under another name —
 /// so two rows' codes are on different scales and comparing them raw is comparing
 /// different units. Measured: reading the codes without their scale made `rerank: fast`

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:404:5:
`fast` found 0 of the true neighbours against `none`'s 26: the int8 rung is costing a section of every segment and buying nothing

failures:
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.17s

*** result: Failure(101)
