*** crates/pstore-index/src/sq8.rs:79:9: replace + with * in record_len

*** mutation diff:
--- crates/pstore-index/src/sq8.rs
+++ replace + with * in record_len
@@ -71,17 +71,17 @@
         .iter()
         .map(|b| c.offset + f32::from(*b) * c.step)
         .collect()
 }
 
 /// Bytes one row occupies on the wire: the codes, then the offset and step.
 #[must_use]
 pub fn record_len(dim: usize) -> usize {
-    dim + 8
+    dim * /* ~ changed by cargo-mutants ~ */ 8
 }
 
 /// Appends a code's wire form: codes, then `offset` and `step`.
 ///
 /// ⚠️ The scale travels **with** the codes, and it has to. The quantization is per vector —
 /// a global scale would be fitted state, which is per-tenant training under another name —
 /// so two rows' codes are on different scales and comparing them raw is comparing
 /// different units. Measured: reading the codes without their scale made `rerank: fast`

---- exact_rerank_costs_exactly_one_more_round stdout ----

thread 'exact_rerank_costs_exactly_one_more_round' panicked at crates/pstore-index/tests/persisted.rs:150:6:
called `Result::unwrap()` on an `Err` value: Blob("range 161801..480713 outside object of 215275 bytes")

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:117:14:
called `Result::unwrap()` on an `Err` value: Blob("range 166088..493448 outside object of 220970 bytes")

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:399:18:
called `Result::unwrap()` on an `Err` value: Blob("range 169027..502195 outside object of 224877 bytes")

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    exact_rerank_costs_exactly_one_more_round
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 5 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.18s

*** result: Failure(101)
