*** crates/pstore-index/src/vec_index.rs:110:9: replace Centroids::decode -> Option<Self> with Some(Default::default())

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace Centroids::decode -> Option<Self> with Some(Default::default())
@@ -102,41 +102,17 @@
     }
 
     /// Decodes a table, returning `None` for anything malformed.
     ///
     /// A short or ragged table would otherwise produce centroids of the wrong dimension and
     /// spans pointing at the wrong rows — a wrong answer rather than an error.
     #[must_use]
     pub fn decode(raw: &[u8]) -> Option<Self> {
-        let n = u32::from_le_bytes(raw.get(0..4)?.try_into().ok()?) as usize;
-        let dim = u32::from_le_bytes(raw.get(4..8)?.try_into().ok()?) as usize;
-        let mut at: usize = 8;
-        let mut vectors = Vec::with_capacity(n);
-        for _ in 0..n {
-            let end = at.checked_add(dim * 4)?;
-            let v = raw
-                .get(at..end)?
-                .chunks_exact(4)
-                .map(|b| f32::from_le_bytes(b.try_into().unwrap_or([0; 4])))
-                .collect();
-            vectors.push(v);
-            at = end;
-        }
-        let mut spans = Vec::with_capacity(n);
-        for _ in 0..n {
-            let end = at.checked_add(8)?;
-            let s = raw.get(at..end)?;
-            spans.push((
-                u32::from_le_bytes(s.get(0..4)?.try_into().ok()?),
-                u32::from_le_bytes(s.get(4..8)?.try_into().ok()?),
-            ));
-            at = end;
-        }
-        Some(Self { vectors, spans })
+        Some(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// A built index: the segment bytes, and the centroid table if one was worth building.
 #[derive(Debug)]
 pub struct Built {
     /// The segment object.
     pub segment: bytes::Bytes,

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:118:9:
assertion `left == right` failed
  left: 0
 right: 10

---- exact_rerank_costs_exactly_one_more_round stdout ----

thread 'exact_rerank_costs_exactly_one_more_round' panicked at crates/pstore-index/tests/persisted.rs:151:5:
assertion `left == right` failed: exact took 1 rounds
  left: 1
 right: 2

---- a_corrupt_centroid_table_is_refused_not_guessed stdout ----

thread 'a_corrupt_centroid_table_is_refused_not_guessed' panicked at crates/pstore-index/tests/persisted.rs:356:5:
assertion failed: !idx.is_clustered()

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    a_corrupt_centroid_table_is_refused_not_guessed
    a_rung_zero_query_reads_no_int8_or_float_bytes
    exact_rerank_costs_exactly_one_more_round
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 3 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.49s

*** result: Failure(101)
