*** crates/pstore-index/src/vec_index.rs:115:42: replace * with + in Centroids::decode

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace * with + in Centroids::decode
@@ -107,17 +107,17 @@
     /// spans pointing at the wrong rows — a wrong answer rather than an error.
     #[must_use]
     pub fn decode(raw: &[u8]) -> Option<Self> {
         let n = u32::from_le_bytes(raw.get(0..4)?.try_into().ok()?) as usize;
         let dim = u32::from_le_bytes(raw.get(4..8)?.try_into().ok()?) as usize;
         let mut at: usize = 8;
         let mut vectors = Vec::with_capacity(n);
         for _ in 0..n {
-            let end = at.checked_add(dim * 4)?;
+            let end = at.checked_add(dim + /* ~ changed by cargo-mutants ~ */ 4)?;
             let v = raw
                 .get(at..end)?
                 .chunks_exact(4)
                 .map(|b| f32::from_le_bytes(b.try_into().unwrap_or([0; 4])))
                 .collect();
             vectors.push(v);
             at = end;
         }

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at crates/pstore-index/tests/persisted.rs:269:6:
called `Result::unwrap()` on an `Err` value: Blob("range 16143041649..101642042465 outside object of 221683 bytes")

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:117:14:
called `Result::unwrap()` on an `Err` value: Blob("range 16303728632..101919960776 outside object of 220970 bytes")

---- exact_rerank_costs_exactly_one_more_round stdout ----

thread 'exact_rerank_costs_exactly_one_more_round' panicked at crates/pstore-index/tests/persisted.rs:150:6:
called `Result::unwrap()` on an `Err` value: Blob("range 16107914345..458319665769 outside object of 215275 bytes")

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    a_rung_zero_query_reads_no_int8_or_float_bytes
    exact_rerank_costs_exactly_one_more_round
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.55s

*** result: Failure(101)
