*** crates/pstore-index/src/vec_index.rs:159:44: replace < with > in build

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace < with > in build
@@ -151,17 +151,17 @@
 /// ⚠️ **One switch, at one place.** Below the threshold no centroid object is written at
 /// all — not an empty one — so "is this index clustered?" is answered by whether the object
 /// exists, and there is no second code path that could disagree with the first.
 #[must_use]
 pub fn build(docs: &[Document], params: Params) -> Built {
     let dim = docs.first().map_or(0, |d| d.vector.len());
     let quantizer = Quantizer::new(dim.max(1));
 
-    let (order, centroids) = if docs.len() < params.exact_scan_threshold || dim == 0 {
+    let (order, centroids) = if docs.len() > /* ~ changed by cargo-mutants ~ */ params.exact_scan_threshold || dim == 0 {
         ((0..docs.len()).collect::<Vec<_>>(), None)
     } else {
         let corpus: Vec<Vec<f32>> = docs.iter().map(|d| d.vector.clone()).collect();
         let c = Clustering::build(&corpus, params);
         // ⚠️ Rows are written in LIST order, so a posting list is one contiguous byte range
         // and a probe is one ranged read rather than a scatter of thousands.
         let mut order = Vec::with_capacity(docs.len());
         let mut spans = Vec::with_capacity(c.lists().len());

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at crates/pstore-index/tests/persisted.rs:271:5:
assertion `left == right` failed: rung 0 read full-precision bytes
  left: 153600
 right: 0

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:101:5:
assertion failed: idx.is_clustered()

---- a_small_index_answers_exactly_and_builds_no_index stdout ----

thread 'a_small_index_answers_exactly_and_builds_no_index' panicked at crates/pstore-index/tests/persisted.rs:288:5:
a small index built centroids

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    a_rung_zero_query_reads_no_int8_or_float_bytes
    a_small_index_answers_exactly_and_builds_no_index
    exact_rerank_costs_exactly_one_more_round
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes
    the_threshold_is_the_only_thing_that_switches_paths

test result: FAILED. 2 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
