*** crates/pstore-index/src/vec_index.rs:159:81: replace == with != in build

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace == with != in build
@@ -151,17 +151,17 @@
 /// ⚠️ **One switch, at one place.** Below the threshold no centroid object is written at
 /// all — not an empty one — so "is this index clustered?" is answered by whether the object
 /// exists, and there is no second code path that could disagree with the first.
 #[must_use]
 pub fn build(docs: &[Document], params: Params) -> Built {
     let dim = docs.first().map_or(0, |d| d.vector.len());
     let quantizer = Quantizer::new(dim.max(1));
 
-    let (order, centroids) = if docs.len() < params.exact_scan_threshold || dim == 0 {
+    let (order, centroids) = if docs.len() < params.exact_scan_threshold || dim != /* ~ changed by cargo-mutants ~ */ 0 {
         ((0..docs.len()).collect::<Vec<_>>(), None)
     } else {
         let corpus: Vec<Vec<f32>> = docs.iter().map(|d| d.vector.clone()).collect();
         let c = Clustering::build(&corpus, params);
         // ⚠️ Rows are written in LIST order, so a posting list is one contiguous byte range
         // and a probe is one ranged read rather than a scatter of thousands.
         let mut order = Vec::with_capacity(docs.len());
         let mut spans = Vec::with_capacity(c.lists().len());

---- the_threshold_is_the_only_thing_that_switches_paths stdout ----

thread 'the_threshold_is_the_only_thing_that_switches_paths' panicked at crates/pstore-index/tests/persisted.rs:327:5:
one row at the threshold did not cluster

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:101:5:
assertion failed: idx.is_clustered()

---- exact_rerank_costs_exactly_one_more_round stdout ----

thread 'exact_rerank_costs_exactly_one_more_round' panicked at crates/pstore-index/tests/persisted.rs:151:5:
assertion `left == right` failed: exact took 1 rounds
  left: 1
 right: 2

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    a_rung_zero_query_reads_no_int8_or_float_bytes
    exact_rerank_costs_exactly_one_more_round
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes
    the_threshold_is_the_only_thing_that_switches_paths

test result: FAILED. 3 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
