*** crates/pstore-index/src/vec_index.rs:188:40: replace + with - in build

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace + with - in build
@@ -180,17 +180,17 @@
 
     let mut w = SegmentWriter::new(64);
     let mut rabitq = Vec::new();
     let mut eights = Vec::new();
     // The centroid a row is coded against: its own list's, or the origin when unclustered.
     let mut home: Vec<usize> = vec![usize::MAX; docs.len()];
     if let Some(c) = &centroids {
         for (li, (first, len)) in c.spans.iter().enumerate() {
-            for slot in *first..*first + *len {
+            for slot in *first..*first - /* ~ changed by cargo-mutants ~ */ *len {
                 if let Some(row) = order.get(slot as usize)
                     && let Some(slot) = home.get_mut(*row)
                 {
                     *slot = li;
                 }
             }
         }
     }

---- the_threshold_is_the_only_thing_that_switches_paths stdout ----

thread 'the_threshold_is_the_only_thing_that_switches_paths' panicked at crates/pstore-index/src/vec_index.rs:188:33:
attempt to subtract with overflow

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at crates/pstore-index/src/vec_index.rs:188:33:
attempt to subtract with overflow

---- exact_rerank_costs_exactly_one_more_round stdout ----

thread 'exact_rerank_costs_exactly_one_more_round' panicked at crates/pstore-index/src/vec_index.rs:188:33:
attempt to subtract with overflow

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    a_corrupt_centroid_table_is_refused_not_guessed
    a_rung_zero_query_reads_no_int8_or_float_bytes
    exact_rerank_costs_exactly_one_more_round
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes
    the_threshold_is_the_only_thing_that_switches_paths

test result: FAILED. 2 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.86s

*** result: Failure(101)
