*** crates/pstore-index/src/vec_index.rs:188:40: replace + with * in build

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace + with * in build
@@ -180,17 +180,17 @@
 
     let mut w = SegmentWriter::new(64);
     let mut rabitq = Vec::new();
     let mut eights = Vec::new();
     // The centroid a row is coded against: its own list's, or the origin when unclustered.
     let mut home: Vec<usize> = vec![usize::MAX; docs.len()];
     if let Some(c) = &centroids {
         for (li, (first, len)) in c.spans.iter().enumerate() {
-            for slot in *first..*first + *len {
+            for slot in *first..*first * /* ~ changed by cargo-mutants ~ */ *len {
                 if let Some(row) = order.get(slot as usize)
                     && let Some(slot) = home.get_mut(*row)
                 {
                     *slot = li;
                 }
             }
         }
     }

*** result: Success
