*** crates/pstore-index/src/vec_index.rs:256:9: replace VecIndex::is_clustered -> bool with true

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace VecIndex::is_clustered -> bool with true
@@ -248,17 +248,17 @@
             centroids: cen.ok().and_then(|b| Centroids::decode(b.as_ref())),
             dim,
         })
     }
 
     /// Whether this index has a clustered structure, or is scanned exactly.
     #[must_use]
     pub fn is_clustered(&self) -> bool {
-        self.centroids.is_some()
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// The opened segment.
     #[must_use]
     pub fn segment(&self) -> &Segment {
         &self.segment
     }

---- a_small_index_answers_exactly_and_builds_no_index stdout ----

thread 'a_small_index_answers_exactly_and_builds_no_index' panicked at crates/pstore-index/tests/persisted.rs:297:5:
assertion failed: !idx.is_clustered()

---- a_corrupt_centroid_table_is_refused_not_guessed stdout ----

thread 'a_corrupt_centroid_table_is_refused_not_guessed' panicked at crates/pstore-index/tests/persisted.rs:356:5:
assertion failed: !idx.is_clustered()

failures:
    a_corrupt_centroid_table_is_refused_not_guessed
    a_small_index_answers_exactly_and_builds_no_index

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.52s

*** result: Failure(101)
