*** crates/pstore-index/src/vec_index.rs:256:9: replace VecIndex::is_clustered -> bool with false

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace VecIndex::is_clustered -> bool with false
@@ -248,17 +248,17 @@
             centroids: cen.ok().and_then(|b| Centroids::decode(b.as_ref())),
             dim,
         })
     }
 
     /// Whether this index has a clustered structure, or is scanned exactly.
     #[must_use]
     pub fn is_clustered(&self) -> bool {
-        self.centroids.is_some()
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// The opened segment.
     #[must_use]
     pub fn segment(&self) -> &Segment {
         &self.segment
     }

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:101:5:
assertion failed: idx.is_clustered()

failures:
    a_clustered_query_costs_two_round_trips_beyond_head

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.60s

*** result: Failure(101)
