*** crates/pstore-index/src/vec_index.rs:273:9: replace VecIndex::search -> Result<Vec<(usize, f32)>, pstore_format::FormatError> with Ok(vec![(0, -1.0)])

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace VecIndex::search -> Result<Vec<(usize, f32)>, pstore_format::FormatError> with Ok(vec![(0, -1.0)])
@@ -265,131 +265,15 @@
     /// Nearest neighbours. **One further round trip**, whatever `p` is.
     pub async fn search<S: BlobStore>(
         &self,
         store: &S,
         key: &Key,
         query: &[f32],
         q: Query,
     ) -> Result<Vec<(usize, f32)>, pstore_format::FormatError> {
-        let quantizer = Quantizer::new(self.dim.max(1));
-        let Some(centroids) = &self.centroids else {
-            // D-10: no index, so read the vectors and be exactly right.
-            let vectors = self.segment.vectors(store, key).await?;
-            let mut scored: Vec<(usize, f32)> = vectors
-                .iter()
-                .enumerate()
-                .map(|(i, v)| (i, dot(v, query)))
-                .collect();
-            scored.sort_by(|a, b| b.1.total_cmp(&a.1).then_with(|| a.0.cmp(&b.0)));
-            scored.truncate(q.k);
-            return Ok(scored);
-        };
-
-        let clustering = Clustering::from_parts(centroids.vectors.clone(), Vec::new());
-        let probes = search::probe(&clustering, query, q.p);
-        let code_len = quantizer.code_len();
-        let (Some(rabitq), Some(sq8_span)) = (
-            self.segment.section(Section::RaBitQ),
-            self.segment.section(Section::Sq8),
-        ) else {
-            return Ok(Vec::new());
-        };
-
-        // ⚠️ The rabitq AND sq8 ranges for every probed list, issued in ONE call. That is
-        // what keeps `rerank: fast` inside three round trips: both spans are known the
-        // moment the probe set is, so int8 costs bytes rather than a fourth hop.
-        let mut ranges = Vec::with_capacity(probes.len() * 2);
-        let mut rows = Vec::with_capacity(probes.len());
-        for li in &probes {
-            let Some((first, len)) = centroids.spans.get(*li).copied() else {
-                continue;
-            };
-            let (first, len) = (first as u64, len as u64);
-            ranges.push(
-                rabitq.start + first * code_len as u64
-                    ..rabitq.start + (first + len) * code_len as u64,
-            );
-            rows.push((*li, first, len));
-        }
-        let want_sq8 = q.rerank != Rerank::None;
-        if want_sq8 {
-            let per = sq8::record_len(self.dim) as u64;
-            for (_, first, len) in &rows {
-                ranges.push(sq8_span.start + first * per..sq8_span.start + (first + len) * per);
-            }
-        }
-        let bufs = store.get_ranges(key, &ranges).await?;
-
-        let Ok(prepared) = quantizer.prepare(query) else {
-            return Err(pstore_format::FormatError::DimensionMismatch {
-                expected: self.dim,
-                got: query.len(),
-            });
-        };
-        // One `<c, q>` per probed list, not per candidate.
-        let dots: Vec<f32> = rows
-            .iter()
-            .map(|(li, _, _)| centroids.vectors.get(*li).map_or(0.0, |c| dot(c, query)))
-            .collect();
-
-        let mut scored: Vec<(usize, f32)> = Vec::new();
-        for (n, (_, first, len)) in rows.iter().enumerate() {
-            let Some(buf) = bufs.get(n) else { continue };
-            for i in 0..*len as usize {
-                let Some(raw) = buf.get(i * code_len..(i + 1) * code_len) else {
-                    continue;
-                };
-                let Some(code) = quantizer.read_code(raw) else {
-                    continue;
-                };
-                let row = *first as usize + i;
-                scored.push((
-                    row,
-                    quantizer.estimate_residual(
-                        &code,
-                        &prepared,
-                        dots.get(n).copied().unwrap_or(0.0),
-                    ),
-                ));
-            }
-        }
-
-        let ladder = Ladder::new(q.k, q.oversample);
-        let top = ladder.rung0(scored);
-        Ok(match q.rerank {
-            Rerank::None => top.into_iter().take(q.k).collect(),
-            Rerank::Fast => {
-                let per = sq8::record_len(self.dim);
-                let refined = ladder.rung1(&top, |row| {
-                    // Find the fetched sq8 buffer holding this row.
-                    rows.iter()
-                        .enumerate()
-                        .find(|(_, (_, first, len))| {
-                            row >= *first as usize && row < (*first + *len) as usize
-                        })
-                        .and_then(|(n, (_, first, _))| {
-                            let buf = bufs.get(rows.len() + n)?;
-                            let i = row - *first as usize;
-                            let raw = buf.get(i * per..(i + 1) * per)?;
-                            Some(sq8::estimate_raw(raw, query))
-                        })
-                        .unwrap_or(f32::NEG_INFINITY)
-                });
-                refined.into_iter().take(q.k).collect()
-            }
-            Rerank::Exact => {
-                // The fourth round trip, and only here: which float32 rows to read cannot
-                // be known until rung 0 has ranked.
-                let vectors = self.segment.vectors(store, key).await?;
-                ladder.rung2(&top, |row| {
-                    vectors
-                        .get(row)
-                        .map_or(f32::NEG_INFINITY, |v| dot(v, query))
-                })
-            }
-        })
+        Ok(vec![(0, -1.0)]) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn dot(a: &[f32], b: &[f32]) -> f32 {
     a.iter().zip(b).map(|(x, y)| x * y).sum()
 }

---- a_small_index_answers_exactly_and_builds_no_index stdout ----

thread 'a_small_index_answers_exactly_and_builds_no_index' panicked at crates/pstore-index/tests/persisted.rs:313:5:
assertion `left == right` failed: an exactly-scanned index was not exact
  left: [0]
 right: [42, 102, 122, 62, 72, 2, 22, 112, 12, 32]

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:118:9:
assertion `left == right` failed
  left: 1
 right: 10

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at crates/pstore-index/tests/persisted.rs:277:5:
assertion failed: s.bytes_in(&key, idx.segment().section(Section::RaBitQ).unwrap()) > 0

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    a_rung_zero_query_reads_no_int8_or_float_bytes
    a_small_index_answers_exactly_and_builds_no_index
    exact_rerank_costs_exactly_one_more_round
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 3 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.44s

*** result: Failure(101)
