*** crates/pstore-index/src/vec_index.rs:308:30: replace + with - in VecIndex::search

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace + with - in VecIndex::search
@@ -300,17 +300,17 @@
         let mut ranges = Vec::with_capacity(probes.len() * 2);
         let mut rows = Vec::with_capacity(probes.len());
         for li in &probes {
             let Some((first, len)) = centroids.spans.get(*li).copied() else {
                 continue;
             };
             let (first, len) = (first as u64, len as u64);
             ranges.push(
-                rabitq.start + first * code_len as u64
+                rabitq.start - /* ~ changed by cargo-mutants ~ */ first * code_len as u64
                     ..rabitq.start + (first + len) * code_len as u64,
             );
             rows.push((*li, first, len));
         }
         let want_sq8 = q.rerank != Rerank::None;
         if want_sq8 {
             let per = sq8::record_len(self.dim) as u64;
             for (_, first, len) in &rows {

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at crates/pstore-index/tests/persisted.rs:271:5:
assertion `left == right` failed: rung 0 read full-precision bytes
  left: 9520
 right: 0

---- probing_more_lists_costs_bytes_not_depth stdout ----

thread 'probing_more_lists_costs_bytes_not_depth' panicked at crates/pstore-index/tests/persisted.rs:213:5:
p=64 moved 107384 bytes against p=4's 46728: probing wider is not costing bytes, so it is probably not probing wider

failures:
    a_rung_zero_query_reads_no_int8_or_float_bytes
    probing_more_lists_costs_bytes_not_depth

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.66s

*** result: Failure(101)
