*** crates/pstore-index/src/vec_index.rs:308:30: replace + with * in VecIndex::search

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace + with * in VecIndex::search
@@ -300,17 +300,17 @@
         let mut ranges = Vec::with_capacity(probes.len() * 2);
         let mut rows = Vec::with_capacity(probes.len());
         for li in &probes {
             let Some((first, len)) = centroids.spans.get(*li).copied() else {
                 continue;
             };
             let (first, len) = (first as u64, len as u64);
             ranges.push(
-                rabitq.start + first * code_len as u64
+                rabitq.start * /* ~ changed by cargo-mutants ~ */ first * code_len as u64
                     ..rabitq.start + (first + len) * code_len as u64,
             );
             rows.push((*li, first, len));
         }
         let want_sq8 = q.rerank != Rerank::None;
         if want_sq8 {
             let per = sq8::record_len(self.dim) as u64;
             for (_, first, len) in &rows {

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at crates/pstore-index/tests/persisted.rs:271:5:
assertion `left == right` failed: rung 0 read full-precision bytes
  left: 159232
 right: 0

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:404:5:
`fast` found 12 of the true neighbours against `none`'s 15: the int8 rung is costing a section of every segment and buying nothing

failures:
    a_rung_zero_query_reads_no_int8_or_float_bytes
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.48s

*** result: Failure(101)
