*** crates/pstore-index/src/vec_index.rs:313:33: replace != with == in VecIndex::search

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace != with == in VecIndex::search
@@ -305,17 +305,17 @@
             };
             let (first, len) = (first as u64, len as u64);
             ranges.push(
                 rabitq.start + first * code_len as u64
                     ..rabitq.start + (first + len) * code_len as u64,
             );
             rows.push((*li, first, len));
         }
-        let want_sq8 = q.rerank != Rerank::None;
+        let want_sq8 = q.rerank == /* ~ changed by cargo-mutants ~ */ Rerank::None;
         if want_sq8 {
             let per = sq8::record_len(self.dim) as u64;
             for (_, first, len) in &rows {
                 ranges.push(sq8_span.start + first * per..sq8_span.start + (first + len) * per);
             }
         }
         let bufs = store.get_ranges(key, &ranges).await?;

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at crates/pstore-index/tests/persisted.rs:276:5:
assertion `left == right` failed: rung 0 read int8 bytes
  left: 44784
 right: 0

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:404:5:
`fast` found 0 of the true neighbours against `none`'s 26: the int8 rung is costing a section of every segment and buying nothing

failures:
    a_rung_zero_query_reads_no_int8_or_float_bytes
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.39s

*** result: Failure(101)
