*** crates/pstore-index/src/vec_index.rs:317:44: replace + with - in VecIndex::search

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace + with - in VecIndex::search
@@ -309,17 +309,17 @@
                     ..rabitq.start + (first + len) * code_len as u64,
             );
             rows.push((*li, first, len));
         }
         let want_sq8 = q.rerank != Rerank::None;
         if want_sq8 {
             let per = sq8::record_len(self.dim) as u64;
             for (_, first, len) in &rows {
-                ranges.push(sq8_span.start + first * per..sq8_span.start + (first + len) * per);
+                ranges.push(sq8_span.start - /* ~ changed by cargo-mutants ~ */ first * per..sq8_span.start + (first + len) * per);
             }
         }
         let bufs = store.get_ranges(key, &ranges).await?;
 
         let Ok(prepared) = quantizer.prepare(query) else {
             return Err(pstore_format::FormatError::DimensionMismatch {
                 expected: self.dim,
                 got: query.len(),

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:404:5:
`fast` found 6 of the true neighbours against `none`'s 26: the int8 rung is costing a section of every segment and buying nothing

---- probing_more_lists_costs_bytes_not_depth stdout ----

thread 'probing_more_lists_costs_bytes_not_depth' panicked at crates/pstore-index/tests/persisted.rs:213:5:
p=64 moved 195840 bytes against p=4's 194400: probing wider is not costing bytes, so it is probably not probing wider

failures:
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.24s

*** result: Failure(101)
