*** crates/pstore-index/src/vec_index.rs:338:43: replace * with / in VecIndex::search

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace * with / in VecIndex::search
@@ -330,17 +330,17 @@
             .iter()
             .map(|(li, _, _)| centroids.vectors.get(*li).map_or(0.0, |c| dot(c, query)))
             .collect();
 
         let mut scored: Vec<(usize, f32)> = Vec::new();
         for (n, (_, first, len)) in rows.iter().enumerate() {
             let Some(buf) = bufs.get(n) else { continue };
             for i in 0..*len as usize {
-                let Some(raw) = buf.get(i * code_len..(i + 1) * code_len) else {
+                let Some(raw) = buf.get(i / /* ~ changed by cargo-mutants ~ */ code_len..(i + 1) * code_len) else {
                     continue;
                 };
                 let Some(code) = quantizer.read_code(raw) else {
                     continue;
                 };
                 let row = *first as usize + i;
                 scored.push((
                     row,

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:404:5:
`fast` found 2 of the true neighbours against `none`'s 2: the int8 rung is costing a section of every segment and buying nothing

failures:
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.08s

*** result: Failure(101)
