*** crates/pstore-index/src/vec_index.rs:338:63: replace * with + in VecIndex::search

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace * with + in VecIndex::search
@@ -330,17 +330,17 @@
             .iter()
             .map(|(li, _, _)| centroids.vectors.get(*li).map_or(0.0, |c| dot(c, query)))
             .collect();
 
         let mut scored: Vec<(usize, f32)> = Vec::new();
         for (n, (_, first, len)) in rows.iter().enumerate() {
             let Some(buf) = bufs.get(n) else { continue };
             for i in 0..*len as usize {
-                let Some(raw) = buf.get(i * code_len..(i + 1) * code_len) else {
+                let Some(raw) = buf.get(i * code_len..(i + 1) + /* ~ changed by cargo-mutants ~ */ code_len) else {
                     continue;
                 };
                 let Some(code) = quantizer.read_code(raw) else {
                     continue;
                 };
                 let row = *first as usize + i;
                 scored.push((
                     row,

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:118:9:
assertion `left == right` failed
  left: 0
 right: 10

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:404:5:
`fast` found 0 of the true neighbours against `none`'s 0: the int8 rung is costing a section of every segment and buying nothing

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.36s

*** result: Failure(101)
