*** crates/pstore-index/src/vec_index.rs:344:43: replace + with - in VecIndex::search

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace + with - in VecIndex::search
@@ -336,17 +336,17 @@
             let Some(buf) = bufs.get(n) else { continue };
             for i in 0..*len as usize {
                 let Some(raw) = buf.get(i * code_len..(i + 1) * code_len) else {
                     continue;
                 };
                 let Some(code) = quantizer.read_code(raw) else {
                     continue;
                 };
-                let row = *first as usize + i;
+                let row = *first as usize - /* ~ changed by cargo-mutants ~ */ i;
                 scored.push((
                     row,
                     quantizer.estimate_residual(
                         &code,
                         &prepared,
                         dots.get(n).copied().unwrap_or(0.0),
                     ),
                 ));

---- exact_rerank_costs_exactly_one_more_round stdout ----

thread 'exact_rerank_costs_exactly_one_more_round' panicked at /tmp/cargo-mutants-pstore-FkDeYx.tmp/crates/pstore-index/src/vec_index.rs:344:27:
attempt to subtract with overflow

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at /tmp/cargo-mutants-pstore-FkDeYx.tmp/crates/pstore-index/src/vec_index.rs:344:27:
attempt to subtract with overflow

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at /tmp/cargo-mutants-pstore-FkDeYx.tmp/crates/pstore-index/src/vec_index.rs:344:27:
attempt to subtract with overflow

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    a_rung_zero_query_reads_no_int8_or_float_bytes
    exact_rerank_costs_exactly_one_more_round
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.33s

*** result: Failure(101)
