*** crates/pstore-index/src/vec_index.rs:371:41: replace - with + in VecIndex::search

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace - with + in VecIndex::search
@@ -363,17 +363,17 @@
                     // Find the fetched sq8 buffer holding this row.
                     rows.iter()
                         .enumerate()
                         .find(|(_, (_, first, len))| {
                             row >= *first as usize && row < (*first + *len) as usize
                         })
                         .and_then(|(n, (_, first, _))| {
                             let buf = bufs.get(rows.len() + n)?;
-                            let i = row - *first as usize;
+                            let i = row + /* ~ changed by cargo-mutants ~ */ *first as usize;
                             let raw = buf.get(i * per..(i + 1) * per)?;
                             Some(sq8::estimate_raw(raw, query))
                         })
                         .unwrap_or(f32::NEG_INFINITY)
                 });
                 refined.into_iter().take(q.k).collect()
             }
             Rerank::Exact => {

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:404:5:
`fast` found 0 of the true neighbours against `none`'s 26: the int8 rung is costing a section of every segment and buying nothing

failures:
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.06s

*** result: Failure(101)
