*** crates/pstore-index/src/vec_index.rs:394:36: replace * with / in dot

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace * with / in dot
@@ -386,10 +386,10 @@
                         .map_or(f32::NEG_INFINITY, |v| dot(v, query))
                 })
             }
         })
     }
 }
 
 fn dot(a: &[f32], b: &[f32]) -> f32 {
-    a.iter().zip(b).map(|(x, y)| x * y).sum()
+    a.iter().zip(b).map(|(x, y)| x / /* ~ changed by cargo-mutants ~ */ y).sum()
 }

---- a_small_index_answers_exactly_and_builds_no_index stdout ----

thread 'a_small_index_answers_exactly_and_builds_no_index' panicked at crates/pstore-index/tests/persisted.rs:313:5:
assertion `left == right` failed: an exactly-scanned index was not exact
  left: [100, 140, 10, 20, 0, 120, 39, 146, 70, 26]
 right: [42, 102, 122, 62, 72, 2, 22, 112, 12, 32]

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:411:5:
`exact` found 5 against `fast`'s 40

failures:
    a_small_index_answers_exactly_and_builds_no_index
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.48s

*** result: Failure(101)
