*** crates/pstore-index/src/vec_index.rs:88:9: replace Centroids::encode -> Vec<u8> with vec![1]

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace Centroids::encode -> Vec<u8> with vec![1]
@@ -80,30 +80,17 @@
     /// `(first_row, len)` per posting list, into the segment's row order.
     pub spans: Vec<(u32, u32)>,
 }
 
 impl Centroids {
     /// Encodes the table.
     #[must_use]
     pub fn encode(&self) -> Vec<u8> {
-        let dim = self.vectors.first().map_or(0, Vec::len);
-        let mut out = Vec::with_capacity(8 + self.vectors.len() * (dim * 4 + 8));
-        out.extend_from_slice(&(self.vectors.len() as u32).to_le_bytes());
-        out.extend_from_slice(&(dim as u32).to_le_bytes());
-        for v in &self.vectors {
-            for x in v {
-                out.extend_from_slice(&x.to_le_bytes());
-            }
-        }
-        for (first, len) in &self.spans {
-            out.extend_from_slice(&first.to_le_bytes());
-            out.extend_from_slice(&len.to_le_bytes());
-        }
-        out
+        vec![1] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Decodes a table, returning `None` for anything malformed.
     ///
     /// A short or ragged table would otherwise produce centroids of the wrong dimension and
     /// spans pointing at the wrong rows — a wrong answer rather than an error.
     #[must_use]
     pub fn decode(raw: &[u8]) -> Option<Self> {

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:101:5:
assertion failed: idx.is_clustered()

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at crates/pstore-index/tests/persisted.rs:271:5:
assertion `left == right` failed: rung 0 read full-precision bytes
  left: 159232
 right: 0

---- exact_rerank_costs_exactly_one_more_round stdout ----

thread 'exact_rerank_costs_exactly_one_more_round' panicked at crates/pstore-index/tests/persisted.rs:151:5:
assertion `left == right` failed: exact took 1 rounds
  left: 1
 right: 2

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    a_rung_zero_query_reads_no_int8_or_float_bytes
    exact_rerank_costs_exactly_one_more_round
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.28s

*** result: Failure(101)
