*** crates/pstore-testkit/src/broken.rs:104:57: replace && with || in <impl BlobStore for Broken>::put_conditional

*** mutation diff:
--- crates/pstore-testkit/src/broken.rs
+++ replace && with || in <impl BlobStore for Broken>::put_conditional
@@ -96,17 +96,17 @@
     }
 
     async fn put_conditional(
         &self,
         key: &Key,
         body: Bytes,
         pre: Precondition,
     ) -> Result<PutOutcome, CasError> {
-        if self.defect == Defect::IgnoresCreateIfAbsent && pre == Precondition::NotExists {
+        if self.defect == Defect::IgnoresCreateIfAbsent || /* ~ changed by cargo-mutants ~ */ pre == Precondition::NotExists {
             return self
                 .inner
                 .put(key, body)
                 .await
                 .map_err(|e| CasError::Io(e.to_string()));
         }
         self.inner.put_conditional(key, body, pre).await
     }

---- the_suite_detects_each_defect_a_real_backend_actually_has stdout ----

thread 'the_suite_detects_each_defect_a_real_backend_actually_has' panicked at crates/pstore-testkit/tests/conformance.rs:163:9:
  left: 3
 right: 1

failures:
    the_suite_detects_each_defect_a_real_backend_actually_has

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
