*** crates/pstore-testkit/src/broken.rs:66:24: replace == with != in <impl BlobStore for Broken>::get_range

*** mutation diff:
--- crates/pstore-testkit/src/broken.rs
+++ replace == with != in <impl BlobStore for Broken>::get_range
@@ -58,17 +58,17 @@
         self.inner.capabilities()
     }
 
     async fn get(&self, key: &Key) -> Result<Bytes, BlobError> {
         self.inner.get(key).await
     }
 
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
-        if self.defect == Defect::ShortReadsPastTheEnd {
+        if self.defect != /* ~ changed by cargo-mutants ~ */ Defect::ShortReadsPastTheEnd {
             let body = self.inner.get(key).await?;
             let start = (range.start as usize).min(body.len());
             let end = (range.end as usize).min(body.len());
             return Ok(body.slice(start..end));
         }
         self.inner.get_range(key, range).await
     }

---- the_suite_detects_each_defect_a_real_backend_actually_has stdout ----

thread 'the_suite_detects_each_defect_a_real_backend_actually_has' panicked at crates/pstore-testkit/tests/conformance.rs:163:9:
  left: 2
 right: 1

failures:
    the_suite_detects_each_defect_a_real_backend_actually_has

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
