*** crates/pstore-testkit/src/broken.rs:66:9: replace <impl BlobStore for Broken>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-testkit/src/broken.rs
+++ replace <impl BlobStore for Broken>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -58,23 +58,17 @@
         self.inner.capabilities()
     }
 
     async fn get(&self, key: &Key) -> Result<Bytes, BlobError> {
         self.inner.get(key).await
     }
 
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
-        if self.defect == Defect::ShortReadsPastTheEnd {
-            let body = self.inner.get(key).await?;
-            let start = (range.start as usize).min(body.len());
-            let end = (range.end as usize).min(body.len());
-            return Ok(body.slice(start..end));
-        }
-        self.inner.get_range(key, range).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
         if self.defect == Defect::SuffixReturnsEverything {
             return self.inner.get(key).await;
         }
         self.inner.get_suffix(key, n).await
     }

---- a_broken_backend_still_declares_itself_healthy stdout ----

thread 'a_broken_backend_still_declares_itself_healthy' panicked at /home/tuong/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/bytes-1.12.1/src/bytes.rs:374:28:
range end out of bounds: 4 <= 0

---- a_broken_backend_forwards_everything_it_does_not_break stdout ----

thread 'a_broken_backend_forwards_everything_it_does_not_break' panicked at crates/pstore-testkit/tests/conformance.rs:194:5:
assertion `left == right` failed
  left: []
 right: [50, 51, 52]

---- the_suite_detects_each_defect_a_real_backend_actually_has stdout ----

thread 'the_suite_detects_each_defect_a_real_backend_actually_has' panicked at /home/tuong/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/bytes-1.12.1/src/bytes.rs:374:28:
range end out of bounds: 4 <= 0

failures:
    a_broken_backend_forwards_everything_it_does_not_break
    a_broken_backend_still_declares_itself_healthy
    the_suite_detects_each_defect_a_real_backend_actually_has

test result: FAILED. 5 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
