*** crates/pstore-testkit/src/broken.rs:76:24: replace == with != in <impl BlobStore for Broken>::get_suffix

*** mutation diff:
--- crates/pstore-testkit/src/broken.rs
+++ replace == with != in <impl BlobStore for Broken>::get_suffix
@@ -68,17 +68,17 @@
             let start = (range.start as usize).min(body.len());
             let end = (range.end as usize).min(body.len());
             return Ok(body.slice(start..end));
         }
         self.inner.get_range(key, range).await
     }
 
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
-        if self.defect == Defect::SuffixReturnsEverything {
+        if self.defect != /* ~ changed by cargo-mutants ~ */ Defect::SuffixReturnsEverything {
             return self.inner.get(key).await;
         }
         self.inner.get_suffix(key, n).await
     }
 
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, CasTag), BlobError> {
         self.inner.get_with_tag(key).await
     }

---- a_broken_backend_forwards_everything_it_does_not_break stdout ----

thread 'a_broken_backend_forwards_everything_it_does_not_break' panicked at crates/pstore-testkit/tests/conformance.rs:173:5:
assertion `left == right` failed
  left: [48, 49, 50, 51, 52, 53, 54, 55, 56, 57]
 right: [55, 56, 57]

---- the_suite_detects_each_defect_a_real_backend_actually_has stdout ----

thread 'the_suite_detects_each_defect_a_real_backend_actually_has' panicked at crates/pstore-testkit/tests/conformance.rs:141:9:
assertion `left == right` failed: IgnoresCreateIfAbsent tripped [Probe { name: "create_if_absent", outcome: Divergent("second create-if-absent succeeded; the wildcard precondition is ignored") }, Probe { name: "suffix_read", outcome: Divergent("a 4-byte suffix returned 10 bytes: \"0123456789\"") }]
  left: 2
 right: 1

failures:
    a_broken_backend_forwards_everything_it_does_not_break
    the_suite_detects_each_defect_a_real_backend_actually_has

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
