*** crates/pstore-testkit/src/broken.rs:87:9: replace <impl BlobStore for Broken>::get_tag -> Option<CasTag> with None

*** mutation diff:
--- crates/pstore-testkit/src/broken.rs
+++ replace <impl BlobStore for Broken>::get_tag -> Option<CasTag> with None
@@ -79,17 +79,17 @@
         self.inner.get_suffix(key, n).await
     }
 
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, CasTag), BlobError> {
         self.inner.get_with_tag(key).await
     }
 
     async fn get_tag(&self, key: &Key) -> Option<CasTag> {
-        self.inner.get_tag(key).await
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {
         self.inner.head(key).await
     }
 
     async fn put(&self, key: &Key, body: Bytes) -> Result<PutOutcome, BlobError> {
         self.inner.put(key, body).await

---- a_broken_backend_forwards_everything_it_does_not_break stdout ----

thread 'a_broken_backend_forwards_everything_it_does_not_break' panicked at crates/pstore-testkit/tests/conformance.rs:197:5:
assertion failed: s.get_tag(&k).await.is_some()

---- the_suite_detects_each_defect_a_real_backend_actually_has stdout ----

thread 'the_suite_detects_each_defect_a_real_backend_actually_has' panicked at crates/pstore-testkit/tests/conformance.rs:163:9:
assertion `left == right` failed: IgnoresCreateIfAbsent tripped [Probe { name: "create_if_absent", outcome: Divergent("second create-if-absent succeeded; the wildcard precondition is ignored") }, Probe { name: "get_tag", outcome: Divergent("an existing key reported no tag") }]
  left: 2
 right: 1

failures:
    a_broken_backend_forwards_everything_it_does_not_break
    the_suite_detects_each_defect_a_real_backend_actually_has

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
