*** crates/pstore-testkit/src/broken.rs:91:9: replace <impl BlobStore for Broken>::head -> Result<u64, BlobError> with Ok(0)

*** mutation diff:
--- crates/pstore-testkit/src/broken.rs
+++ replace <impl BlobStore for Broken>::head -> Result<u64, BlobError> with Ok(0)
@@ -83,17 +83,17 @@
         self.inner.get_with_tag(key).await
     }
 
     async fn get_tag(&self, key: &Key) -> Option<CasTag> {
         self.inner.get_tag(key).await
     }
 
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {
-        self.inner.head(key).await
+        Ok(0) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn put(&self, key: &Key, body: Bytes) -> Result<PutOutcome, BlobError> {
         self.inner.put(key, body).await
     }
 
     async fn put_conditional(
         &self,

---- a_broken_backend_forwards_everything_it_does_not_break stdout ----

thread 'a_broken_backend_forwards_everything_it_does_not_break' panicked at crates/pstore-testkit/tests/conformance.rs:196:5:
assertion `left == right` failed
  left: 0
 right: 10

failures:
    a_broken_backend_forwards_everything_it_does_not_break

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
