*** crates/pstore-testkit/src/conformance.rs:127:9: replace || with && in probe_aba_resistance

*** mutation diff:
--- crates/pstore-testkit/src/conformance.rs
+++ replace || with && in probe_aba_resistance
@@ -119,17 +119,17 @@
     let key = k(run, "aba");
     let Ok(v1) = s
         .put_conditional(&key, Bytes::from_static(b"v1"), Precondition::NotExists)
         .await
     else {
         return Support::Unsupported;
     };
     if s.put(&key, Bytes::from_static(b"v2")).await.is_err()
-        || s.put(&key, Bytes::from_static(b"v1")).await.is_err()
+        && /* ~ changed by cargo-mutants ~ */ s.put(&key, Bytes::from_static(b"v1")).await.is_err()
     {
         return Support::Unsupported;
     }
     match s
         .put_conditional(&key, Bytes::from_static(b"v3"), Precondition::Match(v1.tag))
         .await
     {
         Err(CasError::Lost) => Support::Supported,

---- a_report_names_what_diverged stdout ----

thread 'a_report_names_what_diverged' panicked at crates/pstore-testkit/tests/conformance.rs:95:5:
assertion `left == right` failed: expected exactly one divergence, got []
  left: 0
 right: 1

---- the_suite_detects_a_backend_that_is_not_fenced stdout ----

thread 'the_suite_detects_a_backend_that_is_not_fenced' panicked at crates/pstore-testkit/tests/conformance.rs:58:5:
an ABA-prone backend must not be reported as conforming

failures:
    a_report_names_what_diverged
    the_suite_detects_a_backend_that_is_not_fenced

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
