*** crates/pstore-testkit/src/conformance.rs:154:18: replace match guard &b[..] == b"234" with true in probe_ranged_read

*** mutation diff:
--- crates/pstore-testkit/src/conformance.rs
+++ replace match guard &b[..] == b"234" with true in probe_ranged_read
@@ -146,17 +146,17 @@
     let key = k(run, "range");
     if s.put(&key, Bytes::from_static(b"0123456789"))
         .await
         .is_err()
     {
         return Support::Unsupported;
     }
     match s.get_range(&key, 2..5).await {
-        Ok(b) if &b[..] == b"234" => Support::Supported,
+        Ok(b) if true /* ~ changed by cargo-mutants ~ */ => Support::Supported,
         Ok(b) => Support::Divergent(format!("range 2..5 returned {} bytes", b.len())),
         Err(e) => Support::Divergent(format!("ranged read failed: {e}")),
     }
 }
 
 async fn probe_range_past_end<S: BlobStore>(s: &S, run: u64) -> Support {
     let key = k(run, "past");
     if s.put(&key, Bytes::from_static(b"0123")).await.is_err() {

*** result: Success
