*** crates/pstore-testkit/src/conformance.rs:154:18: replace match guard &b[..] == b"234" with false in probe_ranged_read

*** mutation diff:
--- crates/pstore-testkit/src/conformance.rs
+++ replace match guard &b[..] == b"234" with false in probe_ranged_read
@@ -146,17 +146,17 @@
     let key = k(run, "range");
     if s.put(&key, Bytes::from_static(b"0123456789"))
         .await
         .is_err()
     {
         return Support::Unsupported;
     }
     match s.get_range(&key, 2..5).await {
-        Ok(b) if &b[..] == b"234" => Support::Supported,
+        Ok(b) if false /* ~ changed by cargo-mutants ~ */ => Support::Supported,
         Ok(b) => Support::Divergent(format!("range 2..5 returned {} bytes", b.len())),
         Err(e) => Support::Divergent(format!("ranged read failed: {e}")),
     }
 }
 
 async fn probe_range_past_end<S: BlobStore>(s: &S, run: u64) -> Support {
     let key = k(run, "past");
     if s.put(&key, Bytes::from_static(b"0123")).await.is_err() {

---- the_suite_detects_each_defect_a_real_backend_actually_has stdout ----

thread 'the_suite_detects_each_defect_a_real_backend_actually_has' panicked at crates/pstore-testkit/tests/conformance.rs:163:9:
assertion `left == right` failed: IgnoresCreateIfAbsent tripped [Probe { name: "create_if_absent", outcome: Divergent("second create-if-absent succeeded; the wildcard precondition is ignored") }, Probe { name: "ranged_read", outcome: Divergent("range 2..5 returned 3 bytes") }]
  left: 2
 right: 1

---- a_report_names_what_diverged stdout ----

thread 'a_report_names_what_diverged' panicked at crates/pstore-testkit/tests/conformance.rs:117:5:
  left: 2
 right: 1

---- the_memory_store_conforms stdout ----

thread 'the_memory_store_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:27:5:
divergences: [Probe { name: "ranged_read", outcome: Divergent("range 2..5 returned 3 bytes") }]

failures:
    a_report_names_what_diverged
    every_decorator_conforms
    the_memory_store_conforms
    the_suite_detects_each_defect_a_real_backend_actually_has

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
