*** crates/pstore-testkit/src/conformance.rs:185:18: replace != with == in probe_coalesced_read

*** mutation diff:
--- crates/pstore-testkit/src/conformance.rs
+++ replace != with == in probe_coalesced_read
@@ -177,17 +177,17 @@
         .is_err()
     {
         return Support::Unsupported;
     }
     let wanted = [0..4u64, 8..12, 250..256];
     let Ok(got) = s.get_ranges(&key, &wanted).await else {
         return Support::Divergent("get_ranges failed".to_owned());
     };
-    if got.len() != 3 {
+    if got.len() == /* ~ changed by cargo-mutants ~ */ 3 {
         return Support::Divergent(format!("expected 3 slices, got {}", got.len()));
     }
     for (i, r) in wanted.iter().enumerate() {
         let want_len = (r.end - r.start) as usize;
         match got.get(i) {
             Some(b) if b.len() == want_len => {}
             // Returning the merged buffer rather than each range's slice is the mutation
             // this catches, and a length-only check at the top level would miss it.

---- the_memory_store_conforms stdout ----

thread 'the_memory_store_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:25:5:
divergences: [Probe { name: "coalesced_read", outcome: Divergent("expected 3 slices, got 3") }]

---- a_report_names_what_diverged stdout ----

thread 'a_report_names_what_diverged' panicked at crates/pstore-testkit/tests/conformance.rs:95:5:
  left: 2
 right: 1

---- every_decorator_conforms stdout ----

thread 'every_decorator_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:35:5:
assertion failed: conformance::run(&acc.as_tenant(TenantId(1)), 2).await.conforms()

failures:
    a_report_names_what_diverged
    every_decorator_conforms
    the_memory_store_conforms
    the_suite_detects_each_defect_a_real_backend_actually_has

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
