*** crates/pstore-testkit/src/conformance.rs:189:31: replace - with / in probe_coalesced_read

*** mutation diff:
--- crates/pstore-testkit/src/conformance.rs
+++ replace - with / in probe_coalesced_read
@@ -181,17 +181,17 @@
     let wanted = [0..4u64, 8..12, 250..256];
     let Ok(got) = s.get_ranges(&key, &wanted).await else {
         return Support::Divergent("get_ranges failed".to_owned());
     };
     if got.len() != 3 {
         return Support::Divergent(format!("expected 3 slices, got {}", got.len()));
     }
     for (i, r) in wanted.iter().enumerate() {
-        let want_len = (r.end - r.start) as usize;
+        let want_len = (r.end / /* ~ changed by cargo-mutants ~ */ r.start) as usize;
         match got.get(i) {
             Some(b) if b.len() == want_len => {}
             // Returning the merged buffer rather than each range's slice is the mutation
             // this catches, and a length-only check at the top level would miss it.
             Some(b) => {
                 return Support::Divergent(format!(
                     "slice {i} was {} bytes, wanted {want_len}",
                     b.len()

---- a_report_names_what_diverged stdout ----

thread 'a_report_names_what_diverged' panicked at /tmp/cargo-mutants-pstore-LuBYam.tmp/crates/pstore-testkit/src/conformance.rs:189:24:
attempt to divide by zero

---- a_broken_backend_still_declares_itself_healthy stdout ----

thread 'a_broken_backend_still_declares_itself_healthy' panicked at /tmp/cargo-mutants-pstore-LuBYam.tmp/crates/pstore-testkit/src/conformance.rs:189:24:
attempt to divide by zero

---- conformance_costs_a_bounded_number_of_requests stdout ----

thread 'conformance_costs_a_bounded_number_of_requests' panicked at /tmp/cargo-mutants-pstore-LuBYam.tmp/crates/pstore-testkit/src/conformance.rs:189:24:
attempt to divide by zero

failures:
    a_broken_backend_still_declares_itself_healthy
    a_report_names_what_diverged
    conformance_costs_a_bounded_number_of_requests
    every_decorator_conforms
    the_memory_store_conforms
    the_suite_detects_a_backend_that_is_not_fenced
    the_suite_detects_each_defect_a_real_backend_actually_has

test result: FAILED. 1 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
