*** crates/pstore-testkit/src/conformance.rs:221:18: replace match guard &b[..] == b"6789" with false in probe_suffix_read

*** mutation diff:
--- crates/pstore-testkit/src/conformance.rs
+++ replace match guard &b[..] == b"6789" with false in probe_suffix_read
@@ -213,17 +213,17 @@
     let key = k(run, "suffix");
     if s.put(&key, Bytes::from_static(b"0123456789"))
         .await
         .is_err()
     {
         return Support::Unsupported;
     }
     match s.get_suffix(&key, 4).await {
-        Ok(b) if &b[..] == b"6789" => {}
+        Ok(b) if false /* ~ changed by cargo-mutants ~ */ => {}
         Ok(b) => {
             return Support::Divergent(format!(
                 "a 4-byte suffix returned {} bytes: {:?}",
                 b.len(),
                 String::from_utf8_lossy(&b)
             ));
         }
         Err(e) => return Support::Divergent(format!("suffix read failed: {e}")),

---- a_report_names_what_diverged stdout ----

thread 'a_report_names_what_diverged' panicked at crates/pstore-testkit/tests/conformance.rs:117:5:
  left: 2
 right: 1

---- every_decorator_conforms stdout ----

thread 'every_decorator_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:37:5:
assertion failed: conformance::run(&acc.as_tenant(TenantId(1)), 2).await.conforms()

---- the_memory_store_conforms stdout ----

thread 'the_memory_store_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:27:5:
divergences: [Probe { name: "suffix_read", outcome: Divergent("a 4-byte suffix returned 4 bytes: \"6789\"") }]

failures:
    a_report_names_what_diverged
    every_decorator_conforms
    the_memory_store_conforms
    the_suite_detects_each_defect_a_real_backend_actually_has

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
