*** crates/pstore-testkit/src/conformance.rs:308:30: replace == with != in run

*** mutation diff:
--- crates/pstore-testkit/src/conformance.rs
+++ replace == with != in run
@@ -300,17 +300,17 @@
         Probe {
             name: "batch_delete",
             outcome: probe_batch_delete(s, run_id).await,
         },
     ];
     let find = |n: &str| {
         probes
             .iter()
-            .find(|p| p.name == n)
+            .find(|p| p.name != /* ~ changed by cargo-mutants ~ */ n)
             .map_or(Support::Unsupported, |p| p.outcome.clone())
     };
     let declared = s.capabilities();
     Report {
         backend: declared.backend.clone(),
         observed: Capabilities {
             backend: declared.backend.clone(),
             // ⚠️ Taken from the PROBE, not from what the backend claims. That difference

---- a_broken_backend_still_declares_itself_healthy stdout ----

thread 'a_broken_backend_still_declares_itself_healthy' panicked at crates/pstore-testkit/tests/conformance.rs:179:5:
assertion failed: matches!(r.observed.create_if_absent, Support::Divergent(_))

failures:
    a_broken_backend_still_declares_itself_healthy

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
