*** crates/pstore-testkit/src/conformance.rs:36:46: replace == with != in Report::conforms

*** mutation diff:
--- crates/pstore-testkit/src/conformance.rs
+++ replace == with != in Report::conforms
@@ -28,17 +28,17 @@
     /// The capability profile derived from the probes — **not** from `capabilities()`.
     pub observed: Capabilities,
 }
 
 impl Report {
     /// Whether every probe behaved as the specification requires.
     #[must_use]
     pub fn conforms(&self) -> bool {
-        self.probes.iter().all(|p| p.outcome == Support::Supported)
+        self.probes.iter().all(|p| p.outcome != /* ~ changed by cargo-mutants ~ */ Support::Supported)
     }
 
     /// The probes that did not.
     #[must_use]
     pub fn divergences(&self) -> Vec<&Probe> {
         self.probes
             .iter()
             .filter(|p| p.outcome != Support::Supported)

---- the_memory_store_conforms stdout ----

thread 'the_memory_store_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:25:5:
divergences: []

---- every_decorator_conforms stdout ----

thread 'every_decorator_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:35:5:
assertion failed: conformance::run(&acc.as_tenant(TenantId(1)), 2).await.conforms()

failures:
    every_decorator_conforms
    the_memory_store_conforms

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
