*** crates/pstore-testkit/src/conformance.rs:44:35: replace != with == in Report::divergences

*** mutation diff:
--- crates/pstore-testkit/src/conformance.rs
+++ replace != with == in Report::divergences
@@ -36,17 +36,17 @@
         self.probes.iter().all(|p| p.outcome == Support::Supported)
     }
 
     /// The probes that did not.
     #[must_use]
     pub fn divergences(&self) -> Vec<&Probe> {
         self.probes
             .iter()
-            .filter(|p| p.outcome != Support::Supported)
+            .filter(|p| p.outcome == /* ~ changed by cargo-mutants ~ */ Support::Supported)
             .collect()
     }
 }
 
 fn k(run: u64, s: &str) -> Key {
     // Namespaced per run so a suite can be pointed at a shared bucket without two runs
     // colliding -- which is how this will be used against a real cloud in M0b.
     Key::new(format!("conformance/{run}/{s}"))

---- a_report_names_what_diverged stdout ----

thread 'a_report_names_what_diverged' panicked at crates/pstore-testkit/tests/conformance.rs:117:5:
  left: 9
 right: 1

---- the_suite_detects_each_defect_a_real_backend_actually_has stdout ----

thread 'the_suite_detects_each_defect_a_real_backend_actually_has' panicked at crates/pstore-testkit/tests/conformance.rs:163:9:
  left: 9
 right: 1

failures:
    a_report_names_what_diverged
    the_suite_detects_each_defect_a_real_backend_actually_has

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
