*** crates/pstore-testkit/src/depth.rs:100:9: replace <impl pstore_blob::BlobStore for DepthCounting<S>>::get -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-testkit/src/depth.rs
+++ replace <impl pstore_blob::BlobStore for DepthCounting<S>>::get -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -92,18 +92,17 @@
 
 #[async_trait::async_trait]
 impl<S: pstore_blob::BlobStore> pstore_blob::BlobStore for DepthCounting<S> {
     fn capabilities(&self) -> &Capabilities {
         self.inner.capabilities()
     }
 
     async fn get(&self, key: &Key) -> Result<Bytes, BlobError> {
-        let _g = self.begin_async().await;
-        self.inner.get(key).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
         let _g = self.begin_async().await;
         self.inner.get_range(key, range).await
     }
 
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, CasTag), BlobError> {

---- a_failed_request_still_counts stdout ----

thread 'a_failed_request_still_counts' panicked at crates/pstore-testkit/tests/depth.rs:53:5:
assertion failed: s.get(&k("absent")).await.is_err()

---- a_loop_that_awaits_each_result_counts_every_iteration stdout ----

thread 'a_loop_that_awaits_each_result_counts_every_iteration' panicked at crates/pstore-testkit/tests/depth.rs:29:5:
assertion `left == right` failed
  left: 0
 right: 4

---- concurrent_fan_out_counts_once stdout ----

thread 'concurrent_fan_out_counts_once' panicked at crates/pstore-testkit/tests/depth.rs:44:5:
assertion `left == right` failed
  left: 0
 right: 8

failures:
    a_failed_request_still_counts
    a_loop_that_awaits_each_result_counts_every_iteration
    concurrent_fan_out_counts_once
    the_depth_decorator_forwards_the_whole_contract

test result: FAILED. 2 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
