*** crates/pstore-testkit/src/depth.rs:115:9: replace <impl pstore_blob::BlobStore for DepthCounting<S>>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-testkit/src/depth.rs
+++ replace <impl pstore_blob::BlobStore for DepthCounting<S>>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -107,18 +107,17 @@
     }
 
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, CasTag), BlobError> {
         let _g = self.begin_async().await;
         self.inner.get_with_tag(key).await
     }
 
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
-        let _g = self.begin_async().await;
-        self.inner.get_suffix(key, n).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_tag(&self, key: &Key) -> Option<CasTag> {
         let _g = self.begin_async().await;
         self.inner.get_tag(key).await
     }
 
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {

---- every_decorator_conforms stdout ----

thread 'every_decorator_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:56:5:
assertion failed: conformance::run(&depth, 7).await.conforms()

failures:
    every_decorator_conforms

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
