*** crates/pstore-testkit/src/depth.rs:120:9: replace <impl pstore_blob::BlobStore for DepthCounting<S>>::get_tag -> Option<CasTag> with None

*** mutation diff:
--- crates/pstore-testkit/src/depth.rs
+++ replace <impl pstore_blob::BlobStore for DepthCounting<S>>::get_tag -> Option<CasTag> with None
@@ -112,18 +112,17 @@
     }
 
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
         let _g = self.begin_async().await;
         self.inner.get_suffix(key, n).await
     }
 
     async fn get_tag(&self, key: &Key) -> Option<CasTag> {
-        let _g = self.begin_async().await;
-        self.inner.get_tag(key).await
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {
         let _g = self.begin_async().await;
         self.inner.head(key).await
     }
 
     async fn put(&self, key: &Key, body: Bytes) -> Result<PutOutcome, BlobError> {

*** result: Success
