*** crates/pstore-testkit/src/depth.rs:145:9: replace <impl pstore_blob::BlobStore for DepthCounting<S>>::delete_batch -> Result<(), BlobError> with Ok(())

*** mutation diff:
--- crates/pstore-testkit/src/depth.rs
+++ replace <impl pstore_blob::BlobStore for DepthCounting<S>>::delete_batch -> Result<(), BlobError> with Ok(())
@@ -137,17 +137,16 @@
         body: Bytes,
         pre: Precondition,
     ) -> Result<PutOutcome, CasError> {
         let _g = self.begin_async().await;
         self.inner.put_conditional(key, body, pre).await
     }
 
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
-        let _g = self.begin_async().await;
-        self.inner.delete_batch(keys).await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn list_unrestricted(&self, prefix: &Key) -> Result<Vec<Key>, BlobError> {
         let _g = self.begin_async().await;
         self.inner.list_unrestricted(prefix).await
     }
 }

---- every_decorator_conforms stdout ----

thread 'every_decorator_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:56:5:
assertion failed: conformance::run(&depth, 7).await.conforms()

failures:
    every_decorator_conforms

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
