*** crates/pstore-testkit/src/depth.rs:150:9: replace <impl pstore_blob::BlobStore for DepthCounting<S>>::list_unrestricted -> Result<Vec<Key>, BlobError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-testkit/src/depth.rs
+++ replace <impl pstore_blob::BlobStore for DepthCounting<S>>::list_unrestricted -> Result<Vec<Key>, BlobError> with Ok(vec![])
@@ -142,12 +142,11 @@
     }
 
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
         let _g = self.begin_async().await;
         self.inner.delete_batch(keys).await
     }
 
     async fn list_unrestricted(&self, prefix: &Key) -> Result<Vec<Key>, BlobError> {
-        let _g = self.begin_async().await;
-        self.inner.list_unrestricted(prefix).await
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }

*** result: Success
