*** crates/pstore-testkit/src/depth.rs:60:9: replace DepthCounting<S>::requests -> usize with 1

*** mutation diff:
--- crates/pstore-testkit/src/depth.rs
+++ replace DepthCounting<S>::requests -> usize with 1
@@ -52,17 +52,17 @@
     #[must_use]
     pub fn depth(&self) -> usize {
         self.c.depth.load(Ordering::SeqCst)
     }
 
     /// Total requests, however issued. Depth's denominator, and the cost figure.
     #[must_use]
     pub fn requests(&self) -> usize {
-        self.c.requests.load(Ordering::SeqCst)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Clears both counters, so a test can measure one operation rather than a session.
     pub fn reset(&self) {
         self.c.depth.store(0, Ordering::SeqCst);
         self.c.requests.store(0, Ordering::SeqCst);
     }

---- concurrent_fan_out_counts_once stdout ----

thread 'concurrent_fan_out_counts_once' panicked at crates/pstore-testkit/tests/depth.rs:44:5:
assertion `left == right` failed
  left: 1
 right: 8

---- a_loop_that_awaits_each_result_counts_every_iteration stdout ----

thread 'a_loop_that_awaits_each_result_counts_every_iteration' panicked at crates/pstore-testkit/tests/depth.rs:30:5:
assertion `left == right` failed
  left: 1
 right: 4

---- reset_clears_both_counters stdout ----

thread 'reset_clears_both_counters' panicked at crates/pstore-testkit/tests/depth.rs:100:5:
assertion `left == right` failed
  left: 1
 right: 0

failures:
    a_loop_that_awaits_each_result_counts_every_iteration
    concurrent_fan_out_counts_once
    get_ranges_fans_out_rather_than_looping
    reset_clears_both_counters

test result: FAILED. 2 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
