*** crates/pstore-testkit/src/depth.rs:73:60: replace == with != in DepthCounting<S>::begin

*** mutation diff:
--- crates/pstore-testkit/src/depth.rs
+++ replace == with != in DepthCounting<S>::begin
@@ -65,17 +65,17 @@
         self.c.depth.store(0, Ordering::SeqCst);
         self.c.requests.store(0, Ordering::SeqCst);
     }
 
     fn begin(&self) -> Guard {
         self.c.requests.fetch_add(1, Ordering::SeqCst);
         // `fetch_add` returns the PREVIOUS value: zero means nothing was in flight, so
         // this request could not have been issued concurrently with another.
-        if self.c.in_flight.fetch_add(1, Ordering::SeqCst) == 0 {
+        if self.c.in_flight.fetch_add(1, Ordering::SeqCst) != /* ~ changed by cargo-mutants ~ */ 0 {
             self.c.depth.fetch_add(1, Ordering::SeqCst);
         }
         Guard(Arc::clone(&self.c))
     }
 
     /// Registers the request, then yields.
     ///
     /// ⚠️ The yield is the point. Against a synchronous backend every future completes

---- the_whole_flow_stays_inside_its_request_budget stdout ----

thread 'the_whole_flow_stays_inside_its_request_budget' panicked at crates/pstore-engine/tests/end_to_end.rs:138:9:
scan took 6 sequential round trips over 4 segments

failures:
    the_whole_flow_stays_inside_its_request_budget

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
