*** crates/pstore-testkit/src/flaky.rs:102:17: replace < with == in Flaky::refuse

*** mutation diff:
--- crates/pstore-testkit/src/flaky.rs
+++ replace < with == in Flaky::refuse
@@ -94,17 +94,17 @@
         }
         let mut z = self
             .state
             .fetch_add(0x9E37_79B9_7F4A_7C15, Ordering::Relaxed)
             .wrapping_add(0x9E37_79B9_7F4A_7C15);
         z = (z ^ (z >> 30)).wrapping_mul(0xBF58_476D_1CE4_E5B9);
         z = (z ^ (z >> 27)).wrapping_mul(0x94D0_49BB_1331_11EB);
         let draw = (z ^ (z >> 31)) >> 32;
-        if draw < self.rate {
+        if draw == /* ~ changed by cargo-mutants ~ */ self.rate {
             self.failures.fetch_add(1, Ordering::Relaxed);
             return true;
         }
         false
     }
 
     /// A store whose reads all fail.
     #[must_use]

---- a_cas_storm_still_converges stdout ----

thread 'a_cas_storm_still_converges' panicked at crates/pstore-engine/tests/linearizability.rs:215:5:
the storm injected no faults

failures:
    a_cas_storm_still_converges

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.50s

*** result: Failure(101)
