*** crates/pstore-testkit/src/flaky.rs:113:13: delete field reads_fail from struct Self expression in Flaky::refusing_reads

*** mutation diff:
--- crates/pstore-testkit/src/flaky.rs
+++ delete field reads_fail from struct Self expression in Flaky::refusing_reads
@@ -105,17 +105,17 @@
         }
         false
     }
 
     /// A store whose reads all fail.
     #[must_use]
     pub fn refusing_reads() -> Self {
         Self {
-            reads_fail: true,
+             /* ~ changed by cargo-mutants ~ */
             ..Self::refusing(&[])
         }
     }
 
     /// A store whose conditional writes are always `Contended`.
     #[must_use]
     pub fn always_contended() -> Self {
         Self {

*** result: Success
