*** crates/pstore-testkit/src/flaky.rs:122:13: delete field always_contended from struct Self expression in Flaky::always_contended

*** mutation diff:
--- crates/pstore-testkit/src/flaky.rs
+++ delete field always_contended from struct Self expression in Flaky::always_contended
@@ -114,17 +114,17 @@
             ..Self::refusing(&[])
         }
     }
 
     /// A store whose conditional writes are always `Contended`.
     #[must_use]
     pub fn always_contended() -> Self {
         Self {
-            always_contended: true,
+             /* ~ changed by cargo-mutants ~ */
             ..Self::refusing(&[])
         }
     }
 
     fn read_gate(&self) -> Result<(), BlobError> {
         if self.reads_fail {
             self.failures.fetch_add(1, Ordering::Relaxed);
             return Err(BlobError::Other("injected read failure".to_owned()));

*** result: Success
