*** crates/pstore-testkit/src/flaky.rs:128:9: replace Flaky::read_gate -> Result<(), BlobError> with Ok(())

*** mutation diff:
--- crates/pstore-testkit/src/flaky.rs
+++ replace Flaky::read_gate -> Result<(), BlobError> with Ok(())
@@ -120,21 +120,17 @@
     pub fn always_contended() -> Self {
         Self {
             always_contended: true,
             ..Self::refusing(&[])
         }
     }
 
     fn read_gate(&self) -> Result<(), BlobError> {
-        if self.reads_fail {
-            self.failures.fetch_add(1, Ordering::Relaxed);
-            return Err(BlobError::Other("injected read failure".to_owned()));
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[async_trait::async_trait]
 impl BlobStore for Flaky {
     fn capabilities(&self) -> &Capabilities {
         self.inner.capabilities()
     }

---- a_failed_head_read_is_an_error_not_an_empty_head stdout ----

thread 'a_failed_head_read_is_an_error_not_an_empty_head' panicked at crates/pstore-engine/tests/failures.rs:56:5:
assertion failed: e.fold().await.is_err()

---- a_failed_registry_read_is_an_error_not_an_empty_registry stdout ----

thread 'a_failed_registry_read_is_an_error_not_an_empty_registry' panicked at crates/pstore-engine/tests/failures.rs:43:5:
assertion failed: lanes::live(&store, t).await.is_err()

failures:
    a_failed_head_read_is_an_error_not_an_empty_head
    a_failed_registry_read_is_an_error_not_an_empty_registry

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
