*** crates/pstore-testkit/src/flaky.rs:129:13: delete field never_missing from struct Self expression in Flaky::never_missing

*** mutation diff:
--- crates/pstore-testkit/src/flaky.rs
+++ delete field never_missing from struct Self expression in Flaky::never_missing
@@ -121,17 +121,17 @@
             ..Self::refusing(&[])
         }
     }
 
     /// A store whose `head` always finds the key, so a forward probe never terminates.
     #[must_use]
     pub fn never_missing() -> Self {
         Self {
-            never_missing: true,
+             /* ~ changed by cargo-mutants ~ */
             ..Self::refusing(&[])
         }
     }
 
     /// A store whose conditional writes are always `Contended`.
     #[must_use]
     pub fn always_contended() -> Self {
         Self {

---- a_lane_that_never_ends_is_refused_rather_than_probed_forever stdout ----

thread 'a_lane_that_never_ends_is_refused_rather_than_probed_forever' panicked at crates/pstore-engine/tests/failures.rs:173:10:
called `Result::unwrap_err()` on an `Ok` value: 0

failures:
    a_lane_that_never_ends_is_refused_rather_than_probed_forever

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
