*** crates/pstore-testkit/src/flaky.rs:142:9: replace <impl BlobStore for Flaky>::get -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-testkit/src/flaky.rs
+++ replace <impl BlobStore for Flaky>::get -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -134,18 +134,17 @@
 }
 
 #[async_trait::async_trait]
 impl BlobStore for Flaky {
     fn capabilities(&self) -> &Capabilities {
         self.inner.capabilities()
     }
     async fn get(&self, key: &Key) -> Result<Bytes, BlobError> {
-        self.read_gate()?;
-        self.inner.get(key).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
         self.read_gate()?;
         self.inner.get_range(key, range).await
     }
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
         self.read_gate()?;
         self.inner.get_suffix(key, n).await

---- a_failed_registry_read_is_an_error_not_an_empty_registry stdout ----

thread 'a_failed_registry_read_is_an_error_not_an_empty_registry' panicked at crates/pstore-engine/tests/failures.rs:43:5:
assertion failed: lanes::live(&store, t).await.is_err()

failures:
    a_failed_registry_read_is_an_error_not_an_empty_registry

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
