*** crates/pstore-testkit/src/flaky.rs:146:9: replace <impl BlobStore for Flaky>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-testkit/src/flaky.rs
+++ replace <impl BlobStore for Flaky>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -138,18 +138,17 @@
     fn capabilities(&self) -> &Capabilities {
         self.inner.capabilities()
     }
     async fn get(&self, key: &Key) -> Result<Bytes, BlobError> {
         self.read_gate()?;
         self.inner.get(key).await
     }
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
-        self.read_gate()?;
-        self.inner.get_range(key, range).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
         self.read_gate()?;
         self.inner.get_suffix(key, n).await
     }
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, CasTag), BlobError> {
         self.read_gate()?;
         self.inner.get_with_tag(key).await

*** result: Success
