*** crates/pstore-testkit/src/flaky.rs:150:9: replace <impl BlobStore for Flaky>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-testkit/src/flaky.rs
+++ replace <impl BlobStore for Flaky>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -142,18 +142,17 @@
         self.read_gate()?;
         self.inner.get(key).await
     }
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
         self.read_gate()?;
         self.inner.get_range(key, range).await
     }
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
-        self.read_gate()?;
-        self.inner.get_suffix(key, n).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, CasTag), BlobError> {
         self.read_gate()?;
         self.inner.get_with_tag(key).await
     }
     async fn get_tag(&self, key: &Key) -> Option<CasTag> {
         self.inner.get_tag(key).await
     }

---- every_decorator_conforms stdout ----

thread 'every_decorator_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:66:5:
assertion failed: conformance::run(&Flaky::new(99, 0.0), 9).await.conforms()

failures:
    every_decorator_conforms

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
