*** crates/pstore-testkit/src/flaky.rs:180:9: replace <impl BlobStore for Flaky>::head -> Result<u64, BlobError> with Ok(0)

*** mutation diff:
--- crates/pstore-testkit/src/flaky.rs
+++ replace <impl BlobStore for Flaky>::head -> Result<u64, BlobError> with Ok(0)
@@ -172,21 +172,17 @@
     }
     async fn get_tag(&self, key: &Key) -> Option<CasTag> {
         self.inner.get_tag(key).await
     }
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {
         // ⚠️ Gated too. `head` is how the WAL tail is probed, so leaving it working while
         // every other read fails models a backend that does not exist and hides the
         // engine's most important "is this a gap or an outage?" decision.
-        self.read_gate()?;
-        if self.never_missing {
-            return Ok(1);
-        }
-        self.inner.head(key).await
+        Ok(0) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn put(&self, key: &Key, body: Bytes) -> Result<PutOutcome, BlobError> {
         if self.refuse() {
             // ⚠️ Refused BEFORE writing. A failure that half-lands is a different
             // scenario, and pretending one is the other would let a real torn-write bug
             // hide behind a passing test for this one.
             return Err(BlobError::Other("injected write failure".to_owned()));

---- a_cas_storm_still_converges stdout ----

thread 'a_cas_storm_still_converges' panicked at crates/pstore-engine/tests/linearizability.rs:211:5:
assertion `left == right` failed: 0 of 100 writers converged: the rest exhausted their retries
  left: 0
 right: 100

failures:
    a_cas_storm_still_converges

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.66s

*** result: Failure(101)
