*** crates/pstore-testkit/src/flaky.rs:197:9: replace <impl BlobStore for Flaky>::delete_batch -> Result<(), BlobError> with Ok(())

*** mutation diff:
--- crates/pstore-testkit/src/flaky.rs
+++ replace <impl BlobStore for Flaky>::delete_batch -> Result<(), BlobError> with Ok(())
@@ -189,14 +189,14 @@
             return Err(CasError::Io(
                 "injected conditional write failure".to_owned(),
             ));
         }
         self.inner.put_conditional(key, body, pre).await
     }
 
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
-        self.inner.delete_batch(keys).await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
     async fn list_unrestricted(&self, prefix: &Key) -> Result<Vec<Key>, BlobError> {
         self.inner.list_unrestricted(prefix).await
     }
 }

---- every_decorator_conforms stdout ----

thread 'every_decorator_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:66:5:
assertion failed: conformance::run(&Flaky::new(99, 0.0), 9).await.conforms()

failures:
    every_decorator_conforms

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
