*** crates/pstore-testkit/src/flaky.rs:81:9: replace Flaky::failures -> u64 with 1

*** mutation diff:
--- crates/pstore-testkit/src/flaky.rs
+++ replace Flaky::failures -> u64 with 1
@@ -73,17 +73,17 @@
             seen: AtomicU64::new(0),
             failures: Arc::new(AtomicU64::new(0)),
         }
     }
 
     /// How many writes have been refused, so a test can assert it actually injected.
     #[must_use]
     pub fn failures(&self) -> u64 {
-        self.failures.load(Ordering::Relaxed)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// SplitMix64 over an atomic, so concurrent writers still draw deterministically from
     /// one stream. The *order* they draw in is the scheduler's business, not this store's.
     fn refuse(&self) -> bool {
         let ordinal = self.seen.fetch_add(1, Ordering::Relaxed);
         if self.at.contains(&ordinal) {
             self.failures.fetch_add(1, Ordering::Relaxed);

*** result: Success
