*** crates/pstore-testkit/src/gated.rs:53:9: replace <impl BlobStore for Gated>::get -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-testkit/src/gated.rs
+++ replace <impl BlobStore for Gated>::get -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -45,17 +45,17 @@
 }
 
 #[async_trait::async_trait]
 impl BlobStore for Gated {
     fn capabilities(&self) -> &Capabilities {
         self.inner.capabilities()
     }
     async fn get(&self, key: &Key) -> Result<Bytes, BlobError> {
-        self.inner.get(key).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
         self.inner.get_range(key, range).await
     }
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
         self.inner.get_suffix(key, n).await
     }
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, CasTag), BlobError> {

---- every_decorator_conforms stdout ----

thread 'every_decorator_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:71:5:
assertion failed: conformance::run(&Gated::new(2), 11).await.conforms()

failures:
    every_decorator_conforms

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
