*** crates/pstore-testkit/src/gated.rs:59:9: replace <impl BlobStore for Gated>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-testkit/src/gated.rs
+++ replace <impl BlobStore for Gated>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -51,17 +51,17 @@
     }
     async fn get(&self, key: &Key) -> Result<Bytes, BlobError> {
         self.inner.get(key).await
     }
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
         self.inner.get_range(key, range).await
     }
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
-        self.inner.get_suffix(key, n).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, CasTag), BlobError> {
         self.inner.get_with_tag(key).await
     }
     async fn get_tag(&self, key: &Key) -> Option<CasTag> {
         self.inner.get_tag(key).await
     }
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {

*** result: Success
