*** crates/pstore-testkit/src/gated.rs:60:9: delete ! in Gated::raced

*** mutation diff:
--- crates/pstore-testkit/src/gated.rs
+++ delete ! in Gated::raced
@@ -52,17 +52,17 @@
     }
 
     /// Whether any writer gave up waiting for peers that never came.
     ///
     /// A test asserting on a race must check this: without it, "one winner" is equally
     /// satisfied by twelve compactors racing and by one compactor running alone.
     #[must_use]
     pub fn raced(&self) -> bool {
-        !self.broke.load(Ordering::SeqCst)
+         /* ~ changed by cargo-mutants ~ */self.broke.load(Ordering::SeqCst)
     }
 }
 
 #[async_trait::async_trait]
 impl BlobStore for Gated {
     fn capabilities(&self) -> &Capabilities {
         self.inner.capabilities()
     }

---- a_fold_landing_mid_compaction_is_not_swallowed_by_it stdout ----

thread 'a_fold_landing_mid_compaction_is_not_swallowed_by_it' panicked at crates/pstore-engine/tests/compaction.rs:265:5:
the fold and the compaction never overlapped

---- concurrent_compactors_produce_one_winner stdout ----

thread 'concurrent_compactors_produce_one_winner' panicked at crates/pstore-engine/tests/compaction.rs:152:5:
the compactors never met at the barrier

failures:
    a_fold_landing_mid_compaction_is_not_swallowed_by_it
    concurrent_compactors_produce_one_winner

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
