*** crates/pstore-testkit/src/gated.rs:73:9: replace <impl BlobStore for Gated>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-testkit/src/gated.rs
+++ replace <impl BlobStore for Gated>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -65,17 +65,17 @@
 impl BlobStore for Gated {
     fn capabilities(&self) -> &Capabilities {
         self.inner.capabilities()
     }
     async fn get(&self, key: &Key) -> Result<Bytes, BlobError> {
         self.inner.get(key).await
     }
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
-        self.inner.get_range(key, range).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
         self.inner.get_suffix(key, n).await
     }
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, CasTag), BlobError> {
         self.inner.get_with_tag(key).await
     }
     async fn get_tag(&self, key: &Key) -> Option<CasTag> {

---- a_losing_compactors_output_is_unreferenced stdout ----

thread 'tokio-rt-worker' panicked at /home/tuong/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/bytes-1.12.1/src/bytes.rs:374:28:
range end out of bounds: 14 <= 0

thread 'tokio-rt-worker' panicked at /home/tuong/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/bytes-1.12.1/src/bytes.rs:374:28:
range end out of bounds: 14 <= 0

thread 'tokio-rt-worker' panicked at /home/tuong/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/bytes-1.12.1/src/bytes.rs:374:28:
range end out of bounds: 14 <= 0

thread 'a_losing_compactors_output_is_unreferenced' panicked at crates/pstore-engine/tests/compaction.rs:191:28:
called `Result::unwrap()` on an `Err` value: JoinError::Panic(Id(21), "range end out of bounds: 14 <= 0", ...)

---- a_fold_landing_mid_compaction_is_not_swallowed_by_it stdout ----

thread 'a_fold_landing_mid_compaction_is_not_swallowed_by_it' panicked at /home/tuong/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/bytes-1.12.1/src/bytes.rs:374:28:
range end out of bounds: 14 <= 0

---- concurrent_compactors_produce_one_winner stdout ----

thread 'concurrent_compactors_produce_one_winner' panicked at /home/tuong/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/bytes-1.12.1/src/bytes.rs:374:28:
range end out of bounds: 14 <= 0

failures:
    a_fold_landing_mid_compaction_is_not_swallowed_by_it
    a_losing_compactors_output_is_unreferenced
    concurrent_compactors_produce_one_winner

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
