*** crates/pstore-testkit/src/gated.rs:83:93: replace < with == in <impl BlobStore for Gated>::put_conditional

*** mutation diff:
--- crates/pstore-testkit/src/gated.rs
+++ replace < with == in <impl BlobStore for Gated>::put_conditional
@@ -75,17 +75,17 @@
         &self,
         key: &Key,
         body: Bytes,
         pre: Precondition,
     ) -> Result<PutOutcome, CasError> {
         // ⚠️ Only the first `n`. A loser that rebases and retries must not re-enter the
         // barrier: it would wait for `n` peers that have already finished and deadlock the
         // test rather than fail it, which is the harder failure to read.
-        if self.armed.load(Ordering::SeqCst) && self.arrived.fetch_add(1, Ordering::SeqCst) < self.n
+        if self.armed.load(Ordering::SeqCst) && self.arrived.fetch_add(1, Ordering::SeqCst) == /* ~ changed by cargo-mutants ~ */ self.n
         {
             self.barrier.wait().await;
         }
         self.inner.put_conditional(key, body, pre).await
     }
 
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
         self.inner.delete_batch(keys).await

*** result: Success
