*** crates/pstore-testkit/src/sim.rs:49:16: replace ^ with | in Sim::next

*** mutation diff:
--- crates/pstore-testkit/src/sim.rs
+++ replace ^ with | in Sim::next
@@ -41,17 +41,17 @@
     }
 
     /// SplitMix64, written out so determinism is visible in the source rather than
     /// dependent on a crate's version.
     fn next(&mut self) -> u64 {
         self.steps += 1;
         self.state = self.state.wrapping_add(0x9E37_79B9_7F4A_7C15);
         let mut z = self.state;
-        z = (z ^ (z >> 30)).wrapping_mul(0xBF58_476D_1CE4_E5B9);
+        z = (z | /* ~ changed by cargo-mutants ~ */ (z >> 30)).wrapping_mul(0xBF58_476D_1CE4_E5B9);
         z = (z ^ (z >> 27)).wrapping_mul(0x94D0_49BB_1331_11EB);
         z ^ (z >> 31)
     }
 
     /// One of `n`, uniformly.
     ///
     /// Returns 0 for `n == 0` rather than dividing by zero: an empty choice is a caller
     /// bug, and panicking inside the scheduler would lose the seed that reproduces it.

---- shuffle_can_move_every_element_to_every_position stdout ----

thread 'shuffle_can_move_every_element_to_every_position' panicked at crates/pstore-testkit/tests/sim.rs:169:9:
value 0 never reached some position: [true, true, true, true, true, false]

failures:
    shuffle_can_move_every_element_to_every_position

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
