*** crates/pstore-testkit/src/sim.rs:51:11: replace ^ with | in Sim::next

*** mutation diff:
--- crates/pstore-testkit/src/sim.rs
+++ replace ^ with | in Sim::next
@@ -43,17 +43,17 @@
     /// SplitMix64, written out so determinism is visible in the source rather than
     /// dependent on a crate's version.
     fn next(&mut self) -> u64 {
         self.steps += 1;
         self.state = self.state.wrapping_add(0x9E37_79B9_7F4A_7C15);
         let mut z = self.state;
         z = (z ^ (z >> 30)).wrapping_mul(0xBF58_476D_1CE4_E5B9);
         z = (z ^ (z >> 27)).wrapping_mul(0x94D0_49BB_1331_11EB);
-        z ^ (z >> 31)
+        z | /* ~ changed by cargo-mutants ~ */ (z >> 31)
     }
 
     /// One of `n`, uniformly.
     ///
     /// Returns 0 for `n == 0` rather than dividing by zero: an empty choice is a caller
     /// bug, and panicking inside the scheduler would lose the seed that reproduces it.
     pub fn choose(&mut self, n: usize) -> usize {
         if n == 0 {

---- choose_covers_its_whole_range stdout ----

thread 'choose_covers_its_whole_range' panicked at crates/pstore-testkit/tests/sim.rs:148:9:
choose(8) returned 0 112 times in 8000 draws; the mixer is skewed: [112, 382, 330, 1135, 375, 1121, 1164, 3381]

failures:
    choose_covers_its_whole_range

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
