*** crates/pstore-testkit/src/sim.rs:59:14: replace == with != in Sim::choose

*** mutation diff:
--- crates/pstore-testkit/src/sim.rs
+++ replace == with != in Sim::choose
@@ -51,17 +51,17 @@
         z ^ (z >> 31)
     }
 
     /// One of `n`, uniformly.
     ///
     /// Returns 0 for `n == 0` rather than dividing by zero: an empty choice is a caller
     /// bug, and panicking inside the scheduler would lose the seed that reproduces it.
     pub fn choose(&mut self, n: usize) -> usize {
-        if n == 0 {
+        if n != /* ~ changed by cargo-mutants ~ */ 0 {
             return 0;
         }
         (self.next() % n as u64) as usize
     }
 
     /// True with probability `p`.
     pub fn chance(&mut self, p: f64) -> bool {
         ((self.next() >> 11) as f64) / ((1u64 << 53) as f64) < p

---- recovery_finds_every_unfolded_record_across_seeds stdout ----

thread 'recovery_finds_every_unfolded_record_across_seeds' panicked at crates/pstore-engine/tests/oq91.rs:177:5:
only 0 rows acknowledged

failures:
    recovery_finds_every_unfolded_record_across_seeds

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
