*** crates/pstore-testkit/src/sim.rs:62:22: replace % with + in Sim::choose

*** mutation diff:
--- crates/pstore-testkit/src/sim.rs
+++ replace % with + in Sim::choose
@@ -54,17 +54,17 @@
     /// One of `n`, uniformly.
     ///
     /// Returns 0 for `n == 0` rather than dividing by zero: an empty choice is a caller
     /// bug, and panicking inside the scheduler would lose the seed that reproduces it.
     pub fn choose(&mut self, n: usize) -> usize {
         if n == 0 {
             return 0;
         }
-        (self.next() % n as u64) as usize
+        (self.next() + /* ~ changed by cargo-mutants ~ */ n as u64) as usize
     }
 
     /// True with probability `p`.
     pub fn chance(&mut self, p: f64) -> bool {
         ((self.next() >> 11) as f64) / ((1u64 << 53) as f64) < p
     }
 
     /// A deterministic shuffle, for turning a set of pending actions into an order.

---- choose_stays_in_range_and_shuffle_is_a_permutation stdout ----

thread 'choose_stays_in_range_and_shuffle_is_a_permutation' panicked at crates/pstore-testkit/tests/sim.rs:50:13:
assertion failed: s.choose(n) < n

failures:
    choose_stays_in_range_and_shuffle_is_a_permutation

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
