*** crates/pstore-testkit/src/sim.rs:67:9: replace Sim::chance -> bool with false

*** mutation diff:
--- crates/pstore-testkit/src/sim.rs
+++ replace Sim::chance -> bool with false
@@ -59,17 +59,17 @@
         if n == 0 {
             return 0;
         }
         (self.next() % n as u64) as usize
     }
 
     /// True with probability `p`.
     pub fn chance(&mut self, p: f64) -> bool {
-        ((self.next() >> 11) as f64) / ((1u64 << 53) as f64) < p
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// A deterministic shuffle, for turning a set of pending actions into an order.
     pub fn shuffle<T>(&mut self, items: &mut [T]) {
         for i in (1..items.len()).rev() {
             let j = self.choose(i + 1);
             items.swap(i, j);
         }

---- chance_respects_its_probability stdout ----

thread 'chance_respects_its_probability' panicked at crates/pstore-testkit/tests/sim.rs:75:5:
0.25 of 10000 produced 0

failures:
    chance_respects_its_probability

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
