*** crates/pstore-testkit/src/sim.rs:73:35: replace + with * in Sim::shuffle

*** mutation diff:
--- crates/pstore-testkit/src/sim.rs
+++ replace + with * in Sim::shuffle
@@ -65,13 +65,13 @@
     /// True with probability `p`.
     pub fn chance(&mut self, p: f64) -> bool {
         ((self.next() >> 11) as f64) / ((1u64 << 53) as f64) < p
     }
 
     /// A deterministic shuffle, for turning a set of pending actions into an order.
     pub fn shuffle<T>(&mut self, items: &mut [T]) {
         for i in (1..items.len()).rev() {
-            let j = self.choose(i + 1);
+            let j = self.choose(i * /* ~ changed by cargo-mutants ~ */ 1);
             items.swap(i, j);
         }
     }
 }

*** result: Success
