*** crates/pstore-testkit/src/sweep.rs:106:18: replace += with -= in contention_point

*** mutation diff:
--- crates/pstore-testkit/src/sweep.rs
+++ replace += with -= in contention_point
@@ -98,17 +98,17 @@
             (attempts, lost)
         }));
     }
 
     let (mut attempts, mut lost) = (0u64, 0u64);
     for t in tasks {
         if let Ok((a, l)) = t.await {
             attempts += a;
-            lost += l;
+            lost -= /* ~ changed by cargo-mutants ~ */ l;
         }
     }
     Point {
         writers,
         commits_each,
         attempts,
         commits: (writers * commits_each) as u64,
         lost,

---- sweep_reports_a_curve_not_a_point stdout ----

thread 'sweep_reports_a_curve_not_a_point' panicked at /tmp/cargo-mutants-pstore-yddpDt.tmp/crates/pstore-testkit/src/sweep.rs:106:13:
attempt to subtract with overflow

---- the_rendered_table_carries_its_own_caveat stdout ----

thread 'the_rendered_table_carries_its_own_caveat' panicked at /tmp/cargo-mutants-pstore-yddpDt.tmp/crates/pstore-testkit/src/sweep.rs:106:13:
attempt to subtract with overflow

failures:
    sweep_reports_a_curve_not_a_point
    the_rendered_table_carries_its_own_caveat

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
