*** crates/pstore-testkit/src/sweep.rs:106:18: replace += with *= in contention_point

*** mutation diff:
--- crates/pstore-testkit/src/sweep.rs
+++ replace += with *= in contention_point
@@ -98,17 +98,17 @@
             (attempts, lost)
         }));
     }
 
     let (mut attempts, mut lost) = (0u64, 0u64);
     for t in tasks {
         if let Ok((a, l)) = t.await {
             attempts += a;
-            lost += l;
+            lost *= /* ~ changed by cargo-mutants ~ */ l;
         }
     }
     Point {
         writers,
         commits_each,
         attempts,
         commits: (writers * commits_each) as u64,
         lost,

---- sweep_reports_a_curve_not_a_point stdout ----

thread 'sweep_reports_a_curve_not_a_point' panicked at crates/pstore-testkit/tests/sweep.rs:54:5:
32 racing writers must produce some 412s

failures:
    sweep_reports_a_curve_not_a_point

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
