*** crates/pstore-testkit/src/sweep.rs:43:30: replace / with % in Point::attempts_per_commit

*** mutation diff:
--- crates/pstore-testkit/src/sweep.rs
+++ replace / with % in Point::attempts_per_commit
@@ -35,17 +35,17 @@
     /// At 1.0 every attempt lands. Growth is superlinear once writers exceed the point
     /// where a read-modify-write window reliably overlaps another's, which is why the
     /// design keeps bulk writes off the CAS path entirely.
     #[must_use]
     pub fn attempts_per_commit(&self) -> f64 {
         if self.commits == 0 {
             return f64::INFINITY;
         }
-        self.attempts as f64 / self.commits as f64
+        self.attempts as f64 % /* ~ changed by cargo-mutants ~ */ self.commits as f64
     }
 
     /// Fraction of CAS calls that landed.
     #[must_use]
     pub fn success_rate(&self) -> f64 {
         if self.attempts == 0 {
             return 0.0;
         }

---- a_single_writer_never_contends stdout ----

thread 'a_single_writer_never_contends' panicked at crates/pstore-testkit/tests/sweep.rs:74:5:
assertion failed: (p.attempts_per_commit() - 1.0).abs() < f64::EPSILON

---- sweep_reports_a_curve_not_a_point stdout ----

thread 'sweep_reports_a_curve_not_a_point' panicked at crates/pstore-testkit/tests/sweep.rs:58:5:
assertion failed: (busy.attempts_per_commit() - expect).abs() < f64::EPSILON

failures:
    a_single_writer_never_contends
    sweep_reports_a_curve_not_a_point

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
