*** crates/pstore-testkit/src/sweep.rs:88:30: replace += with -= in contention_point

*** mutation diff:
--- crates/pstore-testkit/src/sweep.rs
+++ replace += with -= in contention_point
@@ -80,17 +80,17 @@
                     let tag = match s.get_tag(&k).await {
                         Some(t) => t,
                         None => break,
                     };
                     // The window every optimistic protocol has: another writer can land
                     // between the read and the CAS. Yielding widens it deterministically
                     // enough to be measurable on a store with no network.
                     tokio::task::yield_now().await;
-                    attempts += 1;
+                    attempts -= /* ~ changed by cargo-mutants ~ */ 1;
                     let body = Bytes::from(format!("w{w}c{c}"));
                     match s.put_conditional(&k, body, Precondition::Match(tag)).await {
                         Ok(_) => break,
                         Err(CasError::Lost) => lost += 1,
                         Err(CasError::Contended) => {}
                         Err(CasError::Io(_)) => break,
                     }
                 }

---- a_single_writer_never_contends stdout ----

thread 'tokio-rt-worker' panicked at /tmp/cargo-mutants-pstore-R9GKOv.tmp/crates/pstore-testkit/src/sweep.rs:88:21:
attempt to subtract with overflow

thread 'a_single_writer_never_contends' panicked at crates/pstore-testkit/tests/sweep.rs:68:5:
assertion `left == right` failed
  left: 0
 right: 20

---- sweep_reports_a_curve_not_a_point stdout ----

thread 'tokio-rt-worker' panicked at /tmp/cargo-mutants-pstore-R9GKOv.tmp/crates/pstore-testkit/src/sweep.rs:88:21:
attempt to subtract with overflow

thread 'tokio-rt-worker' panicked at /tmp/cargo-mutants-pstore-R9GKOv.tmp/crates/pstore-testkit/src/sweep.rs:88:21:
attempt to subtract with overflow

thread 'tokio-rt-worker' panicked at /tmp/cargo-mutants-pstore-R9GKOv.tmp/crates/pstore-testkit/src/sweep.rs:88:21:
attempt to subtract with overflow

thread 'tokio-rt-worker' panicked at /tmp/cargo-mutants-pstore-R9GKOv.tmp/crates/pstore-testkit/src/sweep.rs:88:21:
attempt to subtract with overflow

failures:
    a_single_writer_never_contends
    sweep_reports_a_curve_not_a_point

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
