*** crates/pstore-testkit/src/sweep.rs:92:53: replace += with -= in contention_point

*** mutation diff:
--- crates/pstore-testkit/src/sweep.rs
+++ replace += with -= in contention_point
@@ -84,17 +84,17 @@
                     // The window every optimistic protocol has: another writer can land
                     // between the read and the CAS. Yielding widens it deterministically
                     // enough to be measurable on a store with no network.
                     tokio::task::yield_now().await;
                     attempts += 1;
                     let body = Bytes::from(format!("w{w}c{c}"));
                     match s.put_conditional(&k, body, Precondition::Match(tag)).await {
                         Ok(_) => break,
-                        Err(CasError::Lost) => lost += 1,
+                        Err(CasError::Lost) => lost -= /* ~ changed by cargo-mutants ~ */ 1,
                         Err(CasError::Contended) => {}
                         Err(CasError::Io(_)) => break,
                     }
                 }
             }
             (attempts, lost)
         }));
     }

---- sweep_reports_a_curve_not_a_point stdout ----

thread 'tokio-rt-worker' panicked at /tmp/cargo-mutants-pstore-yddpDt.tmp/crates/pstore-testkit/src/sweep.rs:92:48:
attempt to subtract with overflow

thread 'tokio-rt-worker' panicked at /tmp/cargo-mutants-pstore-yddpDt.tmp/crates/pstore-testkit/src/sweep.rs:92:48:
attempt to subtract with overflow

thread 'tokio-rt-worker' panicked at /tmp/cargo-mutants-pstore-yddpDt.tmp/crates/pstore-testkit/src/sweep.rs:92:48:
attempt to subtract with overflow

thread 'tokio-rt-worker' panicked at /tmp/cargo-mutants-pstore-yddpDt.tmp/crates/pstore-testkit/src/sweep.rs:92:48:
attempt to subtract with overflow

failures:
    sweep_reports_a_curve_not_a_point

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
