*** crates/pstore-blob/src/accounting.rs:105:9: replace Accounted<S>::record_ranges with ()

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace Accounted<S>::record_ranges with ()
@@ -97,17 +97,17 @@
             .unwrap_or(0)
     }
 
     /// Starts recording the byte ranges of every read.
     ///
     /// Off by default: a long-running store would grow this without bound, and it exists
     /// for assertions rather than for production accounting.
     pub fn record_ranges(&self) {
-        self.lock().ranges.get_or_insert_with(Vec::new).clear();
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// The ranges recorded since [`Self::record_ranges`], in request order.
     #[must_use]
     pub fn ranges(&self) -> Vec<(Key, std::ops::Range<u64>)> {
         self.lock().ranges.clone().unwrap_or_default()
     }

---- ranges_are_recorded_so_bytes_can_be_attributed_to_a_section stdout ----

thread 'ranges_are_recorded_so_bytes_can_be_attributed_to_a_section' panicked at crates/pstore-blob/tests/accounting.rs:143:5:
assertion `left == right` failed: got []
  left: 0
 right: 3

failures:
    ranges_are_recorded_so_bytes_can_be_attributed_to_a_section

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
