*** crates/pstore-blob/src/accounting.rs:111:9: replace Accounted<S>::ranges -> Vec<(Key, std::ops::Range<u64>)> with vec![]

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace Accounted<S>::ranges -> Vec<(Key, std::ops::Range<u64>)> with vec![]
@@ -103,17 +103,17 @@
     /// for assertions rather than for production accounting.
     pub fn record_ranges(&self) {
         self.lock().ranges.get_or_insert_with(Vec::new).clear();
     }
 
     /// The ranges recorded since [`Self::record_ranges`], in request order.
     #[must_use]
     pub fn ranges(&self) -> Vec<(Key, std::ops::Range<u64>)> {
-        self.lock().ranges.clone().unwrap_or_default()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Bytes read from `key` that fall inside `span`.
     ///
     /// The section assertion: given a section's byte range from the footer, this is how
     /// many bytes of it a query actually moved. Overlap, not containment — a coalesced
     /// fetch spanning two sections is billed to both, which is the honest answer because
     /// the bytes really did cross the wire.

---- ranges_are_recorded_so_bytes_can_be_attributed_to_a_section stdout ----

thread 'ranges_are_recorded_so_bytes_can_be_attributed_to_a_section' panicked at crates/pstore-blob/tests/accounting.rs:143:5:
assertion `left == right` failed: got []
  left: 0
 right: 3

failures:
    ranges_are_recorded_so_bytes_can_be_attributed_to_a_section

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
