*** crates/pstore-blob/src/accounting.rs:126:32: replace == with != in Accounted<S>::bytes_in

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace == with != in Accounted<S>::bytes_in
@@ -118,17 +118,17 @@
     /// fetch spanning two sections is billed to both, which is the honest answer because
     /// the bytes really did cross the wire.
     #[must_use]
     pub fn bytes_in(&self, key: &Key, span: std::ops::Range<u64>) -> u64 {
         self.lock()
             .ranges
             .iter()
             .flatten()
-            .filter(|(k, _)| k == key)
+            .filter(|(k, _)| k != /* ~ changed by cargo-mutants ~ */ key)
             .map(|(_, r)| r.end.min(span.end).saturating_sub(r.start.max(span.start)))
             .sum()
     }
 
     /// Requests of `class` across every tenant.
     #[must_use]
     pub fn total(&self, class: OpClass) -> u64 {
         self.lock().totals.get(&class).copied().unwrap_or(0)

---- ranges_are_recorded_so_bytes_can_be_attributed_to_a_section stdout ----

thread 'ranges_are_recorded_so_bytes_can_be_attributed_to_a_section' panicked at crates/pstore-blob/tests/accounting.rs:151:5:
assertion `left == right` failed
  left: 0
 right: 100

failures:
    ranges_are_recorded_so_bytes_can_be_attributed_to_a_section

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
