*** crates/pstore-blob/src/accounting.rs:134:9: replace Accounted<S>::total -> u64 with 0

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace Accounted<S>::total -> u64 with 0
@@ -126,17 +126,17 @@
             .filter(|(k, _)| k == key)
             .map(|(_, r)| r.end.min(span.end).saturating_sub(r.start.max(span.start)))
             .sum()
     }
 
     /// Requests of `class` across every tenant.
     #[must_use]
     pub fn total(&self, class: OpClass) -> u64 {
-        self.lock().totals.get(&class).copied().unwrap_or(0)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     fn lock(&self) -> std::sync::MutexGuard<'_, Counters> {
         self.counters
             .lock()
             .unwrap_or_else(std::sync::PoisonError::into_inner)
     }
 }

---- accounting_is_per_tenant stdout ----

thread 'accounting_is_per_tenant' panicked at crates/pstore-blob/tests/accounting.rs:79:5:
assertion `left == right` failed
  left: 0
 right: 4

failures:
    accounting_is_per_tenant

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
