*** crates/pstore-blob/src/accounting.rs:79:9: replace Accounted<S>::count -> u64 with 1

*** mutation diff:
--- crates/pstore-blob/src/accounting.rs
+++ replace Accounted<S>::count -> u64 with 1
@@ -71,21 +71,17 @@
             counters: Arc::clone(&self.counters),
             tenant,
         }
     }
 
     /// Requests of `class` billed to `tenant`.
     #[must_use]
     pub fn count(&self, tenant: TenantId, class: OpClass) -> u64 {
-        self.lock()
-            .per_tenant
-            .get(&(tenant, class))
-            .copied()
-            .unwrap_or(0)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Bytes of `class` billed to `tenant`.
     ///
     /// A `head` moves no body and adds nothing here: counting it as the object's size
     /// would make a metadata probe look like a full fetch and hide the exact difference
     /// the design turns on.
     #[must_use]

---- a_failed_conditional_write_is_still_billed stdout ----

thread 'a_failed_conditional_write_is_still_billed' panicked at crates/pstore-blob/tests/accounting.rs:95:5:
assertion `left == right` failed
  left: 1
 right: 2

---- accounting_counts_one_write_per_put stdout ----

thread 'accounting_counts_one_write_per_put' panicked at crates/pstore-blob/tests/accounting.rs:37:5:
assertion `left == right` failed
  left: 1
 right: 10

---- accounting_is_per_tenant stdout ----

thread 'accounting_is_per_tenant' panicked at crates/pstore-blob/tests/accounting.rs:78:5:
assertion `left == right` failed
  left: 1
 right: 3

failures:
    a_failed_conditional_write_is_still_billed
    accounting_counts_one_write_per_put
    accounting_is_per_tenant
    accounting_separates_read_write_and_list_classes

test result: FAILED. 2 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
