*** crates/pstore-blob/src/congestion.rs:127:9: replace <impl crate::BlobStore for Congested<S>>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-blob/src/congestion.rs
+++ replace <impl crate::BlobStore for Congested<S>>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -119,18 +119,17 @@
         self.inner.capabilities()
     }
 
     async fn get(&self, key: &Key) -> Result<Bytes, BlobError> {
         self.with_retry(|| self.inner.get(key)).await
     }
 
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
-        self.with_retry(|| self.inner.get_range(key, range.clone()))
-            .await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, pstore_types::CasTag), BlobError> {
         self.with_retry(|| self.inner.get_with_tag(key)).await
     }
 
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
         self.with_retry(|| self.inner.get_suffix(key, n)).await

*** result: Success
