*** crates/pstore-blob/src/congestion.rs:144:9: replace <impl crate::BlobStore for Congested<S>>::head -> Result<u64, BlobError> with Ok(0)

*** mutation diff:
--- crates/pstore-blob/src/congestion.rs
+++ replace <impl crate::BlobStore for Congested<S>>::head -> Result<u64, BlobError> with Ok(0)
@@ -136,17 +136,17 @@
         self.with_retry(|| self.inner.get_suffix(key, n)).await
     }
 
     async fn get_tag(&self, key: &Key) -> Option<pstore_types::CasTag> {
         self.inner.get_tag(key).await
     }
 
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {
-        self.with_retry(|| self.inner.head(key)).await
+        Ok(0) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn put(&self, key: &Key, body: Bytes) -> Result<PutOutcome, BlobError> {
         self.with_retry(|| self.inner.put(key, body.clone())).await
     }
 
     async fn put_conditional(
         &self,

*** result: Success
