*** crates/pstore-blob/src/congestion.rs:165:9: replace <impl crate::BlobStore for Congested<S>>::delete_batch -> Result<(), BlobError> with Ok(())

*** mutation diff:
--- crates/pstore-blob/src/congestion.rs
+++ replace <impl crate::BlobStore for Congested<S>>::delete_batch -> Result<(), BlobError> with Ok(())
@@ -157,16 +157,16 @@
         // ⚠️ Deliberately NOT retried here. A CAS failure is a decision for the caller:
         // `Lost` means rebase against the new state, `Contended` means retry the same
         // attempt. Retrying blindly at this layer would re-send a body built from a world
         // that no longer exists.
         self.inner.put_conditional(key, body, pre).await
     }
 
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
-        self.with_retry(|| self.inner.delete_batch(keys)).await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn list_unrestricted(&self, prefix: &Key) -> Result<Vec<Key>, BlobError> {
         self.with_retry(|| self.inner.list_unrestricted(prefix))
             .await
     }
 }

*** result: Success
