*** crates/pstore-blob/src/congestion.rs:57:9: replace Congested<S>::limit -> u32 with 0

*** mutation diff:
--- crates/pstore-blob/src/congestion.rs
+++ replace Congested<S>::limit -> u32 with 0
@@ -49,17 +49,17 @@
                 attempts: AtomicU64::new(0),
             }),
         }
     }
 
     /// The current concurrency limit.
     #[must_use]
     pub fn limit(&self) -> u32 {
-        self.state.limit.load(Ordering::Relaxed)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Total attempts made, including retries. The number that would grow without bound
     /// if the retry policy were wrong.
     #[must_use]
     pub fn attempts(&self) -> u64 {
         self.state.attempts.load(Ordering::Relaxed)
     }

---- slowdown_reduces_concurrency_then_recovers stdout ----

thread 'slowdown_reduces_concurrency_then_recovers' panicked at crates/pstore-blob/tests/faults.rs:149:5:
assertion `left == right` failed
  left: 0
 right: 32

---- recovery_is_additive_and_slow stdout ----

thread 'recovery_is_additive_and_slow' panicked at crates/pstore-blob/tests/faults.rs:240:5:
assertion `left == right` failed: already at the ceiling, nothing to add
  left: 0
 right: 32

---- a_slow_down_halves_the_limit_rather_than_merely_lowering_it stdout ----

thread 'a_slow_down_halves_the_limit_rather_than_merely_lowering_it' panicked at crates/pstore-blob/tests/faults.rs:224:5:
assertion `left == right` failed: one 503 must halve 32, not floor it
  left: 0
 right: 16

failures:
    a_slow_down_halves_the_limit_rather_than_merely_lowering_it
    recovery_is_additive_and_slow
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 10 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
