*** crates/pstore-blob/src/congestion.rs:64:9: replace Congested<S>::attempts -> u64 with 0

*** mutation diff:
--- crates/pstore-blob/src/congestion.rs
+++ replace Congested<S>::attempts -> u64 with 0
@@ -56,17 +56,17 @@
     pub fn limit(&self) -> u32 {
         self.state.limit.load(Ordering::Relaxed)
     }
 
     /// Total attempts made, including retries. The number that would grow without bound
     /// if the retry policy were wrong.
     #[must_use]
     pub fn attempts(&self) -> u64 {
-        self.state.attempts.load(Ordering::Relaxed)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Multiplicative decrease, floored at one: the limit must never reach zero, or the
     /// backend can never be probed again and the fall is permanent.
     fn on_slow_down(&self) {
         self.state.streak.store(0, Ordering::Relaxed);
         let cur = self.state.limit.load(Ordering::Relaxed);
         self.state.limit.store((cur / 2).max(1), Ordering::Relaxed);

---- a_transient_slowdown_is_retried_and_succeeds stdout ----

thread 'a_transient_slowdown_is_retried_and_succeeds' panicked at crates/pstore-blob/tests/faults.rs:203:5:
assertion `left == right` failed
  left: 0
 right: 2

---- retries_are_bounded stdout ----

thread 'retries_are_bounded' panicked at crates/pstore-blob/tests/faults.rs:185:5:
it should have retried at least once

failures:
    a_transient_slowdown_is_retried_and_succeeds
    retries_are_bounded

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
