*** crates/pstore-blob/src/congestion.rs:78:67: replace + with * in Congested<S>::on_success

*** mutation diff:
--- crates/pstore-blob/src/congestion.rs
+++ replace + with * in Congested<S>::on_success
@@ -70,17 +70,17 @@
         self.state.streak.store(0, Ordering::Relaxed);
         let cur = self.state.limit.load(Ordering::Relaxed);
         self.state.limit.store((cur / 2).max(1), Ordering::Relaxed);
     }
 
     /// Additive increase, and only every few successes, so one lucky request does not
     /// undo a cut.
     fn on_success(&self) {
-        let n = self.state.streak.fetch_add(1, Ordering::Relaxed) + 1;
+        let n = self.state.streak.fetch_add(1, Ordering::Relaxed) * /* ~ changed by cargo-mutants ~ */ 1;
         if n.is_multiple_of(8) {
             let cur = self.state.limit.load(Ordering::Relaxed);
             self.state
                 .limit
                 .store((cur + 1).min(self.state.ceiling), Ordering::Relaxed);
         }
     }

---- a_slow_down_halves_the_limit_rather_than_merely_lowering_it stdout ----

thread 'a_slow_down_halves_the_limit_rather_than_merely_lowering_it' panicked at crates/pstore-blob/tests/faults.rs:224:5:
assertion `left == right` failed: one 503 must halve 32, not floor it
  left: 17
 right: 16

failures:
    a_slow_down_halves_the_limit_rather_than_merely_lowering_it

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
