*** crates/pstore-blob/src/congestion.rs:83:29: replace + with * in Congested<S>::on_success

*** mutation diff:
--- crates/pstore-blob/src/congestion.rs
+++ replace + with * in Congested<S>::on_success
@@ -75,17 +75,17 @@
     /// Additive increase, and only every few successes, so one lucky request does not
     /// undo a cut.
     fn on_success(&self) {
         let n = self.state.streak.fetch_add(1, Ordering::Relaxed) + 1;
         if n.is_multiple_of(8) {
             let cur = self.state.limit.load(Ordering::Relaxed);
             self.state
                 .limit
-                .store((cur + 1).min(self.state.ceiling), Ordering::Relaxed);
+                .store((cur * /* ~ changed by cargo-mutants ~ */ 1).min(self.state.ceiling), Ordering::Relaxed);
         }
     }
 
     /// Runs `op`, backing off and retrying while it answers `SlowDown`.
     async fn with_retry<T, F, Fut>(&self, mut op: F) -> Result<T, BlobError>
     where
         F: FnMut() -> Fut,
         Fut: std::future::Future<Output = Result<T, BlobError>>,

---- slowdown_reduces_concurrency_then_recovers stdout ----

thread 'slowdown_reduces_concurrency_then_recovers' panicked at crates/pstore-blob/tests/faults.rs:159:5:
success must recover the limit, still 2

failures:
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
