*** crates/pstore-blob/src/faulty.rs:105:16: replace <= with > in Faulty<S>::read_fault

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace <= with > in Faulty<S>::read_fault
@@ -97,17 +97,17 @@
         let mut st = self.lock();
         st.ops = st.ops.saturating_add(1);
         let (f, ops) = (st.faults, st.ops);
         (f, st.next_f64(), ops)
     }
 
     fn read_fault(&self) -> Option<BlobError> {
         let (f, r, ops) = self.roll();
-        if ops <= f.slow_down_first_n {
+        if ops > /* ~ changed by cargo-mutants ~ */ f.slow_down_first_n {
             return Some(BlobError::SlowDown);
         }
         if r < f.slow_down {
             return Some(BlobError::SlowDown);
         }
         if r < f.slow_down + f.read_error {
             return Some(BlobError::Other("injected read fault".to_owned()));
         }

---- a_transient_slowdown_is_retried_and_succeeds stdout ----

thread 'a_transient_slowdown_is_retried_and_succeeds' panicked at crates/pstore-blob/tests/faults.rs:203:5:
assertion `left == right` failed
  left: 1
 right: 2

---- a_slow_down_halves_the_limit_rather_than_merely_lowering_it stdout ----

thread 'a_slow_down_halves_the_limit_rather_than_merely_lowering_it' panicked at crates/pstore-blob/tests/faults.rs:224:5:
assertion `left == right` failed: one 503 must halve 32, not floor it
  left: 32
 right: 16

---- a_fault_rate_of_one_injects_on_every_call_and_zero_on_none stdout ----

thread 'a_fault_rate_of_one_injects_on_every_call_and_zero_on_none' panicked at crates/pstore-blob/tests/faults.rs:283:34:
called `Result::unwrap()` on an `Err` value: SlowDown

failures:
    a_fault_rate_of_one_injects_on_every_call_and_zero_on_none
    a_slow_down_halves_the_limit_rather_than_merely_lowering_it
    a_transient_slowdown_is_retried_and_succeeds
    a_zero_rate_injects_nothing
    injected_faults_land_at_roughly_the_rate_asked_for
    same_seed_reproduces_the_same_failures
    slow_down_first_n_covers_exactly_the_first_n_operations
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 5 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
