*** crates/pstore-blob/src/faulty.rs:108:14: replace < with == in Faulty<S>::read_fault

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace < with == in Faulty<S>::read_fault
@@ -100,17 +100,17 @@
         (f, st.next_f64(), ops)
     }
 
     fn read_fault(&self) -> Option<BlobError> {
         let (f, r, ops) = self.roll();
         if ops <= f.slow_down_first_n {
             return Some(BlobError::SlowDown);
         }
-        if r < f.slow_down {
+        if r == /* ~ changed by cargo-mutants ~ */ f.slow_down {
             return Some(BlobError::SlowDown);
         }
         if r < f.slow_down + f.read_error {
             return Some(BlobError::Other("injected read fault".to_owned()));
         }
         None
     }

---- each_fault_kind_is_injected_independently stdout ----

thread 'each_fault_kind_is_injected_independently' panicked at crates/pstore-blob/tests/faults.rs:75:5:
assertion failed: matches!(slow.get(&k("a")).await.unwrap_err(), BlobError::SlowDown)

---- retries_are_bounded stdout ----

thread 'retries_are_bounded' panicked at crates/pstore-blob/tests/faults.rs:180:5:
assertion failed: matches!(s.get(&k("a")).await.unwrap_err(), BlobError::SlowDown)

---- slowdown_reduces_concurrency_then_recovers stdout ----

thread 'slowdown_reduces_concurrency_then_recovers' panicked at crates/pstore-blob/tests/faults.rs:153:5:
a 503 must reduce the limit, got 32

failures:
    each_fault_kind_is_injected_independently
    retries_are_bounded
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 4 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
