*** crates/pstore-blob/src/faulty.rs:108:14: replace < with <= in Faulty<S>::read_fault

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace < with <= in Faulty<S>::read_fault
@@ -100,17 +100,17 @@
         (f, st.next_f64(), ops)
     }
 
     fn read_fault(&self) -> Option<BlobError> {
         let (f, r, ops) = self.roll();
         if ops <= f.slow_down_first_n {
             return Some(BlobError::SlowDown);
         }
-        if r < f.slow_down {
+        if r <= /* ~ changed by cargo-mutants ~ */ f.slow_down {
             return Some(BlobError::SlowDown);
         }
         if r < f.slow_down + f.read_error {
             return Some(BlobError::Other("injected read fault".to_owned()));
         }
         None
     }

*** result: Success
