*** crates/pstore-blob/src/faulty.rs:111:14: replace < with > in Faulty<S>::read_fault

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace < with > in Faulty<S>::read_fault
@@ -103,17 +103,17 @@
     fn read_fault(&self) -> Option<BlobError> {
         let (f, r, ops) = self.roll();
         if ops <= f.slow_down_first_n {
             return Some(BlobError::SlowDown);
         }
         if r < f.slow_down {
             return Some(BlobError::SlowDown);
         }
-        if r < f.slow_down + f.read_error {
+        if r > /* ~ changed by cargo-mutants ~ */ f.slow_down + f.read_error {
             return Some(BlobError::Other("injected read fault".to_owned()));
         }
         None
     }
 
     fn write_fault(&self) -> Option<BlobError> {
         let (f, r, ops) = self.roll();
         if ops <= f.slow_down_first_n || r < f.slow_down {

---- a_fault_rate_of_one_injects_on_every_call_and_zero_on_none stdout ----

thread 'a_fault_rate_of_one_injects_on_every_call_and_zero_on_none' panicked at crates/pstore-blob/tests/faults.rs:283:34:
called `Result::unwrap()` on an `Err` value: Other("injected read fault")

---- a_zero_rate_injects_nothing stdout ----

thread 'a_zero_rate_injects_nothing' panicked at crates/pstore-blob/tests/faults.rs:61:9:
assertion failed: s.get(&k("a")).await.is_ok()

---- a_transient_slowdown_is_retried_and_succeeds stdout ----

thread 'a_transient_slowdown_is_retried_and_succeeds' panicked at crates/pstore-blob/tests/faults.rs:202:38:
called `Result::unwrap()` on an `Err` value: Other("injected read fault")

failures:
    a_fault_rate_of_one_injects_on_every_call_and_zero_on_none
    a_transient_slowdown_is_retried_and_succeeds
    a_zero_rate_injects_nothing
    injected_faults_land_at_roughly_the_rate_asked_for
    slow_down_first_n_covers_exactly_the_first_n_operations
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 7 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
