*** crates/pstore-blob/src/faulty.rs:119:16: replace <= with > in Faulty<S>::write_fault

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace <= with > in Faulty<S>::write_fault
@@ -111,17 +111,17 @@
         if r < f.slow_down + f.read_error {
             return Some(BlobError::Other("injected read fault".to_owned()));
         }
         None
     }
 
     fn write_fault(&self) -> Option<BlobError> {
         let (f, r, ops) = self.roll();
-        if ops <= f.slow_down_first_n || r < f.slow_down {
+        if ops > /* ~ changed by cargo-mutants ~ */ f.slow_down_first_n || r < f.slow_down {
             return Some(BlobError::SlowDown);
         }
         if r < f.slow_down + f.write_error {
             return Some(BlobError::Other("injected write fault".to_owned()));
         }
         None
     }

---- a_zero_rate_injects_nothing stdout ----

thread 'a_zero_rate_injects_nothing' panicked at crates/pstore-blob/tests/faults.rs:59:52:
called `Result::unwrap()` on an `Err` value: SlowDown

---- same_seed_reproduces_the_same_failures stdout ----

thread 'same_seed_reproduces_the_same_failures' panicked at crates/pstore-blob/tests/faults.rs:35:56:
called `Result::unwrap()` on an `Err` value: SlowDown

failures:
    a_zero_rate_injects_nothing
    same_seed_reproduces_the_same_failures

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
