*** crates/pstore-blob/src/faulty.rs:119:39: replace || with && in Faulty<S>::write_fault

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace || with && in Faulty<S>::write_fault
@@ -111,17 +111,17 @@
         if r < f.slow_down + f.read_error {
             return Some(BlobError::Other("injected read fault".to_owned()));
         }
         None
     }
 
     fn write_fault(&self) -> Option<BlobError> {
         let (f, r, ops) = self.roll();
-        if ops <= f.slow_down_first_n || r < f.slow_down {
+        if ops <= f.slow_down_first_n && /* ~ changed by cargo-mutants ~ */ r < f.slow_down {
             return Some(BlobError::SlowDown);
         }
         if r < f.slow_down + f.write_error {
             return Some(BlobError::Other("injected write fault".to_owned()));
         }
         None
     }

---- every_method_retries_a_transient_slowdown stdout ----

thread 'every_method_retries_a_transient_slowdown' panicked at crates/pstore-testkit/tests/hostile.rs:111:9:
assertion `left == right` failed: method 4 did not retry the first 503
  left: 1
 right: 2

failures:
    every_method_retries_a_transient_slowdown

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.22s

*** result: Failure(101)
