*** crates/pstore-blob/src/faulty.rs:122:28: replace + with * in Faulty<S>::write_fault

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace + with * in Faulty<S>::write_fault
@@ -114,17 +114,17 @@
         None
     }
 
     fn write_fault(&self) -> Option<BlobError> {
         let (f, r, ops) = self.roll();
         if ops <= f.slow_down_first_n || r < f.slow_down {
             return Some(BlobError::SlowDown);
         }
-        if r < f.slow_down + f.write_error {
+        if r < f.slow_down * /* ~ changed by cargo-mutants ~ */ f.write_error {
             return Some(BlobError::Other("injected write fault".to_owned()));
         }
         None
     }
 
     fn cas_fault(&self) -> Option<CasError> {
         let (f, r, _) = self.roll();
         if r < f.cas_lost {

---- a_fault_rate_of_one_injects_on_every_call_and_zero_on_none stdout ----

thread 'a_fault_rate_of_one_injects_on_every_call_and_zero_on_none' panicked at crates/pstore-blob/tests/faults.rs:312:9:
assertion failed: always_write.put(&k("a"), Bytes::from_static(b"x")).await.is_err()

failures:
    a_fault_rate_of_one_injects_on_every_call_and_zero_on_none

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
