*** crates/pstore-blob/src/faulty.rs:133:14: replace < with == in Faulty<S>::cas_fault

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace < with == in Faulty<S>::cas_fault
@@ -125,17 +125,17 @@
         None
     }
 
     fn cas_fault(&self) -> Option<CasError> {
         let (f, r, _) = self.roll();
         if r < f.cas_lost {
             return Some(CasError::Lost);
         }
-        if r < f.cas_lost + f.cas_contended {
+        if r == /* ~ changed by cargo-mutants ~ */ f.cas_lost + f.cas_contended {
             return Some(CasError::Contended);
         }
         None
     }
 }
 
 #[async_trait::async_trait]
 impl<S: crate::BlobStore> crate::BlobStore for Faulty<S> {

---- each_fault_kind_is_injected_independently stdout ----

thread 'each_fault_kind_is_injected_independently' panicked at crates/pstore-blob/tests/faults.rs:107:14:
called `Result::unwrap_err()` on an `Ok` value: PutOutcome { tag: CasTag("1") }

failures:
    each_fault_kind_is_injected_independently

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
