*** crates/pstore-blob/src/faulty.rs:154:9: replace <impl crate::BlobStore for Faulty<S>>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace <impl crate::BlobStore for Faulty<S>>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -146,20 +146,17 @@
     async fn get(&self, key: &Key) -> Result<Bytes, BlobError> {
         match self.read_fault() {
             Some(e) => Err(e),
             None => self.inner.get(key).await,
         }
     }
 
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
-        match self.read_fault() {
-            Some(e) => Err(e),
-            None => self.inner.get_range(key, range).await,
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, pstore_types::CasTag), BlobError> {
         match self.read_fault() {
             Some(e) => Err(e),
             None => self.inner.get_with_tag(key).await,
         }
     }

---- every_decorator_conforms stdout ----

thread 'every_decorator_conforms' panicked at /home/tuong/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/bytes-1.12.1/src/bytes.rs:374:28:
range end out of bounds: 4 <= 0

failures:
    every_decorator_conforms

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
