*** crates/pstore-blob/src/faulty.rs:168:9: replace <impl crate::BlobStore for Faulty<S>>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace <impl crate::BlobStore for Faulty<S>>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -160,20 +160,17 @@
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, pstore_types::CasTag), BlobError> {
         match self.read_fault() {
             Some(e) => Err(e),
             None => self.inner.get_with_tag(key).await,
         }
     }
 
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
-        match self.read_fault() {
-            Some(e) => Err(e),
-            None => self.inner.get_suffix(key, n).await,
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_tag(&self, key: &Key) -> Option<pstore_types::CasTag> {
         self.inner.get_tag(key).await
     }
 
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {
         match self.read_fault() {

*** result: Success
