*** crates/pstore-blob/src/faulty.rs:57:11: replace ^= with &= in Inner::next_f64

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace ^= with &= in Inner::next_f64
@@ -49,17 +49,17 @@
 }
 
 impl Inner {
     fn next_f64(&mut self) -> f64 {
         self.seed = self.seed.wrapping_add(0x9E37_79B9_7F4A_7C15);
         let mut z = self.seed;
         z = (z ^ (z >> 30)).wrapping_mul(0xBF58_476D_1CE4_E5B9);
         z = (z ^ (z >> 27)).wrapping_mul(0x94D0_49BB_1331_11EB);
-        z ^= z >> 31;
+        z &= /* ~ changed by cargo-mutants ~ */ z >> 31;
         // 53 bits of mantissa: the same value on every platform.
         ((z >> 11) as f64) / ((1u64 << 53) as f64)
     }
 }
 
 /// Wraps a backend and injects faults from a seed.
 #[derive(Debug, Clone)]
 pub struct Faulty<S> {

---- same_seed_reproduces_the_same_failures stdout ----

thread 'same_seed_reproduces_the_same_failures' panicked at crates/pstore-blob/tests/faults.rs:48:5:
assertion `left != right` failed: a different seed must diverge
  left: [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]
 right: [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false]

failures:
    same_seed_reproduces_the_same_failures

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
