*** crates/pstore-blob/src/faulty.rs:59:37: replace << with >> in Inner::next_f64

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace << with >> in Inner::next_f64
@@ -51,17 +51,17 @@
 impl Inner {
     fn next_f64(&mut self) -> f64 {
         self.seed = self.seed.wrapping_add(0x9E37_79B9_7F4A_7C15);
         let mut z = self.seed;
         z = (z ^ (z >> 30)).wrapping_mul(0xBF58_476D_1CE4_E5B9);
         z = (z ^ (z >> 27)).wrapping_mul(0x94D0_49BB_1331_11EB);
         z ^= z >> 31;
         // 53 bits of mantissa: the same value on every platform.
-        ((z >> 11) as f64) / ((1u64 << 53) as f64)
+        ((z >> 11) as f64) / ((1u64 >> /* ~ changed by cargo-mutants ~ */ 53) as f64)
     }
 }
 
 /// Wraps a backend and injects faults from a seed.
 #[derive(Debug, Clone)]
 pub struct Faulty<S> {
     inner: Arc<S>,
     state: Arc<Mutex<Inner>>,

---- slowdown_reduces_concurrency_then_recovers stdout ----

thread 'slowdown_reduces_concurrency_then_recovers' panicked at crates/pstore-blob/tests/faults.rs:153:5:
a 503 must reduce the limit, got 32

---- each_fault_kind_is_injected_independently stdout ----

thread 'each_fault_kind_is_injected_independently' panicked at crates/pstore-blob/tests/faults.rs:75:5:
assertion failed: matches!(slow.get(&k("a")).await.unwrap_err(), BlobError::SlowDown)

---- a_fault_rate_of_one_injects_on_every_call_and_zero_on_none stdout ----

thread 'a_fault_rate_of_one_injects_on_every_call_and_zero_on_none' panicked at crates/pstore-blob/tests/faults.rs:312:9:
assertion failed: always_write.put(&k("a"), Bytes::from_static(b"x")).await.is_err()

failures:
    a_fault_rate_of_one_injects_on_every_call_and_zero_on_none
    an_injected_write_fault_does_not_reach_the_backend
    each_fault_kind_is_injected_independently
    injected_faults_land_at_roughly_the_rate_asked_for
    retries_are_bounded
    same_seed_reproduces_the_same_failures
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 6 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
