*** crates/pstore-blob/src/faulty.rs:85:9: replace Faulty<S>::set_faults with ()

*** mutation diff:
--- crates/pstore-blob/src/faulty.rs
+++ replace Faulty<S>::set_faults with ()
@@ -77,17 +77,17 @@
                 faults,
                 ops: 0,
             })),
         }
     }
 
     /// Changes the injection rates, so a test can make a transient fault stop.
     pub fn set_faults(&self, faults: Faults) {
-        self.lock().faults = faults;
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn lock(&self) -> std::sync::MutexGuard<'_, Inner> {
         self.state
             .lock()
             .unwrap_or_else(std::sync::PoisonError::into_inner)
     }

---- slowdown_reduces_concurrency_then_recovers stdout ----

thread 'slowdown_reduces_concurrency_then_recovers' panicked at crates/pstore-blob/tests/faults.rs:157:30:
called `Result::unwrap()` on an `Err` value: SlowDown

failures:
    slowdown_reduces_concurrency_then_recovers

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
