*** crates/pstore-blob/src/memory.rs:115:9: replace <impl crate::BlobStore for MemoryStore>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ replace <impl crate::BlobStore for MemoryStore>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -107,24 +107,17 @@
         self.lock()
             .objects
             .get(key.as_str())
             .map(|(b, _)| b.clone())
             .ok_or_else(|| BlobError::NotFound(key.to_string()))
     }
 
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
-        let body = self.get(key).await?;
-        let len = body.len() as u64;
-        if range.end > len || range.start > range.end {
-            return Err(BlobError::RangeOutOfBounds(range, len));
-        }
-        // `slice` rather than indexing: this crate denies `indexing_slicing`, and the
-        // bounds are checked above where the error is meaningful.
-        Ok(body.slice(range.start as usize..range.end as usize))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, CasTag), BlobError> {
         // Under one lock, so the pair cannot straddle another writer's commit.
         self.lock()
             .objects
             .get(key.as_str())
             .map(|(b, t)| (b.clone(), t.clone()))

---- get_range_returns_the_requested_slice stdout ----

thread 'get_range_returns_the_requested_slice' panicked at crates/pstore-blob/tests/cas.rs:75:5:
assertion `left == right` failed
  left: []
 right: [50, 51, 52]

failures:
    get_range_returns_the_requested_slice

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
