*** crates/pstore-blob/src/memory.rs:132:28: replace || with && in <impl crate::BlobStore for MemoryStore>::get_range

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ replace || with && in <impl crate::BlobStore for MemoryStore>::get_range
@@ -124,17 +124,17 @@
             .get(key.as_str())
             .map(|(b, _)| b.clone())
             .ok_or_else(|| BlobError::NotFound(key.to_string()))
     }
 
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
         let body = self.get(key).await?;
         let len = body.len() as u64;
-        if range.end > len || range.start > range.end {
+        if range.end > len && /* ~ changed by cargo-mutants ~ */ range.start > range.end {
             return Err(BlobError::RangeOutOfBounds(range, len));
         }
         // `slice` rather than indexing: this crate denies `indexing_slicing`, and the
         // bounds are checked above where the error is meaningful.
         Ok(body.slice(range.start as usize..range.end as usize))
     }
 
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, CasTag), BlobError> {

---- a_range_past_the_end_is_an_error_not_a_short_read stdout ----

thread 'a_range_past_the_end_is_an_error_not_a_short_read' panicked at /home/tuong/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/bytes-1.12.1/src/bytes.rs:374:28:
range end out of bounds: 11 <= 10

---- get_ranges_propagates_a_read_error stdout ----

thread 'get_ranges_propagates_a_read_error' panicked at /home/tuong/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/bytes-1.12.1/src/bytes.rs:374:28:
range end out of bounds: 99 <= 4

failures:
    a_range_past_the_end_is_an_error_not_a_short_read
    get_ranges_propagates_a_read_error

test result: FAILED. 13 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
