*** crates/pstore-blob/src/memory.rs:156:9: replace <impl crate::BlobStore for MemoryStore>::get_tag -> Option<CasTag> with None

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ replace <impl crate::BlobStore for MemoryStore>::get_tag -> Option<CasTag> with None
@@ -148,20 +148,17 @@
 
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
         let body = self.get(key).await?;
         let start = (body.len() as u64).saturating_sub(n) as usize;
         Ok(body.slice(start..))
     }
 
     async fn get_tag(&self, key: &Key) -> Option<CasTag> {
-        self.lock()
-            .objects
-            .get(key.as_str())
-            .map(|(_, t)| t.clone())
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {
         self.get(key).await.map(|b| b.len() as u64)
     }
 
     async fn put(&self, key: &Key, body: Bytes) -> Result<PutOutcome, BlobError> {
         let mut st = self.lock();

---- get_tag_reports_the_current_tag_and_none_when_absent stdout ----

thread 'get_tag_reports_the_current_tag_and_none_when_absent' panicked at crates/pstore-blob/tests/semantics.rs:214:5:
assertion `left == right` failed
  left: None
 right: Some(CasTag("1"))

failures:
    get_tag_reports_the_current_tag_and_none_when_absent

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
