*** crates/pstore-blob/src/memory.rs:168:23: replace > with == in <impl crate::BlobStore for MemoryStore>::delete_batch

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ replace > with == in <impl crate::BlobStore for MemoryStore>::delete_batch
@@ -160,17 +160,17 @@
         }
         let tag = self.next_tag(&mut st, &body);
         st.objects
             .insert(key.as_str().to_owned(), (body, tag.clone()));
         Ok(PutOutcome { tag })
     }
 
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
-        if keys.len() > self.caps.max_batch_delete {
+        if keys.len() == /* ~ changed by cargo-mutants ~ */ self.caps.max_batch_delete {
             return Err(BlobError::Other(format!(
                 "batch of {} exceeds the backend's limit of {}",
                 keys.len(),
                 self.caps.max_batch_delete
             )));
         }
         let mut st = self.lock();
         for k in keys {

---- a_batch_delete_over_the_backend_limit_is_refused stdout ----

thread 'a_batch_delete_over_the_backend_limit_is_refused' panicked at crates/pstore-blob/tests/semantics.rs:131:5:
assertion failed: s.delete_batch(&too_many).await.is_err()

failures:
    a_batch_delete_over_the_backend_limit_is_refused

test result: FAILED. 14 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
