*** crates/pstore-blob/src/memory.rs:183:9: replace <impl crate::BlobStore for MemoryStore>::delete_batch -> Result<(), BlobError> with Ok(())

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ replace <impl crate::BlobStore for MemoryStore>::delete_batch -> Result<(), BlobError> with Ok(())
@@ -175,28 +175,17 @@
         }
         let tag = self.next_tag(&mut st, &body);
         st.objects
             .insert(key.as_str().to_owned(), (body, tag.clone()));
         Ok(PutOutcome { tag })
     }
 
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
-        if keys.len() > self.caps.max_batch_delete {
-            return Err(BlobError::Other(format!(
-                "batch of {} exceeds the backend's limit of {}",
-                keys.len(),
-                self.caps.max_batch_delete
-            )));
-        }
-        let mut st = self.lock();
-        for k in keys {
-            st.objects.remove(k.as_str());
-        }
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn list_unrestricted(&self, prefix: &Key) -> Result<Vec<Key>, BlobError> {
         Ok(self
             .lock()
             .objects
             .keys()
             .filter(|k| k.starts_with(prefix.as_str()))

---- delete_batch_removes_only_the_named_keys stdout ----

thread 'delete_batch_removes_only_the_named_keys' panicked at crates/pstore-blob/tests/cas.rs:89:5:
assertion failed: s.get(&k("a")).await.is_err()

failures:
    delete_batch_removes_only_the_named_keys

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
