*** crates/pstore-blob/src/memory.rs:198:23: replace > with < in <impl crate::BlobStore for MemoryStore>::delete_batch

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ replace > with < in <impl crate::BlobStore for MemoryStore>::delete_batch
@@ -190,17 +190,17 @@
         }
         let tag = self.next_tag(&mut st, &body);
         st.objects
             .insert(key.as_str().to_owned(), (body, tag.clone()));
         Ok(PutOutcome { tag })
     }
 
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
-        if keys.len() > self.caps.max_batch_delete {
+        if keys.len() < /* ~ changed by cargo-mutants ~ */ self.caps.max_batch_delete {
             return Err(BlobError::Other(format!(
                 "batch of {} exceeds the backend's limit of {}",
                 keys.len(),
                 self.caps.max_batch_delete
             )));
         }
         let mut st = self.lock();
         for k in keys {

---- delete_batch_removes_only_the_named_keys stdout ----

thread 'delete_batch_removes_only_the_named_keys' panicked at crates/pstore-blob/tests/cas.rs:88:45:
called `Result::unwrap()` on an `Err` value: Other("batch of 2 exceeds the backend's limit of 1000")

failures:
    delete_batch_removes_only_the_named_keys

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
