*** crates/pstore-blob/src/memory.rs:58:9: replace MemoryStore::with_tag_style -> Self with Default::default()

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ replace MemoryStore::with_tag_style -> Self with Default::default()
@@ -50,28 +50,17 @@
     #[must_use]
     pub fn new() -> Self {
         Self::with_tag_style(TagStyle::Monotonic)
     }
 
     /// A backend with the chosen tag semantics, for exercising the ABA hazard.
     #[must_use]
     pub fn with_tag_style(tag_style: TagStyle) -> Self {
-        Self {
-            state: Arc::new(Mutex::new(State::default())),
-            caps: Capabilities {
-                backend: format!("memory({tag_style:?})"),
-                cas: Support::Supported,
-                create_if_absent: Support::Supported,
-                delete_is_free: true,
-                max_batch_delete: 1000,
-                coalesce_gap: 64 * 1024,
-            },
-            tag_style,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Poison recovery rather than `unwrap`: a panic in another thread must not make the
     /// store permanently unusable, and this crate denies `unwrap_used`.
     fn lock(&self) -> std::sync::MutexGuard<'_, State> {
         self.state
             .lock()
             .unwrap_or_else(std::sync::PoisonError::into_inner)

*** result: Failure(101)
