*** crates/pstore-blob/src/memory.rs:65:9: replace MemoryStore::with_coalesce_gap -> Self with Default::default()

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ replace MemoryStore::with_coalesce_gap -> Self with Default::default()
@@ -57,19 +57,17 @@
     /// ⚠️ Exists because the default 64 KiB gap is larger than a small fixture's whole
     /// object, so every ranged read merges into one and a test measuring "does asking for
     /// more ranges move more bytes" measures the coalescer instead. At production sizing a
     /// posting list is tens of kilobytes and the gap does not merge them; at test sizing it
     /// does, and shrinking the gap is the honest way to keep the fixture small without
     /// removing the effect under test.
     #[must_use]
     pub fn with_coalesce_gap(gap: u64) -> Self {
-        let mut s = Self::new();
-        s.caps.coalesce_gap = gap;
-        s
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// A backend with the chosen tag semantics, for exercising the ABA hazard.
     #[must_use]
     pub fn with_tag_style(tag_style: TagStyle) -> Self {
         Self {
             state: Arc::new(Mutex::new(State::default())),
             caps: Capabilities {

---- probing_more_lists_costs_bytes_not_depth stdout ----

thread 'probing_more_lists_costs_bytes_not_depth' panicked at crates/pstore-index/tests/persisted.rs:213:5:
p=64 moved 120544 bytes against p=4's 116288: probing wider is not costing bytes, so it is probably not probing wider

failures:
    probing_more_lists_costs_bytes_not_depth

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.69s

*** result: Failure(101)
