*** crates/pstore-blob/src/memory.rs:66:34: replace * with + in MemoryStore::with_tag_style

*** mutation diff:
--- crates/pstore-blob/src/memory.rs
+++ replace * with + in MemoryStore::with_tag_style
@@ -58,17 +58,17 @@
         Self {
             state: Arc::new(Mutex::new(State::default())),
             caps: Capabilities {
                 backend: format!("memory({tag_style:?})"),
                 cas: Support::Supported,
                 create_if_absent: Support::Supported,
                 delete_is_free: true,
                 max_batch_delete: 1000,
-                coalesce_gap: 64 * 1024,
+                coalesce_gap: 64 + /* ~ changed by cargo-mutants ~ */ 1024,
             },
             tag_style,
         }
     }
 
     /// Poison recovery rather than `unwrap`: a panic in another thread must not make the
     /// store permanently unusable, and this crate denies `unwrap_used`.
     fn lock(&self) -> std::sync::MutexGuard<'_, State> {

*** result: Success
