*** crates/pstore-blob/src/object_store_backend.rs:139:9: replace <impl crate::BlobStore for ObjectStoreBackend>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-blob/src/object_store_backend.rs
+++ replace <impl crate::BlobStore for ObjectStoreBackend>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -131,27 +131,17 @@
             .await
             .map_err(Self::map_err)?;
         let tag = CasTag::new(r.meta.e_tag.clone().unwrap_or_default());
         Ok((r.bytes().await.map_err(Self::map_err)?, tag))
     }
 
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
         // `GetRange::Suffix` is `Range: bytes=-N` on the wire. No `head` first.
-        let opts = object_store::GetOptions {
-            range: Some(object_store::GetRange::Suffix(n)),
-            ..Default::default()
-        };
-        self.inner
-            .get_opts(&Self::path(key), opts)
-            .await
-            .map_err(Self::map_err)?
-            .bytes()
-            .await
-            .map_err(Self::map_err)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_tag(&self, key: &Key) -> Option<CasTag> {
         self.inner
             .head(&Self::path(key))
             .await
             .ok()
             .and_then(|m| m.e_tag)

---- the_conformance_suite_runs_through_the_adapter stdout ----

thread 'the_conformance_suite_runs_through_the_adapter' panicked at crates/pstore-blob/tests/object_store_adapter.rs:87:5:
divergences: [Probe { name: "suffix_read", outcome: Divergent("a 4-byte suffix returned 0 bytes: \"\"") }]

failures:
    the_conformance_suite_runs_through_the_adapter

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
