*** crates/pstore-blob/src/object_store_backend.rs:162:9: replace <impl crate::BlobStore for ObjectStoreBackend>::head -> Result<u64, BlobError> with Ok(0)

*** mutation diff:
--- crates/pstore-blob/src/object_store_backend.rs
+++ replace <impl crate::BlobStore for ObjectStoreBackend>::head -> Result<u64, BlobError> with Ok(0)
@@ -154,21 +154,17 @@
             .head(&Self::path(key))
             .await
             .ok()
             .and_then(|m| m.e_tag)
             .map(CasTag::new)
     }
 
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {
-        self.inner
-            .head(&Self::path(key))
-            .await
-            .map(|m| m.size)
-            .map_err(Self::map_err)
+        Ok(0) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn put(&self, key: &Key, body: Bytes) -> Result<PutOutcome, BlobError> {
         let r = self
             .inner
             .put(&Self::path(key), body.into())
             .await
             .map_err(Self::map_err)?;

*** result: Success
