*** crates/pstore-blob/src/object_store_backend.rs:97:9: replace <impl crate::BlobStore for ObjectStoreBackend>::get -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-blob/src/object_store_backend.rs
+++ replace <impl crate::BlobStore for ObjectStoreBackend>::get -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -89,23 +89,17 @@
 
 #[async_trait::async_trait]
 impl crate::BlobStore for ObjectStoreBackend {
     fn capabilities(&self) -> &Capabilities {
         &self.caps
     }
 
     async fn get(&self, key: &Key) -> Result<Bytes, BlobError> {
-        self.inner
-            .get(&Self::path(key))
-            .await
-            .map_err(Self::map_err)?
-            .bytes()
-            .await
-            .map_err(Self::map_err)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
         let want = range.end.saturating_sub(range.start);
         let got = self
             .inner
             .get_range(&Self::path(key), range.clone())
             .await

---- the_conformance_suite_runs_through_the_adapter stdout ----

thread 'the_conformance_suite_runs_through_the_adapter' panicked at crates/pstore-blob/tests/object_store_adapter.rs:87:5:
divergences: [Probe { name: "missing_key_is_an_error", outcome: Divergent("a missing key returned a body") }, Probe { name: "batch_delete", outcome: Divergent("a deleted key still returned a body") }]

---- the_trait_fits_a_real_object_store_implementation stdout ----

thread 'the_trait_fits_a_real_object_store_implementation' panicked at crates/pstore-blob/tests/object_store_adapter.rs:35:5:
assertion `left == right` failed
  left: []
 right: [48, 49, 50, 51, 52, 53, 54, 55, 56, 57]

failures:
    the_conformance_suite_runs_through_the_adapter
    the_trait_fits_a_real_object_store_implementation

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
