*** crates/pstore-blob/src/types.rs:67:9: replace CasError::should_rebase -> bool with true

*** mutation diff:
--- crates/pstore-blob/src/types.rs
+++ replace CasError::should_rebase -> bool with true
@@ -59,17 +59,17 @@
 
 impl CasError {
     /// Whether losing this way invalidates the state the caller built its attempt on.
     ///
     /// Getting this wrong is expensive in exactly one direction: treating `Contended` as
     /// `Lost` rebuilds the world on every transient conflict.
     #[must_use]
     pub fn should_rebase(&self) -> bool {
-        matches!(self, Self::Lost)
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Anything that can go wrong on an unconditional operation.
 #[derive(Debug, Clone, PartialEq, Eq, thiserror::Error)]
 pub enum BlobError {
     /// The key does not exist. On the WAL tail-probe path this is a **normal** answer:
     /// it is what bounds the lane.

---- cas_lost_and_contended_are_distinct stdout ----

thread 'cas_lost_and_contended_are_distinct' panicked at crates/pstore-blob/tests/cas.rs:68:5:
assertion failed: !CasError::Contended.should_rebase()

failures:
    cas_lost_and_contended_are_distinct

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
