*** crates/pstore-engine/src/bundle.rs:35:5: replace encode -> Vec<u8> with vec![]

*** mutation diff:
--- crates/pstore-engine/src/bundle.rs
+++ replace encode -> Vec<u8> with vec![]
@@ -27,50 +27,17 @@
     pub len: u32,
     /// Documents in it.
     pub docs: u32,
 }
 
 /// Encodes one bundle from per-index document runs.
 #[must_use]
 pub(crate) fn encode(by_index: &BTreeMap<String, Vec<Document>>) -> Vec<u8> {
-    let mut body = Vec::new();
-    let mut entries: Vec<(&str, Entry)> = Vec::new();
-    for (name, docs) in by_index {
-        let offset = body.len() as u64;
-        let run = encode_docs(docs);
-        let len = run.len() as u32;
-        body.extend_from_slice(&run);
-        entries.push((
-            name,
-            Entry {
-                offset,
-                len,
-                docs: docs.len() as u32,
-            },
-        ));
-    }
-    let index_offset = body.len() as u64;
-    let mut idx = Vec::new();
-    idx.extend_from_slice(&(entries.len() as u32).to_le_bytes());
-    for (name, e) in &entries {
-        idx.extend_from_slice(&(name.len() as u32).to_le_bytes());
-        idx.extend_from_slice(name.as_bytes());
-        idx.extend_from_slice(&e.offset.to_le_bytes());
-        idx.extend_from_slice(&e.len.to_le_bytes());
-        idx.extend_from_slice(&e.docs.to_le_bytes());
-    }
-    let index_len = idx.len() as u32;
-    body.extend_from_slice(&idx);
-    // Footer last and fixed-width, same contract as a segment: one suffix read finds it.
-    body.extend_from_slice(MAGIC);
-    body.extend_from_slice(&index_offset.to_le_bytes());
-    body.extend_from_slice(&index_len.to_le_bytes());
-    body.extend_from_slice(MAGIC);
-    body
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// The bundle's directory: which indexes it carries and where.
 pub(crate) fn read_index(buf: &[u8]) -> Result<BTreeMap<String, Entry>, EngineError> {
     let foot_len = 8 + 8 + 4 + 8;
     let at = buf
         .len()
         .checked_sub(foot_len)

---- a_bundle_with_an_impossible_index_offset_fails_the_fold stdout ----

thread 'a_bundle_with_an_impossible_index_offset_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:100:14:
attempt to subtract with overflow

---- a_bundle_with_a_mangled_footer_fails_the_fold stdout ----

thread 'a_bundle_with_a_mangled_footer_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:83:9:
attempt to subtract with overflow

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:133:20:
called `Result::unwrap()` on an `Err` value: CorruptBundle

failures:
    a_bundle_with_a_mangled_footer_fails_the_fold
    a_bundle_with_an_impossible_index_offset_fails_the_fold
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 4 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
