*** crates/pstore-engine/src/bundle.rs:73:30: replace + with - in read_index

*** mutation diff:
--- crates/pstore-engine/src/bundle.rs
+++ replace + with - in read_index
@@ -65,17 +65,17 @@
     body.extend_from_slice(&index_offset.to_le_bytes());
     body.extend_from_slice(&index_len.to_le_bytes());
     body.extend_from_slice(MAGIC);
     body
 }
 
 /// The bundle's directory: which indexes it carries and where.
 pub(crate) fn read_index(buf: &[u8]) -> Result<BTreeMap<String, Entry>, EngineError> {
-    let foot_len = 8 + 8 + 4 + 8;
+    let foot_len = 8 + 8 + 4 - /* ~ changed by cargo-mutants ~ */ 8;
     let at = buf
         .len()
         .checked_sub(foot_len)
         .ok_or(EngineError::CorruptBundle)?;
     let foot = buf.get(at..).ok_or(EngineError::CorruptBundle)?;
     if foot.get(..8) != Some(&MAGIC[..]) || foot.get(foot_len - 8..) != Some(&MAGIC[..]) {
         return Err(EngineError::CorruptBundle);
     }

---- the_whole_flow_stays_inside_its_request_budget stdout ----

thread 'the_whole_flow_stays_inside_its_request_budget' panicked at crates/pstore-engine/tests/end_to_end.rs:105:24:
called `Result::unwrap()` on an `Err` value: CorruptBundle

---- write_read_filter_and_search_one_index stdout ----

thread 'write_read_filter_and_search_one_index' panicked at crates/pstore-engine/tests/end_to_end.rs:44:28:
called `Result::unwrap()` on an `Err` value: CorruptBundle

failures:
    the_whole_flow_stays_inside_its_request_budget
    write_read_filter_and_search_one_index

test result: FAILED. 0 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
