*** crates/pstore-engine/src/bundle.rs:73:5: replace read_index -> Result<BTreeMap<String, Entry>, EngineError> with Ok(BTreeMap::new())

*** mutation diff:
--- crates/pstore-engine/src/bundle.rs
+++ replace read_index -> Result<BTreeMap<String, Entry>, EngineError> with Ok(BTreeMap::new())
@@ -65,84 +65,17 @@
     body.extend_from_slice(&index_offset.to_le_bytes());
     body.extend_from_slice(&index_len.to_le_bytes());
     body.extend_from_slice(MAGIC);
     body
 }
 
 /// The bundle's directory: which indexes it carries and where.
 pub(crate) fn read_index(buf: &[u8]) -> Result<BTreeMap<String, Entry>, EngineError> {
-    let foot_len = 8 + 8 + 4 + 8;
-    let at = buf
-        .len()
-        .checked_sub(foot_len)
-        .ok_or(EngineError::CorruptBundle)?;
-    let foot = buf.get(at..).ok_or(EngineError::CorruptBundle)?;
-    if foot.get(..8) != Some(&MAGIC[..]) || foot.get(foot_len - 8..) != Some(&MAGIC[..]) {
-        return Err(EngineError::CorruptBundle);
-    }
-    let index_offset = u64::from_le_bytes(
-        foot.get(8..16)
-            .and_then(|b| b.try_into().ok())
-            .ok_or(EngineError::CorruptBundle)?,
-    ) as usize;
-    let index_len = u32::from_le_bytes(
-        foot.get(16..20)
-            .and_then(|b| b.try_into().ok())
-            .ok_or(EngineError::CorruptBundle)?,
-    ) as usize;
-    // ⚠️ Checked: a tampered offset of u64::MAX overflowed the addition and PANICKED
-    // rather than returning an error -- a crash vector reachable from a malformed object,
-    // which is the one input a storage layer must assume is hostile.
-    let end = index_offset
-        .checked_add(index_len)
-        .ok_or(EngineError::CorruptBundle)?;
-    let idx = buf
-        .get(index_offset..end)
-        .ok_or(EngineError::CorruptBundle)?;
-
-    let mut out = BTreeMap::new();
-    let mut i = 0usize;
-    let take = |i: &mut usize, n: usize| -> Result<&[u8], EngineError> {
-        let end = i.checked_add(n).ok_or(EngineError::CorruptBundle)?;
-        let s = idx.get(*i..end).ok_or(EngineError::CorruptBundle)?;
-        *i = end;
-        Ok(s)
-    };
-    let count = u32::from_le_bytes(
-        take(&mut i, 4)?
-            .try_into()
-            .map_err(|_| EngineError::CorruptBundle)?,
-    );
-    for _ in 0..count {
-        let nlen = u32::from_le_bytes(
-            take(&mut i, 4)?
-                .try_into()
-                .map_err(|_| EngineError::CorruptBundle)?,
-        ) as usize;
-        let name = String::from_utf8(take(&mut i, nlen)?.to_vec())
-            .map_err(|_| EngineError::CorruptBundle)?;
-        let offset = u64::from_le_bytes(
-            take(&mut i, 8)?
-                .try_into()
-                .map_err(|_| EngineError::CorruptBundle)?,
-        );
-        let len = u32::from_le_bytes(
-            take(&mut i, 4)?
-                .try_into()
-                .map_err(|_| EngineError::CorruptBundle)?,
-        );
-        let docs = u32::from_le_bytes(
-            take(&mut i, 4)?
-                .try_into()
-                .map_err(|_| EngineError::CorruptBundle)?,
-        );
-        out.insert(name, Entry { offset, len, docs });
-    }
-    Ok(out)
+    Ok(BTreeMap::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// One index's documents, decoded from its slice of a bundle.
 pub(crate) fn read_entry(buf: &[u8], e: &Entry) -> Result<Vec<Document>, EngineError> {
     let start = e.offset as usize;
     let end = start
         .checked_add(e.len as usize)
         .ok_or(EngineError::CorruptBundle)?;

---- a_bundle_with_a_mangled_footer_fails_the_fold stdout ----

thread 'a_bundle_with_a_mangled_footer_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:85:5:
assertion failed: e.fold().await.is_err()

---- a_bundle_with_an_impossible_index_offset_fails_the_fold stdout ----

thread 'a_bundle_with_an_impossible_index_offset_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:103:5:
an offset past the object must not be trusted

failures:
    a_bundle_with_a_mangled_footer_fails_the_fold
    a_bundle_with_an_impossible_index_offset_fails_the_fold

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
