*** crates/pstore-engine/src/head.rs:133:5: replace put_str with ()

*** mutation diff:
--- crates/pstore-engine/src/head.rs
+++ replace put_str with ()
@@ -125,18 +125,17 @@
     /// Whether this lane's sequence has already been folded into a committed epoch.
     #[must_use]
     pub fn is_folded(&self, lane: LaneId, seq: Seq) -> bool {
         self.watermarks.get(&lane.0).is_some_and(|w| *w > seq.0)
     }
 }
 
 fn put_str(out: &mut Vec<u8>, s: &str) {
-    out.extend_from_slice(&(s.len() as u32).to_le_bytes());
-    out.extend_from_slice(s.as_bytes());
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 struct Cur<'a> {
     b: &'a [u8],
     i: usize,
 }
 
 impl Cur<'_> {

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:134:41:
called `Result::unwrap()` on an `Err` value: CorruptHead

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
