*** crates/pstore-engine/src/head.rs:208:5: replace commit -> Result<Epoch, EngineError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-engine/src/head.rs
+++ replace commit -> Result<Epoch, EngineError> with Ok(Default::default())
@@ -200,22 +200,10 @@
 /// duplicated cannot land, because its write names a version of the world that no longer
 /// exists — and the *storage layer* enforces that, not a lock we would have to keep alive.
 pub(crate) async fn commit<S: BlobStore>(
     store: &S,
     tenant: pstore_types::TenantId,
     at: &HeadAt,
     next: &Head,
 ) -> Result<Epoch, EngineError> {
-    let pre = match &at.tag {
-        Some(t) => Precondition::Match(t.clone()),
-        None => Precondition::NotExists,
-    };
-    match store
-        .put_conditional(&Head::key(tenant), next.encode().into(), pre)
-        .await
-    {
-        Ok(_) => Ok(next.epoch),
-        Err(CasError::Lost) => Err(EngineError::Lost),
-        Err(CasError::Contended) => Err(EngineError::Contended),
-        Err(CasError::Io(e)) => Err(EngineError::Blob(e)),
-    }
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:135:5:
rows before the hole must still be folded

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
