*** crates/pstore-engine/src/lanes.rs:119:5: replace tail -> Result<u64, EngineError> with Ok(1)

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace tail -> Result<u64, EngineError> with Ok(1)
@@ -111,42 +111,10 @@
 /// written. Probes in each window go out together, so cost is reads rather than round
 /// trips, and a 404 is a normal answer — it is what bounds the lane.
 pub async fn tail<S: BlobStore>(
     store: &S,
     tenant: TenantId,
     lane: LaneId,
     from: u64,
 ) -> Result<u64, EngineError> {
-    let mut base = from;
-    let mut window = FIRST_PROBE_WINDOW;
-    // ⚠️ Bounded, not `loop`. The termination condition is "the store answered 404", which
-    // means a store that never does — hostile, buggy, or serving a lane genuinely longer
-    // than any tenant could write — spins here forever, on a path a query waits on. An
-    // unbounded loop whose exit depends on a remote answer is a liveness bug however
-    // correct the logic is; mutation testing surfaced it as a hung test rather than a
-    // failing one, which is the expensive way to find out.
-    for _ in 0..MAX_PROBE_ROUNDS {
-        let keys: Vec<Key> = (base..base + window)
-            .map(|n| crate::bundle_key(tenant, lane, pstore_types::Seq(n)))
-            .collect();
-        // All at once: the window is width, not depth.
-        let present = futures_util::future::join_all(keys.iter().map(|k| store.head(k))).await;
-        let mut found = 0u64;
-        for r in present {
-            match r {
-                Ok(_) => found += 1,
-                // ⚠️ Stops at the FIRST gap rather than counting what exists. A lane is
-                // dense by construction, so a hole means the object is missing rather than
-                // never written — and skipping past it would silently drop everything
-                // before the next present key.
-                Err(pstore_blob::BlobError::NotFound(_)) => break,
-                Err(e) => return Err(e.into()),
-            }
-        }
-        base += found;
-        if found < window {
-            return Ok(base);
-        }
-        window = (window * 2).min(MAX_PROBE_WINDOW);
-    }
-    Err(EngineError::LaneTooLong(lane))
+    Ok(1) /* ~ changed by cargo-mutants ~ */
 }

---- compaction_collapses_the_segments_it_merged stdout ----

thread 'compaction_collapses_the_segments_it_merged' panicked at crates/pstore-engine/tests/compaction.rs:87:37:
called `Option::unwrap()` on a `None` value

---- compaction_does_not_change_the_answer stdout ----

thread 'compaction_does_not_change_the_answer' panicked at crates/pstore-engine/tests/compaction.rs:62:5:
nothing was compacted

---- concurrent_compactors_produce_one_winner stdout ----

thread 'concurrent_compactors_produce_one_winner' panicked at crates/pstore-engine/tests/compaction.rs:153:5:
assertion `left == right` failed: 0 compactors committed; exactly one may win and the rest must discard
  left: 0
 right: 1

failures:
    a_fold_landing_mid_compaction_is_not_swallowed_by_it
    a_losing_compactors_output_is_unreferenced
    compaction_collapses_the_segments_it_merged
    compaction_does_not_change_the_answer
    concurrent_compactors_produce_one_winner

test result: FAILED. 1 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 5.01s

*** result: Failure(101)
