*** crates/pstore-engine/src/lanes.rs:124:32: replace += with -= in tail

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace += with -= in tail
@@ -116,17 +116,17 @@
         let keys: Vec<Key> = (base..base + window)
             .map(|n| crate::bundle_key(tenant, lane, pstore_types::Seq(n)))
             .collect();
         // All at once: the window is width, not depth.
         let present = futures_util::future::join_all(keys.iter().map(|k| store.head(k))).await;
         let mut found = 0u64;
         for r in present {
             match r {
-                Ok(_) => found += 1,
+                Ok(_) => found -= /* ~ changed by cargo-mutants ~ */ 1,
                 // ⚠️ Stops at the FIRST gap rather than counting what exists. A lane is
                 // dense by construction, so a hole means the object is missing rather than
                 // never written — and skipping past it would silently drop everything
                 // before the next present key.
                 Err(pstore_blob::BlobError::NotFound(_)) => break,
                 Err(e) => return Err(e.into()),
             }
         }

---- a_bundle_with_a_mangled_footer_fails_the_fold stdout ----

thread 'a_bundle_with_a_mangled_footer_fails_the_fold' panicked at /tmp/cargo-mutants-pstore-gtu1Ih.tmp/crates/pstore-engine/src/lanes.rs:124:26:
attempt to subtract with overflow

---- a_bundle_with_an_impossible_index_offset_fails_the_fold stdout ----

thread 'a_bundle_with_an_impossible_index_offset_fails_the_fold' panicked at /tmp/cargo-mutants-pstore-gtu1Ih.tmp/crates/pstore-engine/src/lanes.rs:124:26:
attempt to subtract with overflow

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at /tmp/cargo-mutants-pstore-gtu1Ih.tmp/crates/pstore-engine/src/lanes.rs:124:26:
attempt to subtract with overflow

failures:
    a_bundle_with_a_mangled_footer_fails_the_fold
    a_bundle_with_an_impossible_index_offset_fails_the_fold
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 4 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
