*** crates/pstore-engine/src/lanes.rs:134:18: replace < with <= in tail

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace < with <= in tail
@@ -126,14 +126,14 @@
                 // dense by construction, so a hole means the object is missing rather than
                 // never written — and skipping past it would silently drop everything
                 // before the next present key.
                 Err(pstore_blob::BlobError::NotFound(_)) => break,
                 Err(e) => return Err(e.into()),
             }
         }
         base += found;
-        if found < window {
+        if found <= /* ~ changed by cargo-mutants ~ */ window {
             return Ok(base);
         }
         window = (window * 2).min(MAX_PROBE_WINDOW);
     }
 }

---- probing_resumes_from_a_watermark_rather_than_from_zero stdout ----

thread 'probing_resumes_from_a_watermark_rather_than_from_zero' panicked at crates/pstore-engine/tests/lanes.rs:131:5:
assertion `left == right` failed
  left: 8
 right: 300

---- a_probe_window_grows_so_a_long_lane_costs_few_round_trips stdout ----

thread 'a_probe_window_grows_so_a_long_lane_costs_few_round_trips' panicked at crates/pstore-engine/tests/lanes.rs:159:5:
assertion `left == right` failed
  left: 8
 right: 500

failures:
    a_probe_window_grows_so_a_long_lane_costs_few_round_trips
    probing_resumes_from_a_watermark_rather_than_from_zero

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
