*** crates/pstore-engine/src/lanes.rs:145:14: replace += with *= in tail

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace += with *= in tail
@@ -137,16 +137,16 @@
                 // ⚠️ Stops at the FIRST gap rather than counting what exists. A lane is
                 // dense by construction, so a hole means the object is missing rather than
                 // never written — and skipping past it would silently drop everything
                 // before the next present key.
                 Err(pstore_blob::BlobError::NotFound(_)) => break,
                 Err(e) => return Err(e.into()),
             }
         }
-        base += found;
+        base *= /* ~ changed by cargo-mutants ~ */ found;
         if found < window {
             return Ok(base);
         }
         window = (window * 2).min(MAX_PROBE_WINDOW);
     }
     Err(EngineError::LaneTooLong(lane))
 }

---- a_bundle_with_a_mangled_footer_fails_the_fold stdout ----

thread 'a_bundle_with_a_mangled_footer_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:85:5:
assertion failed: e.fold().await.is_err()

---- a_bundle_with_an_impossible_index_offset_fails_the_fold stdout ----

thread 'a_bundle_with_an_impossible_index_offset_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:103:5:
an offset past the object must not be trusted

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:127:5:
assertion `left == right` failed: the tail is the hole
  left: 0
 right: 1

failures:
    a_bundle_with_a_mangled_footer_fails_the_fold
    a_bundle_with_an_impossible_index_offset_fails_the_fold
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 4 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
