*** crates/pstore-engine/src/lanes.rs:146:18: replace < with == in tail

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace < with == in tail
@@ -138,15 +138,15 @@
                 // dense by construction, so a hole means the object is missing rather than
                 // never written — and skipping past it would silently drop everything
                 // before the next present key.
                 Err(pstore_blob::BlobError::NotFound(_)) => break,
                 Err(e) => return Err(e.into()),
             }
         }
         base += found;
-        if found < window {
+        if found == /* ~ changed by cargo-mutants ~ */ window {
             return Ok(base);
         }
         window = (window * 2).min(MAX_PROBE_WINDOW);
     }
     Err(EngineError::LaneTooLong(lane))
 }

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:128:49:
called `Result::unwrap()` on an `Err` value: LaneTooLong(LaneId(1))

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
