*** crates/pstore-engine/src/lanes.rs:149:26: replace * with / in tail

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace * with / in tail
@@ -141,12 +141,12 @@
                 Err(pstore_blob::BlobError::NotFound(_)) => break,
                 Err(e) => return Err(e.into()),
             }
         }
         base += found;
         if found < window {
             return Ok(base);
         }
-        window = (window * 2).min(MAX_PROBE_WINDOW);
+        window = (window / /* ~ changed by cargo-mutants ~ */ 2).min(MAX_PROBE_WINDOW);
     }
     Err(EngineError::LaneTooLong(lane))
 }

---- a_cold_read_of_a_large_segment_still_costs_three_rounds stdout ----

thread 'a_cold_read_of_a_large_segment_still_costs_three_rounds' panicked at crates/pstore-engine/tests/depth_at_scale.rs:36:20:
called `Result::unwrap()` on an `Err` value: LaneTooLong(LaneId(0))

---- bounding_the_index_does_not_just_move_the_cost_into_bytes stdout ----

thread 'bounding_the_index_does_not_just_move_the_cost_into_bytes' panicked at crates/pstore-engine/tests/depth_at_scale.rs:86:20:
called `Result::unwrap()` on an `Err` value: LaneTooLong(LaneId(0))

failures:
    a_cold_read_of_a_large_segment_still_costs_three_rounds
    bounding_the_index_does_not_just_move_the_cost_into_bytes

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
