*** crates/pstore-engine/src/lanes.rs:45:5: replace decode -> Result<BTreeSet<LaneId>, EngineError> with Ok(BTreeSet::new())

*** mutation diff:
--- crates/pstore-engine/src/lanes.rs
+++ replace decode -> Result<BTreeSet<LaneId>, EngineError> with Ok(BTreeSet::new())
@@ -37,24 +37,17 @@
 const MAX_LANES: usize = 4096;
 
 /// The registry's key, derived from the tenant like every other key here.
 pub fn key(tenant: TenantId) -> Key {
     Key::new(format!("{:04x}/tnt/{}/lanes", tenant.0 as u16, tenant.0))
 }
 
 fn decode(buf: &[u8]) -> Result<BTreeSet<LaneId>, EngineError> {
-    if !buf.len().is_multiple_of(8) || buf.len() / 8 > MAX_LANES {
-        return Err(EngineError::CorruptHead);
-    }
-    Ok(buf
-        .chunks_exact(8)
-        .filter_map(|c| c.try_into().ok())
-        .map(|b| LaneId(u64::from_le_bytes(b)))
-        .collect())
+    Ok(BTreeSet::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn encode(set: &BTreeSet<LaneId>) -> Vec<u8> {
     set.iter().flat_map(|l| l.0.to_le_bytes()).collect()
 }
 
 /// Records that `lane` exists, if it is not already recorded.
 ///

---- a_bundle_with_a_mangled_footer_fails_the_fold stdout ----

thread 'a_bundle_with_a_mangled_footer_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:85:5:
assertion failed: e.fold().await.is_err()

---- a_bundle_with_an_impossible_index_offset_fails_the_fold stdout ----

thread 'a_bundle_with_an_impossible_index_offset_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:103:5:
an offset past the object must not be trusted

failures:
    a_bundle_with_a_mangled_footer_fails_the_fold
    a_bundle_with_an_impossible_index_offset_fails_the_fold

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
