*** crates/pstore-engine/src/lib.rs:114:26: replace % with / in backoff

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace % with / in backoff
@@ -106,17 +106,17 @@
 ///
 /// ⚠️ Jittered, and that is not decoration. Without it optimistic concurrency
 /// **livelocks**: every loser retries immediately, collides with the same peers, and
 /// loses again. It surfaced as a *flaky* test rather than a failing one, which is the
 /// more expensive way to find out. The jitter comes from the lane rather than a random
 /// source so a failing schedule still replays.
 async fn backoff(lane: LaneId, attempt: u32) {
     let base = 1u64 << attempt.min(6);
-    let jitter = (lane.0 % 8) + 1;
+    let jitter = (lane.0 / /* ~ changed by cargo-mutants ~ */ 8) + 1;
     tokio::time::sleep(std::time::Duration::from_micros(base * jitter)).await;
 }
 
 impl<S: BlobStore> Engine<S> {
     /// A writer on one lane of one tenant.
     pub fn new(store: Arc<S>, tenant: TenantId, lane: LaneId) -> Self {
         Self {
             store,

*** result: Success
