*** crates/pstore-engine/src/lib.rs:142:26: replace % with / in backoff_delay

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace % with / in backoff_delay
@@ -134,17 +134,17 @@
 /// that can be stated and checked; a sleep does not.
 #[must_use]
 pub fn backoff_delay(lane: LaneId, attempt: u32) -> std::time::Duration {
     // Doubling, capped: the cap stops a late retry waiting far longer than the operation
     // it is retrying.
     let base = 1u64 << attempt.min(BACKOFF_CAP_SHIFT);
     // 1..=8, never 0: a jitter that can be zero leaves the lanes that draw it colliding
     // in lockstep, which is the livelock this exists to prevent.
-    let jitter = (lane.0 % JITTER_SPREAD) + 1;
+    let jitter = (lane.0 / /* ~ changed by cargo-mutants ~ */ JITTER_SPREAD) + 1;
     std::time::Duration::from_micros(base * jitter)
 }
 
 /// Where the doubling stops.
 const BACKOFF_CAP_SHIFT: u32 = 6;
 /// How many distinct delays a given attempt can produce.
 const JITTER_SPREAD: u64 = 8;

---- lanes_do_not_back_off_in_lockstep stdout ----

thread 'lanes_do_not_back_off_in_lockstep' panicked at crates/pstore-engine/tests/arithmetic.rs:64:9:
assertion `left == right` failed: attempt 0: 8 lanes produced only 1 distinct delays
  left: 1
 right: 8

failures:
    lanes_do_not_back_off_in_lockstep

test result: FAILED. 4 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
