*** crates/pstore-engine/src/lib.rs:145:21: replace << with >> in backoff_delay

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace << with >> in backoff_delay
@@ -137,17 +137,17 @@
 /// contents were invisible to every test — mutation testing replaced the whole body with
 /// nothing, inverted the shift, and swapped the arithmetic, and not one test noticed,
 /// because the only observable was elapsed microseconds. A pure function has a contract
 /// that can be stated and checked; a sleep does not.
 #[must_use]
 pub fn backoff_delay(lane: LaneId, attempt: u32) -> std::time::Duration {
     // Doubling, capped: the cap stops a late retry waiting far longer than the operation
     // it is retrying.
-    let base = 1u64 << attempt.min(BACKOFF_CAP_SHIFT);
+    let base = 1u64 >> /* ~ changed by cargo-mutants ~ */ attempt.min(BACKOFF_CAP_SHIFT);
     // 1..=8, never 0: a jitter that can be zero leaves the lanes that draw it colliding
     // in lockstep, which is the livelock this exists to prevent.
     let jitter = (lane.0 % JITTER_SPREAD) + 1;
     std::time::Duration::from_micros(base * jitter)
 }
 
 /// Where the doubling stops.
 const BACKOFF_CAP_SHIFT: u32 = 6;

---- lanes_do_not_back_off_in_lockstep stdout ----

thread 'lanes_do_not_back_off_in_lockstep' panicked at crates/pstore-engine/tests/arithmetic.rs:64:9:
assertion `left == right` failed: attempt 1: 8 lanes produced only 1 distinct delays
  left: 1
 right: 8

---- backoff_grows_with_the_attempt stdout ----

thread 'backoff_grows_with_the_attempt' panicked at crates/pstore-engine/tests/arithmetic.rs:29:9:
attempt 1 did not wait longer than 0

failures:
    backoff_grows_with_the_attempt
    lanes_do_not_back_off_in_lockstep

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
