*** crates/pstore-engine/src/lib.rs:145:5: replace backoff_delay -> std::time::Duration with Default::default()

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace backoff_delay -> std::time::Duration with Default::default()
@@ -137,21 +137,17 @@
 /// contents were invisible to every test — mutation testing replaced the whole body with
 /// nothing, inverted the shift, and swapped the arithmetic, and not one test noticed,
 /// because the only observable was elapsed microseconds. A pure function has a contract
 /// that can be stated and checked; a sleep does not.
 #[must_use]
 pub fn backoff_delay(lane: LaneId, attempt: u32) -> std::time::Duration {
     // Doubling, capped: the cap stops a late retry waiting far longer than the operation
     // it is retrying.
-    let base = 1u64 << attempt.min(BACKOFF_CAP_SHIFT);
-    // 1..=8, never 0: a jitter that can be zero leaves the lanes that draw it colliding
-    // in lockstep, which is the livelock this exists to prevent.
-    let jitter = (lane.0 % JITTER_SPREAD) + 1;
-    std::time::Duration::from_micros(base * jitter)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Where the doubling stops.
 const BACKOFF_CAP_SHIFT: u32 = 6;
 /// How many distinct delays a given attempt can produce.
 const JITTER_SPREAD: u64 = 8;
 
 async fn backoff(lane: LaneId, attempt: u32) {

---- backoff_grows_with_the_attempt stdout ----

thread 'backoff_grows_with_the_attempt' panicked at crates/pstore-engine/tests/arithmetic.rs:29:9:
attempt 1 did not wait longer than 0

---- lanes_do_not_back_off_in_lockstep stdout ----

thread 'lanes_do_not_back_off_in_lockstep' panicked at crates/pstore-engine/tests/arithmetic.rs:64:9:
assertion `left == right` failed: attempt 0: 8 lanes produced only 1 distinct delays
  left: 1
 right: 8

failures:
    backoff_grows_with_the_attempt
    lanes_do_not_back_off_in_lockstep

test result: FAILED. 3 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
