*** crates/pstore-engine/src/lib.rs:158:5: replace backoff with ()

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace backoff with ()
@@ -150,17 +150,17 @@
 }
 
 /// Where the doubling stops.
 const BACKOFF_CAP_SHIFT: u32 = 6;
 /// How many distinct delays a given attempt can produce.
 const JITTER_SPREAD: u64 = 8;
 
 async fn backoff(lane: LaneId, attempt: u32) {
-    tokio::time::sleep(backoff_delay(lane, attempt)).await;
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 impl<S: BlobStore> Engine<S> {
     /// A writer on one lane of one tenant.
     pub fn new(store: Arc<S>, tenant: TenantId, lane: LaneId) -> Self {
         Self {
             store,
             tenant,

*** result: Success
