*** crates/pstore-engine/src/lib.rs:240:16: replace == with != in Engine<S>::flush

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace == with != in Engine<S>::flush
@@ -232,17 +232,17 @@
         let seq = *self
             .seq
             .lock()
             .unwrap_or_else(std::sync::PoisonError::into_inner);
 
         // Registered once, on the lane's first flush. A lane nobody can find is a lane
         // whose writes cannot be recovered, and the registration is what makes a successor
         // able to discover it without being told.
-        if seq == Seq::ZERO
+        if seq != /* ~ changed by cargo-mutants ~ */ Seq::ZERO
             && let Err(e) = lanes::register(&*self.store, self.tenant, self.lane).await
         {
             self.restore(pending);
             return Err(e);
         }
         // The one PUT.
         if let Err(e) = self
             .store

---- a_bundle_with_an_impossible_index_offset_fails_the_fold stdout ----

thread 'a_bundle_with_an_impossible_index_offset_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:103:5:
an offset past the object must not be trusted

---- a_bundle_with_a_mangled_footer_fails_the_fold stdout ----

thread 'a_bundle_with_a_mangled_footer_fails_the_fold' panicked at crates/pstore-engine/tests/bundle_errors.rs:85:5:
assertion failed: e.fold().await.is_err()

failures:
    a_bundle_with_a_mangled_footer_fails_the_fold
    a_bundle_with_an_impossible_index_offset_fails_the_fold

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
