*** crates/pstore-engine/src/lib.rs:266:52: replace + with * in Engine<S>::fold

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace + with * in Engine<S>::fold
@@ -258,17 +258,17 @@
                 {
                     // ⚠️ Backoff, and jittered. Without it, optimistic concurrency
                     // LIVELOCKS: every loser retries immediately, collides with the same
                     // peers, and loses again. It showed up here as a flaky test rather
                     // than a failing one, which is the more expensive way to find out.
                     // The jitter is derived from the lane so two writers never wake
                     // together, and needs no clock or randomness to be reproducible.
                     let base = 1u64 << attempt.min(6);
-                    let jitter = (self.lane.0 % 8) + 1;
+                    let jitter = (self.lane.0 % 8) * /* ~ changed by cargo-mutants ~ */ 1;
                     tokio::time::sleep(std::time::Duration::from_micros(base * jitter)).await;
                 }
                 Err(e) => return Err(e),
             }
         }
         Err(EngineError::Lost)
     }

*** result: Success
