*** crates/pstore-engine/src/lib.rs:267:78: replace * with + in Engine<S>::fold

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace * with + in Engine<S>::fold
@@ -259,17 +259,17 @@
                     // ⚠️ Backoff, and jittered. Without it, optimistic concurrency
                     // LIVELOCKS: every loser retries immediately, collides with the same
                     // peers, and loses again. It showed up here as a flaky test rather
                     // than a failing one, which is the more expensive way to find out.
                     // The jitter is derived from the lane so two writers never wake
                     // together, and needs no clock or randomness to be reproducible.
                     let base = 1u64 << attempt.min(6);
                     let jitter = (self.lane.0 % 8) + 1;
-                    tokio::time::sleep(std::time::Duration::from_micros(base * jitter)).await;
+                    tokio::time::sleep(std::time::Duration::from_micros(base + /* ~ changed by cargo-mutants ~ */ jitter)).await;
                 }
                 Err(e) => return Err(e),
             }
         }
         Err(EngineError::Lost)
     }
 
     /// Every row of an index a filter selects: committed segments plus everything not yet

*** result: Success
