*** crates/pstore-engine/src/lib.rs:288:9: replace Engine<S>::restore with ()

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace Engine<S>::restore with ()
@@ -280,24 +280,17 @@
     }
 
     /// Puts a failed flush's rows back in front of anything written since.
     ///
     /// Without this a refused flush would drop the rows it took, which is a silent loss of
     /// data the caller was never told was durable — worse than the error it reports,
     /// because the caller's retry would have no way to know what to retry.
     fn restore(&self, pending: BTreeMap<String, Vec<Document>>) {
-        let mut m = self.mem();
-        for (idx, mut docs) in pending {
-            let slot = m.pending.entry(idx).or_default();
-            // Older rows first: they were written first, and a later write to the same id
-            // must stay later.
-            docs.append(slot);
-            *slot = docs;
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Replays **every lane's** unfolded WAL bundles into segments and commits them.
     ///
     /// ⚠️ Tenant-scoped, not lane-scoped, and that is the point: folding is work done *on
     /// behalf of the tenant*, so any node may do it and a successor can fold a dead
     /// writer's lane without ever having spoken to it. The lanes come from the registry
     /// and the tails from forward probing — nothing is listed, and nothing is injected.

---- a_refused_flush_does_not_punch_a_hole_in_the_lane stdout ----

thread 'a_refused_flush_does_not_punch_a_hole_in_the_lane' panicked at crates/pstore-engine/tests/oq91.rs:200:5:
assertion `left == right` failed
  left: []
 right: ["b"]

failures:
    a_refused_flush_does_not_punch_a_hole_in_the_lane

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
