*** crates/pstore-engine/src/lib.rs:329:9: replace Engine<S>::search -> Result<Vec<(String, f32)>, EngineError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace Engine<S>::search -> Result<Vec<(String, f32)>, EngineError> with Ok(vec![])
@@ -321,32 +321,17 @@
     /// Exact k-nearest neighbours across everything the index contains.
     pub async fn search(
         &self,
         index: &str,
         query: &[f32],
         k: usize,
         filter: Option<&Filter>,
     ) -> Result<Vec<(String, f32)>, EngineError> {
-        let docs = self.scan(index, filter).await?;
-        let mut scored: Vec<(String, f32)> = docs
-            .into_iter()
-            .map(|d| {
-                let dist = d
-                    .vector
-                    .iter()
-                    .zip(query)
-                    .map(|(a, b)| (a - b) * (a - b))
-                    .sum::<f32>();
-                (d.id, dist)
-            })
-            .collect();
-        scored.sort_by(|a, b| a.1.total_cmp(&b.1).then_with(|| a.0.cmp(&b.0)));
-        scored.truncate(k);
-        Ok(scored)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Sets how far this lane has been flushed, so a successor can replay a predecessor's
     /// bundles.
     ///
     /// ⚠️ A stand-in. In production a successor discovers the tail by forward-probing the
     /// lane and reading the per-shard lane bitmap — neither of which exists until M2 — so
     /// M1 injects the watermark rather than pretending discovery is solved.

---- write_read_filter_and_search_one_index stdout ----

thread 'write_read_filter_and_search_one_index' panicked at crates/pstore-engine/tests/end_to_end.rs:80:5:
assertion `left == right` failed: filtered search disagrees with brute force
  left: []
 right: ["sku-0350", "sku-0349", "sku-0351", "sku-0348", "sku-0352"]

failures:
    write_read_filter_and_search_one_index

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
