*** crates/pstore-engine/src/lib.rs:508:9: replace Engine<S>::compact -> Result<Option<Epoch>, EngineError> with Ok(None)

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace Engine<S>::compact -> Result<Option<Epoch>, EngineError> with Ok(None)
@@ -500,99 +500,17 @@
     /// their objects are unreferenced from the moment they lose, so GC reaps them without
     /// needing to know a compaction ever happened.
     ///
     /// Returns `None` when there was nothing to do — fewer than two segments, or another
     /// compactor got there first.
     ///
     /// `RA = n Rpar + 1 W + 1 commit`, for any *n*.
     pub async fn compact(&self, index: &str) -> Result<Option<Epoch>, EngineError> {
-        let at = head::read(&*self.store, self.tenant).await?;
-        let inputs: Vec<SegmentRef> = at.head.indexes.get(index).cloned().unwrap_or_default();
-        if inputs.len() < 2 {
-            return Ok(None);
-        }
-        let keys: Vec<Key> = inputs.iter().map(|r| Key::new(r.key.clone())).collect();
-
-        // Opened and scanned together, like every other multi-segment read: n inputs are
-        // n parallel fetches, not n round trips.
-        let opened =
-            futures_util::future::try_join_all(keys.iter().map(|k| Segment::open(&*self.store, k)))
-                .await?;
-        let scanned = futures_util::future::try_join_all(
-            opened
-                .iter()
-                .zip(&keys)
-                .map(|(seg, k)| seg.scan(&*self.store, k, None)),
-        )
-        .await?;
-        // In input order, so the merged segment reads back in the order the inputs would
-        // have. A merge that reorders is a merge that changes the answer.
-        let rows: Vec<Document> = scanned.into_iter().flatten().collect();
-
-        let out_key = self.compacted_key(at.head.epoch.next(), index);
-        let mut w = SegmentWriter::new(ROWS_PER_BLOCK);
-        for d in &rows {
-            w.push(d.clone());
-        }
-        // The single W. Written BEFORE the commit and never rewritten on a retry: a
-        // rebase changes which HEAD we condition on, not what we merged.
-        self.store.put(&out_key, w.finish()).await?;
-        let out = SegmentRef {
-            key: out_key.as_str().to_owned(),
-            rows: rows.len() as u32,
-        };
-
-        let mut at = at;
-        for attempt in 0..MAX_COMMIT_ATTEMPTS {
-            let current: Vec<SegmentRef> = at.head.indexes.get(index).cloned().unwrap_or_default();
-            // ⚠️ The discard condition. If any input is no longer named by HEAD, another
-            // compactor published this merge and ours is stale — republishing it would
-            // resurrect rows that a later fold may already have superseded. Losing is the
-            // normal outcome of optimistic work, so it is not an error.
-            if !inputs
-                .iter()
-                .all(|i| current.iter().any(|c| c.key == i.key))
-            {
-                return Ok(None);
-            }
-
-            let mut next = at.head.clone();
-            next.epoch = next.epoch.next();
-            next.nonce = next.epoch.0.wrapping_mul(0x9E37_79B9_7F4A_7C15) ^ self.lane.0;
-            // Segments added since we read: kept, in place, after the merged one. Dropping
-            // them would silently discard every row folded while we were merging.
-            let mut kept: Vec<SegmentRef> = vec![out.clone()];
-            kept.extend(
-                current
-                    .iter()
-                    .filter(|c| !inputs.iter().any(|i| i.key == c.key))
-                    .cloned(),
-            );
-            next.indexes.insert(index.to_owned(), kept);
-            // Same rule for the segments this merge replaced.
-            next.graveyard
-                .entry(next.epoch.0)
-                .or_default()
-                .extend(inputs.iter().map(|i| i.key.clone()));
-
-            match head::commit(&*self.store, self.tenant, &at, &next).await {
-                Ok(epoch) => return Ok(Some(epoch)),
-                Err(e @ (EngineError::Lost | EngineError::Contended))
-                    if attempt < MAX_COMMIT_ATTEMPTS - 1 =>
-                {
-                    if matches!(e, EngineError::Lost) {
-                        at = head::read(&*self.store, self.tenant).await?;
-                    }
-                    backoff(self.lane, attempt).await;
-                }
-                Err(e) => return Err(e),
-            }
-        }
-        Err(EngineError::Lost)
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Every row of an index a filter selects: committed segments plus everything not yet
     /// folded, each appearing **exactly once**.
     pub async fn scan(
         &self,
         index: &str,
         filter: Option<&Filter>,

*** result: Timeout
