*** crates/pstore-engine/src/lib.rs:515:9: replace Engine<S>::head_for_test -> Head with Default::default()

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace Engine<S>::head_for_test -> Head with Default::default()
@@ -507,20 +507,17 @@
         mutate(&mut next);
         head::commit(&*self.store, self.tenant, &at, &next).await
     }
 
     /// The published manifest, so a test can assert on what is *referenced* rather than
     /// inferring it from what a scan happens to return.
     #[doc(hidden)]
     pub async fn head_for_test(&self) -> Head {
-        head::read(&*self.store, self.tenant)
-            .await
-            .map(|at| at.head)
-            .unwrap_or_default()
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// The key a compactor writes its merged output to.
     ///
     /// ⚠️ **Carries the compactor's lane**, so two nodes compacting the same inputs write
     /// to two different objects. Deriving the key from the inputs instead would be
     /// tempting — the losers would cost nothing — but it makes the second compactor
     /// overwrite a live object unconditionally, which is Invariant I1 gone. The

---- compaction_collapses_the_segments_it_merged stdout ----

thread 'compaction_collapses_the_segments_it_merged' panicked at crates/pstore-engine/tests/compaction.rs:91:5:
assertion `left == right` failed: six segments did not become one
  left: None
 right: Some(1)

---- a_losing_compactors_output_is_unreferenced stdout ----

thread 'a_losing_compactors_output_is_unreferenced' panicked at crates/pstore-engine/tests/compaction.rs:220:5:
assertion `left == right` failed: every compactor but the winner must leave its output unreferenced
  left: 6
 right: 5

---- concurrent_compactors_produce_one_winner stdout ----

thread 'concurrent_compactors_produce_one_winner' panicked at crates/pstore-engine/tests/compaction.rs:167:52:
no entry found for key

failures:
    a_losing_compactors_output_is_unreferenced
    compaction_collapses_the_segments_it_merged
    concurrent_compactors_produce_one_winner

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
