*** crates/pstore-engine/src/lib.rs:567:62: replace == with != in Engine<S>::compact

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace == with != in Engine<S>::compact
@@ -559,17 +559,17 @@
             next.epoch = next.epoch.next();
             next.nonce = next.epoch.0.wrapping_mul(0x9E37_79B9_7F4A_7C15) ^ self.lane.0;
             // Segments added since we read: kept, in place, after the merged one. Dropping
             // them would silently discard every row folded while we were merging.
             let mut kept: Vec<SegmentRef> = vec![out.clone()];
             kept.extend(
                 current
                     .iter()
-                    .filter(|c| !inputs.iter().any(|i| i.key == c.key))
+                    .filter(|c| !inputs.iter().any(|i| i.key != /* ~ changed by cargo-mutants ~ */ c.key))
                     .cloned(),
             );
             next.indexes.insert(index.to_owned(), kept);
             // Same rule for the segments this merge replaced.
             next.graveyard
                 .entry(next.epoch.0)
                 .or_default()
                 .extend(inputs.iter().map(|i| i.key.clone()));

---- a_fold_landing_mid_compaction_is_not_swallowed_by_it stdout ----

thread 'a_fold_landing_mid_compaction_is_not_swallowed_by_it' panicked at crates/pstore-engine/tests/compaction.rs:271:5:
the fold's rows were swallowed by the compaction: ["d0", "d1", "d2", "d3", "d4", "d5", "seeded"]

failures:
    a_fold_landing_mid_compaction_is_not_swallowed_by_it

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
