*** crates/pstore-engine/src/lib.rs:617:54: replace - with + in Engine<S>::compact

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace - with + in Engine<S>::compact
@@ -609,17 +609,17 @@
             next.graveyard
                 .entry(next.epoch.0)
                 .or_default()
                 .extend(inputs.iter().map(|i| i.key.clone()));
 
             match head::commit(&*self.store, self.tenant, &at, &next).await {
                 Ok(epoch) => return Ok(Some(epoch)),
                 Err(e @ (EngineError::Lost | EngineError::Contended))
-                    if attempt < MAX_COMMIT_ATTEMPTS - 1 =>
+                    if attempt < MAX_COMMIT_ATTEMPTS + /* ~ changed by cargo-mutants ~ */ 1 =>
                 {
                     if matches!(e, EngineError::Lost) {
                         at = head::read(&*self.store, self.tenant).await?;
                     }
                     backoff(self.lane, attempt).await;
                 }
                 Err(e) => return Err(e),
             }

*** result: Success
