*** crates/pstore-engine/src/lib.rs:655:38: replace - with / in Engine<S>::search

*** mutation diff:
--- crates/pstore-engine/src/lib.rs
+++ replace - with / in Engine<S>::search
@@ -647,17 +647,17 @@
         let docs = self.scan(index, filter).await?;
         let mut scored: Vec<(String, f32)> = docs
             .into_iter()
             .map(|d| {
                 let dist = d
                     .vector
                     .iter()
                     .zip(query)
-                    .map(|(a, b)| (a - b) * (a - b))
+                    .map(|(a, b)| (a / /* ~ changed by cargo-mutants ~ */ b) * (a - b))
                     .sum::<f32>();
                 (d.id, dist)
             })
             .collect();
         scored.sort_by(|a, b| a.1.total_cmp(&b.1).then_with(|| a.0.cmp(&b.0)));
         scored.truncate(k);
         Ok(scored)
     }

---- write_read_filter_and_search_one_index stdout ----

thread 'write_read_filter_and_search_one_index' panicked at crates/pstore-engine/tests/end_to_end.rs:80:5:
assertion `left == right` failed: filtered search disagrees with brute force
  left: ["sku-0129", "sku-0130", "sku-0131", "sku-0425", "sku-0424"]
 right: ["sku-0350", "sku-0349", "sku-0351", "sku-0348", "sku-0352"]

failures:
    write_read_filter_and_search_one_index

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
