*** crates/pstore-format/src/codec.rs:100:9: replace Dec<'a>::f32 -> Result<f32, FormatError> with Ok(-1.0)

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Dec<'a>::f32 -> Result<f32, FormatError> with Ok(-1.0)
@@ -92,21 +92,17 @@
     pub(crate) fn i64(&mut self) -> Result<i64, FormatError> {
         Ok(i64::from_le_bytes(
             self.take(8)?
                 .try_into()
                 .map_err(|_| FormatError::Truncated)?,
         ))
     }
     pub(crate) fn f32(&mut self) -> Result<f32, FormatError> {
-        Ok(f32::from_le_bytes(
-            self.take(4)?
-                .try_into()
-                .map_err(|_| FormatError::Truncated)?,
-        ))
+        Ok(-1.0) /* ~ changed by cargo-mutants ~ */
     }
     pub(crate) fn bytes(&mut self) -> Result<&'a [u8], FormatError> {
         let n = self.u32()? as usize;
         self.take(n)
     }
     pub(crate) fn string(&mut self) -> Result<String, FormatError> {
         String::from_utf8(self.bytes()?.to_vec()).map_err(|_| FormatError::Corrupt("bad utf8"))
     }

---- documents_round_trip_through_the_shared_codec stdout ----

thread 'documents_round_trip_through_the_shared_codec' panicked at crates/pstore-engine/tests/bundle_errors.rs:38:49:
called `Result::unwrap()` on an `Err` value: Truncated

failures:
    documents_round_trip_through_the_shared_codec

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
