*** crates/pstore-format/src/codec.rs:107:9: replace Dec<'a>::bytes -> Result<&'a[u8], FormatError> with Ok(Vec::leak(vec![0]))

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Dec<'a>::bytes -> Result<&'a[u8], FormatError> with Ok(Vec::leak(vec![0]))
@@ -99,18 +99,17 @@
     pub(crate) fn f32(&mut self) -> Result<f32, FormatError> {
         Ok(f32::from_le_bytes(
             self.take(4)?
                 .try_into()
                 .map_err(|_| FormatError::Truncated)?,
         ))
     }
     pub(crate) fn bytes(&mut self) -> Result<&'a [u8], FormatError> {
-        let n = self.u32()? as usize;
-        self.take(n)
+        Ok(Vec::leak(vec![0])) /* ~ changed by cargo-mutants ~ */
     }
     pub(crate) fn string(&mut self) -> Result<String, FormatError> {
         String::from_utf8(self.bytes()?.to_vec()).map_err(|_| FormatError::Corrupt("bad utf8"))
     }
     pub(crate) fn raw(&mut self, n: usize) -> Result<&'a [u8], FormatError> {
         self.take(n)
     }
 }

---- documents_round_trip_through_the_shared_codec stdout ----

thread 'documents_round_trip_through_the_shared_codec' panicked at crates/pstore-engine/tests/bundle_errors.rs:38:49:
called `Result::unwrap()` on an `Err` value: Corrupt("unknown value tag")

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:133:20:
called `Result::unwrap()` on an `Err` value: Format("segment corrupt: unknown value tag")

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped
    documents_round_trip_through_the_shared_codec

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
