*** crates/pstore-format/src/codec.rs:111:9: replace Dec<'a>::string -> Result<String, FormatError> with Ok(String::new())

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Dec<'a>::string -> Result<String, FormatError> with Ok(String::new())
@@ -103,17 +103,17 @@
                 .map_err(|_| FormatError::Truncated)?,
         ))
     }
     pub(crate) fn bytes(&mut self) -> Result<&'a [u8], FormatError> {
         let n = self.u32()? as usize;
         self.take(n)
     }
     pub(crate) fn string(&mut self) -> Result<String, FormatError> {
-        String::from_utf8(self.bytes()?.to_vec()).map_err(|_| FormatError::Corrupt("bad utf8"))
+        Ok(String::new()) /* ~ changed by cargo-mutants ~ */
     }
     pub(crate) fn raw(&mut self, n: usize) -> Result<&'a [u8], FormatError> {
         self.take(n)
     }
 }
 
 /// FNV-1a over the index section, so tampering is caught before it is served as data.
 ///

---- codec::tests::a_string_field_rejects_invalid_utf8 stdout ----

thread 'codec::tests::a_string_field_rejects_invalid_utf8' panicked at crates/pstore-format/src/codec.rs:183:37:
called `Result::unwrap_err()` on an `Ok` value: ""

failures:
    codec::tests::a_string_field_rejects_invalid_utf8

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
