*** crates/pstore-format/src/codec.rs:114:9: replace Dec<'a>::raw -> Result<&'a[u8], FormatError> with Ok(Vec::leak(vec![0]))

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Dec<'a>::raw -> Result<&'a[u8], FormatError> with Ok(Vec::leak(vec![0]))
@@ -106,17 +106,17 @@
     pub(crate) fn bytes(&mut self) -> Result<&'a [u8], FormatError> {
         let n = self.u32()? as usize;
         self.take(n)
     }
     pub(crate) fn string(&mut self) -> Result<String, FormatError> {
         String::from_utf8(self.bytes()?.to_vec()).map_err(|_| FormatError::Corrupt("bad utf8"))
     }
     pub(crate) fn raw(&mut self, n: usize) -> Result<&'a [u8], FormatError> {
-        self.take(n)
+        Ok(Vec::leak(vec![0])) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// FNV-1a over the index section, so tampering is caught before it is served as data.
 ///
 /// Not cryptographic and not meant to be: it detects corruption, not an adversary.
 pub(crate) fn checksum(bytes: &[u8]) -> u64 {
     let mut h: u64 = 0xcbf2_9ce4_8422_2325;

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:134:41:
called `Result::unwrap()` on an `Err` value: Format("segment corrupt: bad magic")

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
