*** crates/pstore-format/src/codec.rs:114:9: replace Dec<'a>::raw -> Result<&'a[u8], FormatError> with Ok(Vec::leak(vec![1]))

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Dec<'a>::raw -> Result<&'a[u8], FormatError> with Ok(Vec::leak(vec![1]))
@@ -106,17 +106,17 @@
     pub(crate) fn bytes(&mut self) -> Result<&'a [u8], FormatError> {
         let n = self.u32()? as usize;
         self.take(n)
     }
     pub(crate) fn string(&mut self) -> Result<String, FormatError> {
         String::from_utf8(self.bytes()?.to_vec()).map_err(|_| FormatError::Corrupt("bad utf8"))
     }
     pub(crate) fn raw(&mut self, n: usize) -> Result<&'a [u8], FormatError> {
-        self.take(n)
+        Ok(Vec::leak(vec![1])) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// FNV-1a over the index section, so tampering is caught before it is served as data.
 ///
 /// Not cryptographic and not meant to be: it detects corruption, not an adversary.
 pub(crate) fn checksum(bytes: &[u8]) -> u64 {
     let mut h: u64 = 0xcbf2_9ce4_8422_2325;

---- codec::tests::every_primitive_round_trips stdout ----

thread 'codec::tests::every_primitive_round_trips' panicked at crates/pstore-format/src/codec.rs:157:9:
assertion `left == right` failed
  left: [1]
 right: [116, 97, 105, 108]

---- codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking stdout ----

thread 'codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking' panicked at crates/pstore-format/src/codec.rs:175:9:
assertion failed: Dec::new(&[1, 2]).raw(5).is_err()

failures:
    codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking
    codec::tests::every_primitive_round_trips

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
