*** crates/pstore-format/src/codec.rs:16:9: replace Enc::u8 with ()

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Enc::u8 with ()
@@ -8,17 +8,17 @@
 use crate::FormatError;
 
 /// Appends primitives in little-endian, the order the decoder reads them.
 #[derive(Debug, Default)]
 pub(crate) struct Enc(pub Vec<u8>);
 
 impl Enc {
     pub(crate) fn u8(&mut self, v: u8) {
-        self.0.push(v);
+        () /* ~ changed by cargo-mutants ~ */
     }
     pub(crate) fn u16(&mut self, v: u16) {
         self.0.extend_from_slice(&v.to_le_bytes());
     }
     pub(crate) fn u32(&mut self, v: u32) {
         self.0.extend_from_slice(&v.to_le_bytes());
     }
     pub(crate) fn u64(&mut self, v: u64) {

---- codec::tests::every_primitive_round_trips stdout ----

thread 'codec::tests::every_primitive_round_trips' panicked at crates/pstore-format/src/codec.rs:150:9:
assertion `left == right` failed
  left: 232
 right: 7

failures:
    codec::tests::every_primitive_round_trips

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
