*** crates/pstore-format/src/codec.rs:19:9: replace Enc::u16 with ()

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Enc::u16 with ()
@@ -11,17 +11,17 @@
 #[derive(Debug, Default)]
 pub(crate) struct Enc(pub Vec<u8>);
 
 impl Enc {
     pub(crate) fn u8(&mut self, v: u8) {
         self.0.push(v);
     }
     pub(crate) fn u16(&mut self, v: u16) {
-        self.0.extend_from_slice(&v.to_le_bytes());
+        () /* ~ changed by cargo-mutants ~ */
     }
     pub(crate) fn u32(&mut self, v: u32) {
         self.0.extend_from_slice(&v.to_le_bytes());
     }
     pub(crate) fn u64(&mut self, v: u64) {
         self.0.extend_from_slice(&v.to_le_bytes());
     }
     pub(crate) fn i64(&mut self, v: i64) {

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-format/src/writer.rs:123:9:
assertion `left == right` failed
  left: 40
 right: 42

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
