*** crates/pstore-format/src/codec.rs:22:9: replace Enc::u32 with ()

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Enc::u32 with ()
@@ -14,17 +14,17 @@
 impl Enc {
     pub(crate) fn u8(&mut self, v: u8) {
         self.0.push(v);
     }
     pub(crate) fn u16(&mut self, v: u16) {
         self.0.extend_from_slice(&v.to_le_bytes());
     }
     pub(crate) fn u32(&mut self, v: u32) {
-        self.0.extend_from_slice(&v.to_le_bytes());
+        () /* ~ changed by cargo-mutants ~ */
     }
     pub(crate) fn u64(&mut self, v: u64) {
         self.0.extend_from_slice(&v.to_le_bytes());
     }
     pub(crate) fn i64(&mut self, v: i64) {
         self.0.extend_from_slice(&v.to_le_bytes());
     }
     pub(crate) fn f32(&mut self, v: f32) {

---- codec::tests::a_string_field_rejects_invalid_utf8 stdout ----

thread 'codec::tests::a_string_field_rejects_invalid_utf8' panicked at crates/pstore-format/src/codec.rs:182:9:
assertion failed: matches!(Dec::new(&e.0).string().unwrap_err(), FormatError::Corrupt(_))

---- codec::tests::every_primitive_round_trips stdout ----

thread 'codec::tests::every_primitive_round_trips' panicked at crates/pstore-format/src/codec.rs:152:9:
assertion `left == right` failed
  left: 1410065408
 right: 100000

failures:
    codec::tests::a_string_field_rejects_invalid_utf8
    codec::tests::every_primitive_round_trips

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
