*** crates/pstore-format/src/codec.rs:35:9: replace Enc::bytes with ()

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Enc::bytes with ()
@@ -27,18 +27,17 @@
     pub(crate) fn i64(&mut self, v: i64) {
         self.0.extend_from_slice(&v.to_le_bytes());
     }
     pub(crate) fn f32(&mut self, v: f32) {
         self.0.extend_from_slice(&v.to_le_bytes());
     }
     pub(crate) fn bytes(&mut self, v: &[u8]) {
         // Length-prefixed, so a decoder never has to guess where a field ends.
-        self.u32(v.len() as u32);
-        self.0.extend_from_slice(v);
+        () /* ~ changed by cargo-mutants ~ */
     }
     pub(crate) fn raw(&mut self, v: &[u8]) {
         self.0.extend_from_slice(v);
     }
     pub(crate) fn len(&self) -> usize {
         self.0.len()
     }
 }

---- codec::tests::a_string_field_rejects_invalid_utf8 stdout ----

thread 'codec::tests::a_string_field_rejects_invalid_utf8' panicked at crates/pstore-format/src/codec.rs:181:9:
assertion failed: matches!(Dec::new(&e.0).string().unwrap_err(), FormatError::Corrupt(_))

---- codec::tests::every_primitive_round_trips stdout ----

thread 'codec::tests::every_primitive_round_trips' panicked at crates/pstore-format/src/codec.rs:155:30:
called `Result::unwrap()` on an `Err` value: Truncated

failures:
    codec::tests::a_string_field_rejects_invalid_utf8
    codec::tests::every_primitive_round_trips

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
