*** crates/pstore-format/src/codec.rs:42:9: replace Enc::len -> usize with 1

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Enc::len -> usize with 1
@@ -34,17 +34,17 @@
         // Length-prefixed, so a decoder never has to guess where a field ends.
         self.u32(v.len() as u32);
         self.0.extend_from_slice(v);
     }
     pub(crate) fn raw(&mut self, v: &[u8]) {
         self.0.extend_from_slice(v);
     }
     pub(crate) fn len(&self) -> usize {
-        self.0.len()
+        1 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Reads primitives, refusing rather than panicking when the input runs out.
 ///
 /// Every method returns `Result`: a truncated or tampered segment must be an error, not a
 /// wrong answer served as data.
 #[derive(Debug)]

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-format/src/writer.rs:261:13:
attempt to subtract with overflow

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
