*** crates/pstore-format/src/codec.rs:62:9: replace Dec<'a>::take -> Result<&'a[u8], FormatError> with Ok(Vec::leak(Vec::new()))

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Dec<'a>::take -> Result<&'a[u8], FormatError> with Ok(Vec::leak(Vec::new()))
@@ -54,20 +54,17 @@
 }
 
 impl<'a> Dec<'a> {
     pub(crate) fn new(buf: &'a [u8]) -> Self {
         Self { buf, pos: 0 }
     }
 
     fn take(&mut self, n: usize) -> Result<&'a [u8], FormatError> {
-        let end = self.pos.checked_add(n).ok_or(FormatError::Truncated)?;
-        let out = self.buf.get(self.pos..end).ok_or(FormatError::Truncated)?;
-        self.pos = end;
-        Ok(out)
+        Ok(Vec::leak(Vec::new())) /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn u8(&mut self) -> Result<u8, FormatError> {
         self.take(1)?.first().copied().ok_or(FormatError::Truncated)
     }
     pub(crate) fn u16(&mut self) -> Result<u16, FormatError> {
         Ok(u16::from_le_bytes(
             self.take(2)?

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:133:20:
called `Result::unwrap()` on an `Err` value: Format("segment truncated")

---- documents_round_trip_through_the_shared_codec stdout ----

thread 'documents_round_trip_through_the_shared_codec' panicked at crates/pstore-engine/tests/bundle_errors.rs:38:49:
called `Result::unwrap()` on an `Err` value: Truncated

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped
    documents_round_trip_through_the_shared_codec

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
