*** crates/pstore-format/src/codec.rs:62:9: replace Dec<'a>::take -> Result<&'a[u8], FormatError> with Ok(Vec::leak(vec![0]))

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Dec<'a>::take -> Result<&'a[u8], FormatError> with Ok(Vec::leak(vec![0]))
@@ -54,20 +54,17 @@
 }
 
 impl<'a> Dec<'a> {
     pub(crate) fn new(buf: &'a [u8]) -> Self {
         Self { buf, pos: 0 }
     }
 
     fn take(&mut self, n: usize) -> Result<&'a [u8], FormatError> {
-        let end = self.pos.checked_add(n).ok_or(FormatError::Truncated)?;
-        let out = self.buf.get(self.pos..end).ok_or(FormatError::Truncated)?;
-        self.pos = end;
-        Ok(out)
+        Ok(Vec::leak(vec![0])) /* ~ changed by cargo-mutants ~ */
     }
 
     pub(crate) fn u8(&mut self) -> Result<u8, FormatError> {
         self.take(1)?.first().copied().ok_or(FormatError::Truncated)
     }
     pub(crate) fn u16(&mut self) -> Result<u16, FormatError> {
         Ok(u16::from_le_bytes(
             self.take(2)?

---- codec::tests::a_string_field_rejects_invalid_utf8 stdout ----

thread 'codec::tests::a_string_field_rejects_invalid_utf8' panicked at crates/pstore-format/src/codec.rs:179:9:
assertion failed: matches!(Dec::new(&e.0).string().unwrap_err(), FormatError::Corrupt(_))

---- codec::tests::every_primitive_round_trips stdout ----

thread 'codec::tests::every_primitive_round_trips' panicked at crates/pstore-format/src/codec.rs:147:9:
assertion `left == right` failed
  left: 0
 right: 7

---- codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking stdout ----

thread 'codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking' panicked at crates/pstore-format/src/codec.rs:161:9:
assertion failed: Dec::new(&[]).u8().is_err()

failures:
    codec::tests::a_string_field_rejects_invalid_utf8
    codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking
    codec::tests::every_primitive_round_trips

test result: FAILED. 1 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
