*** crates/pstore-format/src/codec.rs:79:9: replace Dec<'a>::u32 -> Result<u32, FormatError> with Ok(1)

*** mutation diff:
--- crates/pstore-format/src/codec.rs
+++ replace Dec<'a>::u32 -> Result<u32, FormatError> with Ok(1)
@@ -71,21 +71,17 @@
     pub(crate) fn u16(&mut self) -> Result<u16, FormatError> {
         Ok(u16::from_le_bytes(
             self.take(2)?
                 .try_into()
                 .map_err(|_| FormatError::Truncated)?,
         ))
     }
     pub(crate) fn u32(&mut self) -> Result<u32, FormatError> {
-        Ok(u32::from_le_bytes(
-            self.take(4)?
-                .try_into()
-                .map_err(|_| FormatError::Truncated)?,
-        ))
+        Ok(1) /* ~ changed by cargo-mutants ~ */
     }
     pub(crate) fn u64(&mut self) -> Result<u64, FormatError> {
         Ok(u64::from_le_bytes(
             self.take(8)?
                 .try_into()
                 .map_err(|_| FormatError::Truncated)?,
         ))
     }

---- codec::tests::a_string_field_rejects_invalid_utf8 stdout ----

thread 'codec::tests::a_string_field_rejects_invalid_utf8' panicked at crates/pstore-format/src/codec.rs:179:37:
called `Result::unwrap_err()` on an `Ok` value: "\u{2}"

---- codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking stdout ----

thread 'codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking' panicked at crates/pstore-format/src/codec.rs:162:9:
assertion failed: Dec::new(&[1, 2, 3]).u32().is_err()

---- codec::tests::every_primitive_round_trips stdout ----

thread 'codec::tests::every_primitive_round_trips' panicked at crates/pstore-format/src/codec.rs:148:9:
assertion `left == right` failed
  left: 1
 right: 100000

failures:
    codec::tests::a_string_field_rejects_invalid_utf8
    codec::tests::every_primitive_refuses_a_short_buffer_rather_than_panicking
    codec::tests::every_primitive_round_trips

test result: FAILED. 1 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
