*** crates/pstore-format/src/docs.rs:108:5: replace decode_rows -> Result<Vec<Document>, FormatError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-format/src/docs.rs
+++ replace decode_rows -> Result<Vec<Document>, FormatError> with Ok(vec![])
@@ -100,22 +100,10 @@
         encode_attrs(&mut e, &d.attrs);
     }
     e.0
 }
 
 /// Decodes segment-block rows. Vectors come back empty and are filled from the
 /// [`crate::Section::Vectors`] section by the caller that wants them.
 pub fn decode_rows(buf: &[u8]) -> Result<Vec<Document>, FormatError> {
-    let mut d = Dec::new(buf);
-    let n = d.u32()? as usize;
-    let mut out = Vec::with_capacity(n.min(1 << 20));
-    for _ in 0..n {
-        let id = d.string()?;
-        let attrs = decode_attrs(&mut d)?;
-        out.push(Document {
-            id,
-            vector: Vec::new(),
-            attrs,
-        });
-    }
-    Ok(out)
+    Ok(vec![]) /* ~ changed by cargo-mutants ~ */
 }

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:135:5:
rows before the hole must still be folded

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
