*** crates/pstore-format/src/docs.rs:22:5: replace encode_attrs with ()

*** mutation diff:
--- crates/pstore-format/src/docs.rs
+++ replace encode_attrs with ()
@@ -14,30 +14,17 @@
 use std::collections::BTreeMap;
 
 /// Encodes one document's attributes.
 ///
 /// ⚠️ Factored out because the two record shapes below diverged in M3 and the value tags
 /// are the part that must not drift. They were briefly one function; that was correct while
 /// the shapes were identical and stopped being correct the moment vectors left the blocks.
 fn encode_attrs(e: &mut Enc, attrs: &BTreeMap<String, Value>) {
-    e.u32(attrs.len() as u32);
-    for (k, v) in attrs {
-        e.bytes(k.as_bytes());
-        match v {
-            Value::Int(n) => {
-                e.u8(0);
-                e.i64(*n);
-            }
-            Value::Str(s) => {
-                e.u8(1);
-                e.bytes(s.as_bytes());
-            }
-        }
-    }
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 fn decode_attrs(d: &mut Dec<'_>) -> Result<BTreeMap<String, Value>, FormatError> {
     let n = d.u32()? as usize;
     let mut attrs = BTreeMap::new();
     for _ in 0..n {
         let k = d.string()?;
         let v = match d.u8()? {

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:133:20:
called `Result::unwrap()` on an `Err` value: Format("segment truncated")

---- documents_round_trip_through_the_shared_codec stdout ----

thread 'documents_round_trip_through_the_shared_codec' panicked at crates/pstore-engine/tests/bundle_errors.rs:38:49:
called `Result::unwrap()` on an `Err` value: Truncated

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped
    documents_round_trip_through_the_shared_codec

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
