*** crates/pstore-format/src/docs.rs:39:5: replace decode_attrs -> Result<BTreeMap<String, Value>, FormatError> with Ok(BTreeMap::new())

*** mutation diff:
--- crates/pstore-format/src/docs.rs
+++ replace decode_attrs -> Result<BTreeMap<String, Value>, FormatError> with Ok(BTreeMap::new())
@@ -31,30 +31,17 @@
                 e.u8(1);
                 e.bytes(s.as_bytes());
             }
         }
     }
 }
 
 fn decode_attrs(d: &mut Dec<'_>) -> Result<BTreeMap<String, Value>, FormatError> {
-    let n = d.u32()? as usize;
-    let mut attrs = BTreeMap::new();
-    for _ in 0..n {
-        let k = d.string()?;
-        let v = match d.u8()? {
-            0 => Value::Int(d.i64()?),
-            1 => Value::Str(d.string()?),
-            // A tag from a future version. Refused, not guessed: a mistyped attribute is
-            // one a filter later reads as the wrong thing.
-            _ => return Err(FormatError::Corrupt("unknown value tag")),
-        };
-        attrs.insert(k, v);
-    }
-    Ok(attrs)
+    Ok(BTreeMap::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Encodes documents **with their vectors**, for the WAL bundle.
 ///
 /// ⚠️ Unlike a segment block, a bundle is the durable record of a write before anything has
 /// been folded, so it must carry everything needed to reconstruct the document — vectors
 /// included. A segment block does not, because segments keep vectors in their own section.
 #[must_use]

---- documents_round_trip_through_the_shared_codec stdout ----

thread 'documents_round_trip_through_the_shared_codec' panicked at crates/pstore-engine/tests/bundle_errors.rs:38:49:
called `Result::unwrap()` on an `Err` value: Truncated

failures:
    documents_round_trip_through_the_shared_codec

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
