*** crates/pstore-format/src/docs.rs:57:17: delete match arm 1 in decode_docs

*** mutation diff:
--- crates/pstore-format/src/docs.rs
+++ delete match arm 1 in decode_docs
@@ -49,17 +49,17 @@
             vector.push(d.f32()?);
         }
         let an = d.u32()? as usize;
         let mut attrs = BTreeMap::new();
         for _ in 0..an {
             let k = d.string()?;
             let v = match d.u8()? {
                 0 => Value::Int(d.i64()?),
-                1 => Value::Str(d.string()?),
+                 /* ~ changed by cargo-mutants ~ */
                 _ => return Err(FormatError::Corrupt("unknown value tag")),
             };
             attrs.insert(k, v);
         }
         out.push(Document { id, vector, attrs });
     }
     Ok(out)
 }

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:133:20:
called `Result::unwrap()` on an `Err` value: Format("segment corrupt: unknown value tag")

---- documents_round_trip_through_the_shared_codec stdout ----

thread 'documents_round_trip_through_the_shared_codec' panicked at crates/pstore-engine/tests/bundle_errors.rs:38:49:
called `Result::unwrap()` on an `Err` value: Corrupt("unknown value tag")

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped
    documents_round_trip_through_the_shared_codec

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
