*** crates/pstore-format/src/lib.rs:101:48: replace == with != in Filter::matches

*** mutation diff:
--- crates/pstore-format/src/lib.rs
+++ replace == with != in Filter::matches
@@ -93,17 +93,17 @@
             Self::Eq(c, _) | Self::Gt(c, _) | Self::Lt(c, _) => c,
         }
     }
 
     /// Whether one row satisfies it.
     #[must_use]
     pub fn matches(&self, doc: &Document) -> bool {
         match self {
-            Self::Eq(c, v) => doc.attrs.get(c) == Some(v),
+            Self::Eq(c, v) => doc.attrs.get(c) != /* ~ changed by cargo-mutants ~ */ Some(v),
             Self::Gt(c, n) => matches!(doc.attrs.get(c), Some(Value::Int(v)) if v > n),
             Self::Lt(c, n) => matches!(doc.attrs.get(c), Some(Value::Int(v)) if v < n),
         }
     }
 
     /// Whether a block whose integer column spans `min..=max` **could** contain a match.
     ///
     /// ⚠️ Must never answer `false` for a block that could match: a wrong `false` silently

---- filters_match_rows_by_type stdout ----

thread 'filters_match_rows_by_type' panicked at crates/pstore-format/tests/corrupt.rs:142:5:
assertion failed: Filter::Eq("n".to_owned(), Value::Int(5)).matches(&d)

failures:
    filters_match_rows_by_type

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
