*** crates/pstore-format/src/lib.rs:114:9: replace Filter::could_match -> bool with true

*** mutation diff:
--- crates/pstore-format/src/lib.rs
+++ replace Filter::could_match -> bool with true
@@ -106,23 +106,17 @@
 
     /// Whether a block whose integer column spans `min..=max` **could** contain a match.
     ///
     /// ⚠️ Must never answer `false` for a block that could match: a wrong `false` silently
     /// drops rows, which reads as a recall bug rather than an error. Answering `true` for a
     /// block that cannot match is merely wasted work.
     #[must_use]
     pub fn could_match(&self, min: i64, max: i64) -> bool {
-        match self {
-            Self::Eq(_, Value::Int(n)) => *n >= min && *n <= max,
-            // A string equality has no ordering to prune on, so every block could match.
-            Self::Eq(_, Value::Str(_)) => true,
-            Self::Gt(_, n) => max > *n,
-            Self::Lt(_, n) => min < *n,
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Why a segment could not be read.
 #[derive(Debug, Clone, PartialEq, Eq, thiserror::Error)]
 pub enum FormatError {
     /// The bytes ran out mid-field.
     #[error("segment truncated")]

---- filters_prune_only_what_they_provably_can stdout ----

thread 'filters_prune_only_what_they_provably_can' panicked at crates/pstore-format/tests/corrupt.rs:107:5:
assertion failed: !eq.could_match(6, 10)

failures:
    filters_prune_only_what_they_provably_can

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
