*** crates/pstore-format/src/lib.rs:114:9: replace Filter::could_match -> bool with false

*** mutation diff:
--- crates/pstore-format/src/lib.rs
+++ replace Filter::could_match -> bool with false
@@ -106,23 +106,17 @@
 
     /// Whether a block whose integer column spans `min..=max` **could** contain a match.
     ///
     /// ⚠️ Must never answer `false` for a block that could match: a wrong `false` silently
     /// drops rows, which reads as a recall bug rather than an error. Answering `true` for a
     /// block that cannot match is merely wasted work.
     #[must_use]
     pub fn could_match(&self, min: i64, max: i64) -> bool {
-        match self {
-            Self::Eq(_, Value::Int(n)) => *n >= min && *n <= max,
-            // A string equality has no ordering to prune on, so every block could match.
-            Self::Eq(_, Value::Str(_)) => true,
-            Self::Gt(_, n) => max > *n,
-            Self::Lt(_, n) => min < *n,
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Why a segment could not be read.
 #[derive(Debug, Clone, PartialEq, Eq, thiserror::Error)]
 pub enum FormatError {
     /// The bytes ran out mid-field.
     #[error("segment truncated")]

---- write_read_filter_and_search_one_index stdout ----

thread 'write_read_filter_and_search_one_index' panicked at crates/pstore-engine/tests/end_to_end.rs:57:5:
assertion `left == right` failed
  left: 57
 right: 170

failures:
    write_read_filter_and_search_one_index

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
