*** crates/pstore-format/src/lib.rs:37:52: replace + with *

*** mutation diff:
--- crates/pstore-format/src/lib.rs
+++ replace + with *
@@ -29,17 +29,17 @@
 /// Bytes fetched by the opening suffix read.
 ///
 /// Larger than the footer on purpose: most indexes are small, and their entire index
 /// section arrives with the footer, saving the second round trip. Too large and every open
 /// over-reads; 8 KiB is roughly the index section of a few-hundred-row segment.
 pub const SUFFIX_FETCH: u64 = 8 * 1024;
 
 /// Bytes of fixed-size footer at the very end of a segment.
-pub(crate) const FOOTER_LEN: usize = 8 + 2 + 8 + 4 + 4 + 8 + 8;
+pub(crate) const FOOTER_LEN: usize = 8 + 2 + 8 + 4 * /* ~ changed by cargo-mutants ~ */ 4 + 8 + 8;
 
 pub(crate) const MAGIC: &[u8; 8] = b"PSTORESG";
 pub(crate) const VERSION: u16 = 1;
 
 /// An attribute value.
 #[derive(Debug, Clone, PartialEq, Eq, PartialOrd, Ord)]
 pub enum Value {
     /// Signed integer. The type zone maps prune on.

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-format/src/writer.rs:123:9:
assertion `left == right` failed
  left: 42
 right: 50

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
