*** crates/pstore-format/src/lib.rs:37:60: replace + with *

*** mutation diff:
--- crates/pstore-format/src/lib.rs
+++ replace + with *
@@ -29,17 +29,17 @@
 /// Bytes fetched by the opening suffix read.
 ///
 /// Larger than the footer on purpose: most indexes are small, and their entire index
 /// section arrives with the footer, saving the second round trip. Too large and every open
 /// over-reads; 8 KiB is roughly the index section of a few-hundred-row segment.
 pub const SUFFIX_FETCH: u64 = 8 * 1024;
 
 /// Bytes of fixed-size footer at the very end of a segment.
-pub(crate) const FOOTER_LEN: usize = 8 + 2 + 8 + 4 + 4 + 8 + 8;
+pub(crate) const FOOTER_LEN: usize = 8 + 2 + 8 + 4 + 4 + 8 * /* ~ changed by cargo-mutants ~ */ 8;
 
 pub(crate) const MAGIC: &[u8; 8] = b"PSTORESG";
 pub(crate) const VERSION: u16 = 1;
 
 /// An attribute value.
 #[derive(Debug, Clone, PartialEq, Eq, PartialOrd, Ord)]
 pub enum Value {
     /// Signed integer. The type zone maps prune on.

---- a_future_version_is_refused_rather_than_guessed_at stdout ----

thread 'a_future_version_is_refused_rather_than_guessed_at' panicked at crates/pstore-format/src/writer.rs:123:9:
assertion `left == right` failed
  left: 42
 right: 90

---- a_truncated_segment_is_an_error stdout ----

thread 'a_truncated_segment_is_an_error' panicked at crates/pstore-format/src/writer.rs:123:9:
assertion `left == right` failed
  left: 42
 right: 90

---- a_tampered_index_section_is_caught_by_the_checksum stdout ----

thread 'a_tampered_index_section_is_caught_by_the_checksum' panicked at crates/pstore-format/src/writer.rs:123:9:
assertion `left == right` failed
  left: 42
 right: 90

failures:
    a_future_version_is_refused_rather_than_guessed_at
    a_scan_of_a_segment_whose_blocks_are_gone_is_an_error
    a_segment_with_an_impossible_block_count_is_refused
    a_tampered_index_section_is_caught_by_the_checksum
    a_truncated_segment_is_an_error
    an_unknown_value_tag_is_an_error

test result: FAILED. 4 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
