*** crates/pstore-format/src/lib.rs:65:5: replace index_section_len -> Option<usize> with Some(0)

*** mutation diff:
--- crates/pstore-format/src/lib.rs
+++ replace index_section_len -> Option<usize> with Some(0)
@@ -57,21 +57,17 @@
 
 /// The index section's length, read from a segment's footer.
 ///
 /// Exposed so the "the index fits the suffix read" invariant can be asserted **directly**
 /// rather than inferred from a round-trip count. Depth is the consequence; the fit is the
 /// cause, and it is what a future change to block sizing breaks first.
 #[must_use]
 pub fn index_section_len(segment: &[u8]) -> Option<usize> {
-    let foot = segment.len().checked_sub(FOOTER_LEN)?;
-    let f = segment.get(foot..)?;
-    // MAGIC(8) VERSION(2) index_offset(8) index_len(4)
-    let lo = f.get(18..22)?;
-    Some(u32::from_le_bytes(lo.try_into().ok()?) as usize)
+    Some(0) /* ~ changed by cargo-mutants ~ */
 }
 
 use std::collections::BTreeMap;
 
 /// Bytes fetched by the opening suffix read.
 ///
 /// Larger than the footer on purpose: most indexes are small, and their entire index
 /// section arrives with the footer, saving the second round trip. Too large and every open

*** result: Success
