*** crates/pstore-format/src/reader.rs:118:9: replace Segment::blocks_to_read -> Vec<usize> with vec![]

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace Segment::blocks_to_read -> Vec<usize> with vec![]
@@ -110,30 +110,17 @@
     }
 
     /// Which blocks a filter cannot rule out.
     ///
     /// A block is kept unless its zone map proves no row in it can match. **Erring toward
     /// keeping is mandatory**: a wrongly dropped block silently loses rows.
     #[must_use]
     pub fn blocks_to_read(&self, filter: Option<&Filter>) -> Vec<usize> {
-        self.blocks
-            .iter()
-            .enumerate()
-            .filter(|(_, b)| match filter {
-                None => true,
-                Some(f) => match b.zones.get(f.column()) {
-                    Some((lo, hi)) => f.could_match(*lo, *hi),
-                    // No zone map for that column -- it may be a string, or absent from
-                    // this block. Cannot prune, so must read.
-                    None => true,
-                },
-            })
-            .map(|(i, _)| i)
-            .collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Reads the rows a filter selects.
     ///
     /// The blocks that survive pruning are fetched in **one coalesced round**, so scanning
     /// costs one round trip regardless of how many blocks match.
     pub async fn scan<S: BlobStore>(
         &self,

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:135:5:
rows before the hole must still be folded

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
