*** crates/pstore-format/src/reader.rs:118:9: replace Segment::blocks_to_read -> Vec<usize> with vec![0]

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace Segment::blocks_to_read -> Vec<usize> with vec![0]
@@ -110,30 +110,17 @@
     }
 
     /// Which blocks a filter cannot rule out.
     ///
     /// A block is kept unless its zone map proves no row in it can match. **Erring toward
     /// keeping is mandatory**: a wrongly dropped block silently loses rows.
     #[must_use]
     pub fn blocks_to_read(&self, filter: Option<&Filter>) -> Vec<usize> {
-        self.blocks
-            .iter()
-            .enumerate()
-            .filter(|(_, b)| match filter {
-                None => true,
-                Some(f) => match b.zones.get(f.column()) {
-                    Some((lo, hi)) => f.could_match(*lo, *hi),
-                    // No zone map for that column -- it may be a string, or absent from
-                    // this block. Cannot prune, so must read.
-                    None => true,
-                },
-            })
-            .map(|(i, _)| i)
-            .collect()
+        vec![0] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Reads the rows a filter selects.
     ///
     /// The blocks that survive pruning are fetched in **one coalesced round**, so scanning
     /// costs one round trip regardless of how many blocks match.
     pub async fn scan<S: BlobStore>(
         &self,

---- a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing stdout ----

thread 'a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing' panicked at crates/pstore-format/tests/search.rs:110:5:
assertion `left == right` failed
  left: 1
 right: 5

---- a_string_filter_cannot_prune_but_still_filters stdout ----

thread 'a_string_filter_cannot_prune_but_still_filters' panicked at crates/pstore-format/tests/search.rs:88:5:
assertion `left == right` failed: strings cannot prune
  left: 1
 right: 10

---- exact_search_matches_a_brute_force_reference stdout ----

thread 'exact_search_matches_a_brute_force_reference' panicked at crates/pstore-format/tests/search.rs:154:9:
assertion `left == right` failed: top-10 disagrees with brute force for [0.1, 0.2, 0.3, 0.4]
  left: ["d0", "d15", "d14", "d1", "d12", "d5", "d3", "d4", "d8", "d6"]
 right: ["d452", "d234", "d442", "d165", "d59", "d334", "d362", "d296", "d329", "d438"]

failures:
    a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing
    a_string_filter_cannot_prune_but_still_filters
    exact_search_matches_a_brute_force_reference
    search_respects_a_filter
    zone_maps_skip_blocks_that_cannot_match

test result: FAILED. 3 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
