*** crates/pstore-format/src/reader.rs:120:9: replace Segment::blocks_to_read -> Vec<usize> with vec![]

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace Segment::blocks_to_read -> Vec<usize> with vec![]
@@ -112,28 +112,17 @@
     }
 
     /// Which blocks a filter cannot rule out.
     ///
     /// A block is kept unless its zone map proves no row in it can match. **Erring toward
     /// keeping is mandatory**: a wrongly dropped block silently loses rows.
     #[must_use]
     pub fn blocks_to_read(&self, filter: Option<&Filter>) -> Vec<usize> {
-        (0..self.blocks.len())
-            .filter(|i| match (filter, self.blocks.get(*i)) {
-                (None, _) => true,
-                (Some(f), Some(b)) => match b.zones.get(f.column()) {
-                    Some((lo, hi)) => f.could_match(*lo, *hi),
-                    // No zone map for that column -- it may be a string, or absent from
-                    // this block. Cannot prune, so must read.
-                    None => true,
-                },
-                (Some(_), None) => false,
-            })
-            .collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 
     /// Reads the rows a filter selects.
     ///
     /// The blocks that survive pruning are fetched in **one coalesced round**, so scanning
     /// costs one round trip regardless of how many blocks match.
     pub async fn scan<S: BlobStore>(
         &self,

---- a_string_filter_cannot_prune_but_still_filters stdout ----

thread 'a_string_filter_cannot_prune_but_still_filters' panicked at crates/pstore-format/tests/search.rs:88:5:
assertion `left == right` failed: strings cannot prune
  left: 0
 right: 10

---- a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing stdout ----

thread 'a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing' panicked at crates/pstore-format/tests/search.rs:110:5:
assertion `left == right` failed
  left: 0
 right: 5

---- search_on_a_dimension_mismatch_is_an_error stdout ----

thread 'search_on_a_dimension_mismatch_is_an_error' panicked at crates/pstore-format/tests/search.rs:210:5:
assertion failed: seg.search(&s, &key, &[0.0, 0.0], 3, None).await.is_err()

failures:
    a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing
    a_string_filter_cannot_prune_but_still_filters
    exact_search_matches_a_brute_force_reference
    search_on_a_dimension_mismatch_is_an_error
    search_respects_a_filter
    search_returns_k_results_when_k_exceeds_the_segment
    zone_maps_skip_blocks_that_cannot_match

test result: FAILED. 1 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
