*** crates/pstore-format/src/reader.rs:122:31: replace + with * in Segment::data_end

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace + with * in Segment::data_end
@@ -114,17 +114,17 @@
     /// The byte offset just past the last data block.
     ///
     /// Data blocks are addressed by the index rather than by the directory, so nothing else
     /// can tell whether a section overlaps them.
     #[must_use]
     pub fn data_end(&self) -> u64 {
         self.blocks
             .iter()
-            .map(|b| b.offset + u64::from(b.len))
+            .map(|b| b.offset * /* ~ changed by cargo-mutants ~ */ u64::from(b.len))
             .max()
             .unwrap_or(0)
     }
 
     /// Where a section lives, or `None` if this segment does not carry it.
     #[must_use]
     pub fn section(&self, section: Section) -> Option<std::ops::Range<u64>> {
         self.sections.get(&(section as u16)).cloned()

---- the_vector_section_starts_after_the_last_data_block stdout ----

thread 'the_vector_section_starts_after_the_last_data_block' panicked at crates/pstore-format/tests/sections.rs:227:5:
the vectors section starts at 10318 but the data blocks run to 13727640

failures:
    the_vector_section_starts_after_the_last_data_block

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
