*** crates/pstore-format/src/reader.rs:130:9: replace Segment::section -> Option<std::ops::Range<u64>> with None

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace Segment::section -> Option<std::ops::Range<u64>> with None
@@ -122,17 +122,17 @@
             .map(|b| b.offset + u64::from(b.len))
             .max()
             .unwrap_or(0)
     }
 
     /// Where a section lives, or `None` if this segment does not carry it.
     #[must_use]
     pub fn section(&self, section: Section) -> Option<std::ops::Range<u64>> {
-        self.sections.get(&(section as u16)).cloned()
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     /// Fetches a whole section.
     ///
     /// One ranged read. The caller decides *which* section, which is how a rung-0 scan
     /// avoids the full-precision bytes entirely rather than fetching and discarding them.
     pub async fn fetch_section<S: BlobStore>(
         &self,

---- search_and_filter_work_across_the_memtable_and_segments stdout ----

thread 'search_and_filter_work_across_the_memtable_and_segments' panicked at crates/pstore-engine/tests/engine.rs:318:5:
assertion `left == right` failed: nearest must be found wherever it lives
  left: "d0"
 right: "d25"

failures:
    search_and_filter_work_across_the_memtable_and_segments

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
