*** crates/pstore-format/src/reader.rs:144:9: replace Segment::scan -> Result<Vec<Document>, FormatError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace Segment::scan -> Result<Vec<Document>, FormatError> with Ok(vec![])
@@ -136,36 +136,17 @@
     /// The blocks that survive pruning are fetched in **one coalesced round**, so scanning
     /// costs one round trip regardless of how many blocks match.
     pub async fn scan<S: BlobStore>(
         &self,
         store: &S,
         key: &Key,
         filter: Option<&Filter>,
     ) -> Result<Vec<Document>, FormatError> {
-        let wanted = self.blocks_to_read(filter);
-        if wanted.is_empty() {
-            return Ok(Vec::new());
-        }
-        let ranges: Vec<_> = wanted
-            .iter()
-            .filter_map(|i| self.blocks.get(*i))
-            .map(|b| b.offset..b.offset + u64::from(b.len))
-            .collect();
-        let bufs = store.get_ranges(key, &ranges).await?;
-
-        let mut out = Vec::new();
-        for buf in &bufs {
-            for doc in Self::decode_block(buf)? {
-                if filter.is_none_or(|f| f.matches(&doc)) {
-                    out.push(doc);
-                }
-            }
-        }
-        Ok(out)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Exact k-nearest-neighbour search by squared L2, over the rows a filter selects.
     ///
     /// Brute force, deliberately (D-10): below a few hundred thousand vectors it is
     /// faster than an approximate index, exactly accurate, needs no maintenance, and
     /// covers the long tail of a millions-of-indexes product. It is also the reference
     /// the approximate path will be measured against, so it must be *exactly* right.

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:135:5:
rows before the hole must still be folded

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
