*** crates/pstore-format/src/reader.rs:151:41: replace + with * in Segment::scan

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace + with * in Segment::scan
@@ -143,17 +143,17 @@
     ) -> Result<Vec<Document>, FormatError> {
         let wanted = self.blocks_to_read(filter);
         if wanted.is_empty() {
             return Ok(Vec::new());
         }
         let ranges: Vec<_> = wanted
             .iter()
             .filter_map(|i| self.blocks.get(*i))
-            .map(|b| b.offset..b.offset + u64::from(b.len))
+            .map(|b| b.offset..b.offset * /* ~ changed by cargo-mutants ~ */ u64::from(b.len))
             .collect();
         let bufs = store.get_ranges(key, &ranges).await?;
 
         let mut out = Vec::new();
         for buf in &bufs {
             for doc in Self::decode_block(buf)? {
                 if filter.is_none_or(|f| f.matches(&doc)) {
                     out.push(doc);

---- a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing stdout ----

thread 'a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing' panicked at crates/pstore-format/tests/search.rs:111:48:
called `Result::unwrap()` on an `Err` value: Blob("range 444..812696 outside object of 2501 bytes")

---- pruning_does_not_change_the_answer stdout ----

thread 'pruning_does_not_change_the_answer' panicked at crates/pstore-format/tests/search.rs:64:46:
called `Result::unwrap()` on an `Err` value: Blob("range 389..6614439 outside object of 18971 bytes")

---- search_respects_a_filter stdout ----

thread 'search_respects_a_filter' panicked at crates/pstore-format/tests/search.rs:194:10:
called `Result::unwrap()` on an `Err` value: Blob("range 8500..6196904 outside object of 12236 bytes")

failures:
    a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing
    a_string_filter_cannot_prune_but_still_filters
    exact_search_matches_a_brute_force_reference
    pruning_does_not_change_the_answer
    search_respects_a_filter
    search_returns_k_results_when_k_exceeds_the_segment
    zone_maps_skip_blocks_that_cannot_match

test result: FAILED. 1 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
