*** crates/pstore-format/src/reader.rs:183:14: replace == with != in Segment::search

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace == with != in Segment::search
@@ -175,17 +175,17 @@
     pub async fn search<S: BlobStore>(
         &self,
         store: &S,
         key: &Key,
         query: &[f32],
         k: usize,
         filter: Option<&Filter>,
     ) -> Result<Vec<(String, f32)>, FormatError> {
-        if k == 0 {
+        if k != /* ~ changed by cargo-mutants ~ */ 0 {
             return Ok(Vec::new());
         }
         let docs = self.scan(store, key, filter).await?;
         let mut scored = Vec::with_capacity(docs.len());
         for d in docs {
             if d.vector.len() != query.len() {
                 return Err(FormatError::DimensionMismatch {
                     expected: d.vector.len(),

---- search_returns_k_results_when_k_exceeds_the_segment stdout ----

thread 'search_returns_k_results_when_k_exceeds_the_segment' panicked at crates/pstore-format/tests/search.rs:167:5:
assertion `left == right` failed
  left: 0
 right: 3

---- search_on_a_dimension_mismatch_is_an_error stdout ----

thread 'search_on_a_dimension_mismatch_is_an_error' panicked at crates/pstore-format/tests/search.rs:210:5:
assertion failed: seg.search(&s, &key, &[0.0, 0.0], 3, None).await.is_err()

---- search_respects_a_filter stdout ----

thread 'search_respects_a_filter' panicked at crates/pstore-format/tests/search.rs:195:5:
assertion `left == right` failed
  left: 0
 right: 5

failures:
    exact_search_matches_a_brute_force_reference
    search_on_a_dimension_mismatch_is_an_error
    search_respects_a_filter
    search_returns_k_results_when_k_exceeds_the_segment

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
