*** crates/pstore-format/src/reader.rs:199:39: replace * with + in Segment::search

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace * with + in Segment::search
@@ -191,17 +191,17 @@
                     expected: d.vector.len(),
                     got: query.len(),
                 });
             }
             let dist: f32 = d
                 .vector
                 .iter()
                 .zip(query)
-                .map(|(a, b)| (a - b) * (a - b))
+                .map(|(a, b)| (a - b) + /* ~ changed by cargo-mutants ~ */ (a - b))
                 .sum();
             scored.push((d.id, dist));
         }
         // `total_cmp` rather than `partial_cmp`: a NaN from a malformed vector must order
         // deterministically instead of making the sort's behaviour undefined. Ties break
         // on id so the result is reproducible, which is what lets a reference test exist.
         scored.sort_by(|a, b| a.1.total_cmp(&b.1).then_with(|| a.0.cmp(&b.0)));
         scored.truncate(k);

---- exact_search_matches_a_brute_force_reference stdout ----

thread 'exact_search_matches_a_brute_force_reference' panicked at crates/pstore-format/tests/search.rs:154:9:
assertion `left == right` failed: top-10 disagrees with brute force for [0.1, 0.2, 0.3, 0.4]
  left: ["d206", "d374", "d178", "d460", "d121", "d272", "d476", "d114", "d323", "d5"]
 right: ["d452", "d234", "d442", "d165", "d59", "d334", "d362", "d296", "d329", "d438"]

failures:
    exact_search_matches_a_brute_force_reference

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
