*** crates/pstore-format/src/reader.rs:212:9: replace Segment::decode_block -> Result<Vec<Document>, FormatError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace Segment::decode_block -> Result<Vec<Document>, FormatError> with Ok(vec![])
@@ -204,34 +204,11 @@
         // deterministically instead of making the sort's behaviour undefined. Ties break
         // on id so the result is reproducible, which is what lets a reference test exist.
         scored.sort_by(|a, b| a.1.total_cmp(&b.1).then_with(|| a.0.cmp(&b.0)));
         scored.truncate(k);
         Ok(scored)
     }
 
     fn decode_block(buf: &[u8]) -> Result<Vec<Document>, FormatError> {
-        let mut d = Dec::new(buf);
-        let n = d.u32()? as usize;
-        let mut out = Vec::with_capacity(n.min(1 << 20));
-        for _ in 0..n {
-            let id = d.string()?;
-            let dims = d.u32()? as usize;
-            let mut vector = Vec::with_capacity(dims.min(1 << 16));
-            for _ in 0..dims {
-                vector.push(d.f32()?);
-            }
-            let an = d.u32()? as usize;
-            let mut attrs = BTreeMap::new();
-            for _ in 0..an {
-                let k = d.string()?;
-                let v = match d.u8()? {
-                    0 => Value::Int(d.i64()?),
-                    1 => Value::Str(d.string()?),
-                    _ => return Err(FormatError::Corrupt("unknown value tag")),
-                };
-                attrs.insert(k, v);
-            }
-            out.push(Document { id, vector, attrs });
-        }
-        Ok(out)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }

---- a_string_filter_cannot_prune_but_still_filters stdout ----

thread 'a_string_filter_cannot_prune_but_still_filters' panicked at crates/pstore-format/tests/search.rs:94:5:
assertion `left == right` failed
  left: 0
 right: 20

---- search_on_a_dimension_mismatch_is_an_error stdout ----

thread 'search_on_a_dimension_mismatch_is_an_error' panicked at crates/pstore-format/tests/search.rs:210:5:
assertion failed: seg.search(&s, &key, &[0.0, 0.0], 3, None).await.is_err()

---- search_returns_k_results_when_k_exceeds_the_segment stdout ----

thread 'search_returns_k_results_when_k_exceeds_the_segment' panicked at crates/pstore-format/tests/search.rs:167:5:
assertion `left == right` failed
  left: 0
 right: 3

failures:
    a_string_filter_cannot_prune_but_still_filters
    exact_search_matches_a_brute_force_reference
    search_on_a_dimension_mismatch_is_an_error
    search_respects_a_filter
    search_returns_k_results_when_k_exceeds_the_segment
    zone_maps_skip_blocks_that_cannot_match

test result: FAILED. 2 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
