*** crates/pstore-format/src/reader.rs:216:9: replace Segment::decode_block -> Result<Vec<Document>, FormatError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace Segment::decode_block -> Result<Vec<Document>, FormatError> with Ok(vec![])
@@ -208,11 +208,11 @@
         Ok(scored)
     }
 
     /// ⚠️ Delegates rather than duplicating. This was a second decoder for the same wire
     /// format, byte-identical to `decode_docs` — which means every future change to the
     /// document encoding had to be made twice, and the day one of them was missed the
     /// reader and the writer would disagree with no compiler to say so.
     fn decode_block(buf: &[u8]) -> Result<Vec<Document>, FormatError> {
-        crate::decode_docs(buf)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }

---- a_string_filter_cannot_prune_but_still_filters stdout ----

thread 'a_string_filter_cannot_prune_but_still_filters' panicked at crates/pstore-format/tests/search.rs:94:5:
assertion `left == right` failed
  left: 0
 right: 20

---- search_on_a_dimension_mismatch_is_an_error stdout ----

thread 'search_on_a_dimension_mismatch_is_an_error' panicked at crates/pstore-format/tests/search.rs:210:5:
assertion failed: seg.search(&s, &key, &[0.0, 0.0], 3, None).await.is_err()

---- search_respects_a_filter stdout ----

thread 'search_respects_a_filter' panicked at crates/pstore-format/tests/search.rs:195:5:
assertion `left == right` failed
  left: 0
 right: 5

failures:
    a_string_filter_cannot_prune_but_still_filters
    exact_search_matches_a_brute_force_reference
    search_on_a_dimension_mismatch_is_an_error
    search_respects_a_filter
    search_returns_k_results_when_k_exceeds_the_segment
    zone_maps_skip_blocks_that_cannot_match

test result: FAILED. 2 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
