*** crates/pstore-format/src/reader.rs:280:52: replace * with + in Segment::scan

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace * with + in Segment::scan
@@ -272,17 +272,17 @@
         let mut all: Vec<std::ops::Range<u64>> = ranges;
         let block_count = all.len();
         if let (Some(vec_span), true) = (self.section(Section::Vectors), per_row > 0) {
             for i in &wanted {
                 let (Some(start), Some(b)) = (base.get(*i), self.blocks.get(*i)) else {
                     continue;
                 };
                 let lo = vec_span.start + (*start * per_row) as u64;
-                all.push(lo..lo + (b.rows as usize * per_row) as u64);
+                all.push(lo..lo + (b.rows as usize + /* ~ changed by cargo-mutants ~ */ per_row) as u64);
             }
         }
         // ⚠️ One call, so blocks and vector rows go out TOGETHER. They are different
         // sections of the same object, both spans are known before either is issued, and
         // awaiting one before the other would make every scan a two-hop read for no reason
         // a caller could see. Width is free; depth is not.
         let bufs = store.get_ranges(key, &all).await?;

---- search_and_filter_work_across_the_memtable_and_segments stdout ----

thread 'search_and_filter_work_across_the_memtable_and_segments' panicked at crates/pstore-engine/tests/engine.rs:318:5:
assertion `left == right` failed: nearest must be found wherever it lives
  left: "d10"
 right: "d25"

failures:
    search_and_filter_work_across_the_memtable_and_segments

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
