*** crates/pstore-format/src/reader.rs:52:36: replace + with * in Segment::open

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace + with * in Segment::open
@@ -44,17 +44,17 @@
         // The trailing magic is what distinguishes a real footer from bytes that happen to
         // decode: a tampered length field almost never leaves both copies intact.
         if d.raw(8)? != MAGIC {
             return Err(FormatError::Corrupt("bad trailing magic"));
         }
 
         // Where in the object the bytes we hold begin. Derived from the footer's own
         // offsets rather than from a separately-fetched length.
-        let seg_len = index_offset + u64::from(index_len) + FOOTER_LEN as u64;
+        let seg_len = index_offset * /* ~ changed by cargo-mutants ~ */ u64::from(index_len) + FOOTER_LEN as u64;
         let tail_start = seg_len.saturating_sub(tail.len() as u64);
         let idx_bytes = {
             if index_offset >= tail_start {
                 let lo = (index_offset - tail_start) as usize;
                 let hi = lo
                     .checked_add(index_len as usize)
                     .ok_or(FormatError::Truncated)?;
                 Bytes::copy_from_slice(tail.get(lo..hi).ok_or(FormatError::Truncated)?)

---- a_cold_read_has_a_sequential_depth_of_at_most_three stdout ----

thread 'a_cold_read_has_a_sequential_depth_of_at_most_three' panicked at crates/pstore-engine/tests/invariants.rs:57:5:
cold scan took 4 sequential round trips

---- a_cold_filtered_read_has_a_sequential_depth_of_at_most_three stdout ----

thread 'a_cold_filtered_read_has_a_sequential_depth_of_at_most_three' panicked at crates/pstore-engine/tests/invariants.rs:73:5:
filtered scan took 4 round trips

---- a_cold_search_has_a_sequential_depth_of_at_most_three stdout ----

thread 'a_cold_search_has_a_sequential_depth_of_at_most_three' panicked at crates/pstore-engine/tests/invariants.rs:86:5:
search took 4 round trips

failures:
    a_cold_filtered_read_has_a_sequential_depth_of_at_most_three
    a_cold_read_has_a_sequential_depth_of_at_most_three
    a_cold_search_has_a_sequential_depth_of_at_most_three

test result: FAILED. 4 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
