*** crates/pstore-format/src/reader.rs:56:57: replace + with - in Segment::open

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace + with - in Segment::open
@@ -48,17 +48,17 @@
         // The trailing magic is what distinguishes a real footer from bytes that happen to
         // decode: a tampered length field almost never leaves both copies intact.
         if d.raw(8)? != MAGIC {
             return Err(FormatError::Corrupt("bad trailing magic"));
         }
 
         // Where in the object the bytes we hold begin. Derived from the footer's own
         // offsets rather than from a separately-fetched length.
-        let seg_len = meta_offset + u64::from(meta_len) + FOOTER_LEN as u64;
+        let seg_len = meta_offset + u64::from(meta_len) - /* ~ changed by cargo-mutants ~ */ FOOTER_LEN as u64;
         let tail_start = seg_len.saturating_sub(tail.len() as u64);
         let idx_bytes = {
             if meta_offset >= tail_start {
                 let lo = (meta_offset - tail_start) as usize;
                 let hi = lo
                     .checked_add(meta_len as usize)
                     .ok_or(FormatError::Truncated)?;
                 Bytes::copy_from_slice(tail.get(lo..hi).ok_or(FormatError::Truncated)?)

---- a_cold_read_of_a_large_segment_still_costs_three_rounds stdout ----

thread 'a_cold_read_of_a_large_segment_still_costs_three_rounds' panicked at crates/pstore-engine/tests/depth_at_scale.rs:40:44:
called `Result::unwrap()` on an `Err` value: Format("segment truncated")

---- bounding_the_index_does_not_just_move_the_cost_into_bytes stdout ----

thread 'bounding_the_index_does_not_just_move_the_cost_into_bytes' panicked at crates/pstore-engine/tests/depth_at_scale.rs:89:41:
called `Result::unwrap()` on an `Err` value: Format("segment truncated")

failures:
    a_cold_read_of_a_large_segment_still_costs_three_rounds
    bounding_the_index_does_not_just_move_the_cost_into_bytes

test result: FAILED. 1 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
