*** crates/pstore-format/src/reader.rs:57:29: replace >= with < in Segment::open

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace >= with < in Segment::open
@@ -49,17 +49,17 @@
             return Err(FormatError::Corrupt("bad trailing magic"));
         }
 
         // Where in the object the bytes we hold begin. Derived from the footer's own
         // offsets rather than from a separately-fetched length.
         let seg_len = index_offset + u64::from(index_len) + FOOTER_LEN as u64;
         let tail_start = seg_len.saturating_sub(tail.len() as u64);
         let idx_bytes = {
-            if index_offset >= tail_start {
+            if index_offset < /* ~ changed by cargo-mutants ~ */ tail_start {
                 let lo = (index_offset - tail_start) as usize;
                 let hi = lo
                     .checked_add(index_len as usize)
                     .ok_or(FormatError::Truncated)?;
                 Bytes::copy_from_slice(tail.get(lo..hi).ok_or(FormatError::Truncated)?)
             } else {
                 // Only now, and only for a segment whose index section is large.
                 store

---- a_small_segment_opens_in_one_read stdout ----

thread 'a_small_segment_opens_in_one_read' panicked at crates/pstore-format/tests/segment.rs:96:5:
assertion `left == right` failed
  left: 2
 right: 1

---- a_segment_whose_index_section_overflows_the_suffix_takes_two_reads stdout ----

thread 'a_segment_whose_index_section_overflows_the_suffix_takes_two_reads' panicked at /tmp/cargo-mutants-pstore-LuBYam.tmp/crates/pstore-format/src/reader.rs:58:26:
attempt to subtract with overflow

failures:
    a_segment_whose_index_section_overflows_the_suffix_takes_two_reads
    a_small_segment_opens_in_one_read

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
