*** crates/pstore-format/src/reader.rs:59:28: replace >= with < in Segment::open

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace >= with < in Segment::open
@@ -51,17 +51,17 @@
             return Err(FormatError::Corrupt("bad trailing magic"));
         }
 
         // Where in the object the bytes we hold begin. Derived from the footer's own
         // offsets rather than from a separately-fetched length.
         let seg_len = meta_offset + u64::from(meta_len) + FOOTER_LEN as u64;
         let tail_start = seg_len.saturating_sub(tail.len() as u64);
         let idx_bytes = {
-            if meta_offset >= tail_start {
+            if meta_offset < /* ~ changed by cargo-mutants ~ */ tail_start {
                 let lo = (meta_offset - tail_start) as usize;
                 let hi = lo
                     .checked_add(meta_len as usize)
                     .ok_or(FormatError::Truncated)?;
                 Bytes::copy_from_slice(tail.get(lo..hi).ok_or(FormatError::Truncated)?)
             } else {
                 // Only now, and only for a segment whose meta region is large.
                 store

---- a_cold_read_of_a_large_segment_still_costs_three_rounds stdout ----

thread 'a_cold_read_of_a_large_segment_still_costs_three_rounds' panicked at crates/pstore-engine/tests/depth_at_scale.rs:42:5:
a 40,000-row segment took 4 sequential round trips

failures:
    a_cold_read_of_a_large_segment_still_costs_three_rounds

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.20s

*** result: Failure(101)
