*** crates/pstore-format/src/reader.rs:60:39: replace - with / in Segment::open

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace - with / in Segment::open
@@ -52,17 +52,17 @@
         }
 
         // Where in the object the bytes we hold begin. Derived from the footer's own
         // offsets rather than from a separately-fetched length.
         let seg_len = meta_offset + u64::from(meta_len) + FOOTER_LEN as u64;
         let tail_start = seg_len.saturating_sub(tail.len() as u64);
         let idx_bytes = {
             if meta_offset >= tail_start {
-                let lo = (meta_offset - tail_start) as usize;
+                let lo = (meta_offset / /* ~ changed by cargo-mutants ~ */ tail_start) as usize;
                 let hi = lo
                     .checked_add(meta_len as usize)
                     .ok_or(FormatError::Truncated)?;
                 Bytes::copy_from_slice(tail.get(lo..hi).ok_or(FormatError::Truncated)?)
             } else {
                 // Only now, and only for a segment whose meta region is large.
                 store
                     .get_range(key, meta_offset..meta_offset + u64::from(meta_len))

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at /tmp/cargo-mutants-pstore-yddpDt.tmp/crates/pstore-format/src/reader.rs:60:26:
attempt to divide by zero

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
