*** crates/pstore-format/src/reader.rs:72:33: replace != with == in Segment::open

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace != with == in Segment::open
@@ -64,17 +64,17 @@
                 Bytes::copy_from_slice(tail.get(lo..hi).ok_or(FormatError::Truncated)?)
             } else {
                 // Only now, and only for a segment whose meta region is large.
                 store
                     .get_range(key, meta_offset..meta_offset + u64::from(meta_len))
                     .await?
             }
         };
-        if checksum(&idx_bytes) != sum {
+        if checksum(&idx_bytes) == /* ~ changed by cargo-mutants ~ */ sum {
             return Err(FormatError::ChecksumMismatch);
         }
 
         // The meta region is the directory followed by the block index. Parsing the
         // directory tells us where the block index is; everything else in it is a byte
         // range a later fetch may or may not use.
         let mut d = Dec::new(&idx_bytes);
         let entries = d.u32()? as usize;

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:134:41:
called `Result::unwrap()` on an `Err` value: Format("segment checksum mismatch")

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
