*** crates/pstore-format/src/reader.rs:79:9: replace Segment::decode_index -> Result<Vec<BlockMeta>, FormatError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace Segment::decode_index -> Result<Vec<BlockMeta>, FormatError> with Ok(vec![])
@@ -71,35 +71,17 @@
 
         Ok(Self {
             blocks: Self::decode_index(&idx_bytes)?,
             rows,
         })
     }
 
     fn decode_index(bytes: &[u8]) -> Result<Vec<BlockMeta>, FormatError> {
-        let mut d = Dec::new(bytes);
-        let n = d.u32()? as usize;
-        let mut blocks = Vec::with_capacity(n.min(1 << 20));
-        for _ in 0..n {
-            let (offset, len, rows) = (d.u64()?, d.u32()?, d.u32()?);
-            let zn = d.u32()? as usize;
-            let mut zones = BTreeMap::new();
-            for _ in 0..zn {
-                let k = d.string()?;
-                zones.insert(k, (d.i64()?, d.i64()?));
-            }
-            blocks.push(BlockMeta {
-                offset,
-                len,
-                rows,
-                zones,
-            });
-        }
-        Ok(blocks)
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Rows in the segment.
     #[must_use]
     pub fn row_count(&self) -> usize {
         self.rows as usize
     }

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:135:5:
rows before the hole must still be folded

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
