*** crates/pstore-format/src/reader.rs:94:19: replace == with != in Segment::open

*** mutation diff:
--- crates/pstore-format/src/reader.rs
+++ replace == with != in Segment::open
@@ -86,17 +86,17 @@
             let len = d.u64()?;
             let span = offset..offset.saturating_add(len);
             // ⚠️ Recorded by RAW id, including ids this version has never heard of. There
             // is deliberately no "is this known?" check: `section()` is looked up by a
             // `Section`, so an unknown id is unreachable and storing it costs one map entry.
             // A check would be equivalent code that no test could distinguish — and
             // refusing would make every future section a breaking change for every deployed
             // reader at once, which segments being immutable makes permanent.
-            if id == Section::Blocks as u16 {
+            if id != /* ~ changed by cargo-mutants ~ */ Section::Blocks as u16 {
                 blocks_span = Some(span.clone());
             }
             sections.insert(id, span);
         }
         let blocks_span = blocks_span.ok_or(FormatError::Corrupt("no block section"))?;
         // The block index sits inside the region already fetched, at a known offset.
         let lo = (blocks_span.start - meta_offset) as usize;
         let hi = lo

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at /tmp/cargo-mutants-pstore-yddpDt.tmp/crates/pstore-format/src/reader.rs:101:18:
attempt to subtract with overflow

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
