*** crates/pstore-format/src/writer.rs:133:19: replace += with *= in SegmentWriter::seal

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ replace += with *= in SegmentWriter::seal
@@ -125,17 +125,17 @@
         let len = blk.len() as u32;
         self.body.raw(&blk);
         self.blocks.push(BlockMeta {
             offset,
             len,
             rows: rows.len() as u32,
             zones,
         });
-        self.rows += rows.len() as u32;
+        self.rows *= /* ~ changed by cargo-mutants ~ */ rows.len() as u32;
     }
 
     /// Encodes the index section for the blocks sealed so far.
     fn encode_index(&self) -> Enc {
         let mut idx = Enc::default();
         idx.u32(self.blocks.len() as u32);
         for b in &self.blocks {
             idx.u64(b.offset);

---- search_and_filter_work_across_the_memtable_and_segments stdout ----

thread 'search_and_filter_work_across_the_memtable_and_segments' panicked at crates/pstore-engine/tests/engine.rs:318:5:
assertion `left == right` failed: nearest must be found wherever it lives
  left: "d0"
 right: "d25"

failures:
    search_and_filter_work_across_the_memtable_and_segments

test result: FAILED. 12 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
