*** crates/pstore-format/src/writer.rs:138:9: replace SegmentWriter::encode_index -> Enc with Default::default()

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ replace SegmentWriter::encode_index -> Enc with Default::default()
@@ -130,30 +130,17 @@
             rows: rows.len() as u32,
             zones,
         });
         self.rows += rows.len() as u32;
     }
 
     /// Encodes the index section for the blocks sealed so far.
     fn encode_index(&self) -> Enc {
-        let mut idx = Enc::default();
-        idx.u32(self.blocks.len() as u32);
-        for b in &self.blocks {
-            idx.u64(b.offset);
-            idx.u32(b.len);
-            idx.u32(b.rows);
-            idx.u32(b.zones.len() as u32);
-            for (k, (lo, hi)) in &b.zones {
-                idx.bytes(k.as_bytes());
-                idx.i64(*lo);
-                idx.i64(*hi);
-            }
-        }
-        idx
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Seals the last block and emits the segment.
     #[must_use]
     pub fn finish(mut self) -> Bytes {
         let docs = std::mem::take(&mut self.docs);
         // ⚠️ Grow the block size until the index fits the budget, rather than trusting the
         // caller's request. Doubling terminates: at one block the index is a handful of

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:134:41:
called `Result::unwrap()` on an `Err` value: Format("segment truncated")

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
