*** crates/pstore-format/src/writer.rs:169:47: replace || with && in SegmentWriter::finish

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ replace || with && in SegmentWriter::finish
@@ -161,17 +161,17 @@
         let idx = loop {
             self.blocks.clear();
             self.body = Enc::default();
             self.rows = 0;
             for chunk in docs.chunks(self.rows_per_block) {
                 self.seal(chunk);
             }
             let idx = self.encode_index();
-            if idx.len() <= self.index_budget || self.blocks.len() <= 1 {
+            if idx.len() <= self.index_budget && /* ~ changed by cargo-mutants ~ */ self.blocks.len() <= 1 {
                 break idx;
             }
             self.rows_per_block = self.rows_per_block.saturating_mul(2);
         };
 
         // Vectors leave the data blocks entirely and become their own section: row-major,
         // fixed width, so row `i` is a computable byte range and a reader can fetch one row
         // or none without touching the rest.

---- a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing stdout ----

thread 'a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing' panicked at crates/pstore-format/tests/search.rs:148:5:
assertion `left == right` failed
  left: 1
 right: 5

---- a_string_filter_cannot_prune_but_still_filters stdout ----

thread 'a_string_filter_cannot_prune_but_still_filters' panicked at crates/pstore-format/tests/search.rs:126:5:
assertion `left == right` failed: strings cannot prune
  left: 1
 right: 10

---- zone_maps_skip_blocks_that_cannot_match stdout ----

thread 'zone_maps_skip_blocks_that_cannot_match' panicked at crates/pstore-format/tests/search.rs:49:5:
assertion `left == right` failed
  left: 1
 right: 40

failures:
    a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing
    a_string_filter_cannot_prune_but_still_filters
    zone_maps_skip_blocks_that_cannot_match

test result: FAILED. 5 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
