*** crates/pstore-format/src/writer.rs:241:46: replace + with * in SegmentWriter::finish

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ replace + with * in SegmentWriter::finish
@@ -233,17 +233,17 @@
             meta.u16(*id);
             meta.u64(*offset);
             meta.u64(*len);
         }
         let blocks_at = meta_offset + meta.len() as u64;
         // Patch the Blocks entry now that the directory's size is known. Encoding it twice
         // would be simpler and would silently break the moment the directory's size depended
         // on the value being patched.
-        let entry = 4 + (dir.len() - 1) * (2 + 8 + 8) + 2;
+        let entry = 4 + (dir.len() - 1) * (2 * /* ~ changed by cargo-mutants ~ */ 8 + 8) + 2;
         if let Some(slot) = meta.0.get_mut(entry..entry + 8) {
             slot.copy_from_slice(&blocks_at.to_le_bytes());
         }
         meta.raw(&idx.0);
 
         let meta_len = meta.len() as u32;
         let sum = checksum(&meta.0);
         out.raw(&meta.0);

---- a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped stdout ----

thread 'a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped' panicked at crates/pstore-engine/tests/bundle_errors.rs:134:41:
called `Result::unwrap()` on an `Err` value: Format("segment truncated")

failures:
    a_hole_in_a_lane_bounds_the_tail_rather_than_being_skipped

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
