*** crates/pstore-format/src/writer.rs:38:31: replace >= with < in SegmentWriter::push

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ replace >= with < in SegmentWriter::push
@@ -30,17 +30,17 @@
             body: Enc::default(),
             rows: 0,
         }
     }
 
     /// Adds a document, sealing a block when it fills.
     pub fn push(&mut self, doc: Document) {
         self.pending.push(doc);
-        if self.pending.len() >= self.rows_per_block {
+        if self.pending.len() < /* ~ changed by cargo-mutants ~ */ self.rows_per_block {
             self.seal();
         }
     }
 
     fn seal(&mut self) {
         if self.pending.is_empty() {
             return;
         }

---- a_string_filter_cannot_prune_but_still_filters stdout ----

thread 'a_string_filter_cannot_prune_but_still_filters' panicked at crates/pstore-format/tests/search.rs:88:5:
assertion `left == right` failed: strings cannot prune
  left: 80
 right: 10

---- zone_maps_skip_blocks_that_cannot_match stdout ----

thread 'zone_maps_skip_blocks_that_cannot_match' panicked at crates/pstore-format/tests/search.rs:38:5:
assertion `left == right` failed
  left: 400
 right: 40

---- a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing stdout ----

thread 'a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing' panicked at crates/pstore-format/tests/search.rs:110:5:
assertion `left == right` failed
  left: 40
 right: 5

failures:
    a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing
    a_string_filter_cannot_prune_but_still_filters
    zone_maps_skip_blocks_that_cannot_match

test result: FAILED. 5 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
