*** crates/pstore-format/src/writer.rs:44:9: replace SegmentWriter::seal with ()

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ replace SegmentWriter::seal with ()
@@ -36,59 +36,17 @@
     pub fn push(&mut self, doc: Document) {
         self.pending.push(doc);
         if self.pending.len() >= self.rows_per_block {
             self.seal();
         }
     }
 
     fn seal(&mut self) {
-        if self.pending.is_empty() {
-            return;
-        }
-        let offset = self.body.len() as u64;
-        let mut zones: BTreeMap<String, (i64, i64)> = BTreeMap::new();
-        let mut blk = Enc::default();
-        blk.u32(self.pending.len() as u32);
-        for d in &self.pending {
-            blk.bytes(d.id.as_bytes());
-            blk.u32(d.vector.len() as u32);
-            for f in &d.vector {
-                blk.f32(*f);
-            }
-            blk.u32(d.attrs.len() as u32);
-            for (k, v) in &d.attrs {
-                blk.bytes(k.as_bytes());
-                match v {
-                    Value::Int(n) => {
-                        blk.u8(0);
-                        blk.i64(*n);
-                        // Zone maps are built here, from the rows as they are written --
-                        // never from a later pass that could disagree with the bytes.
-                        let e = zones.entry(k.clone()).or_insert((*n, *n));
-                        e.0 = e.0.min(*n);
-                        e.1 = e.1.max(*n);
-                    }
-                    Value::Str(s) => {
-                        blk.u8(1);
-                        blk.bytes(s.as_bytes());
-                    }
-                }
-            }
-        }
-        let len = blk.len() as u32;
-        self.body.raw(&blk.0);
-        self.blocks.push(BlockMeta {
-            offset,
-            len,
-            rows: self.pending.len() as u32,
-            zones,
-        });
-        self.rows += self.pending.len() as u32;
-        self.pending.clear();
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     /// Seals the last block and emits the segment.
     #[must_use]
     pub fn finish(mut self) -> Bytes {
         self.seal();
 
         let mut idx = Enc::default();

---- a_string_filter_cannot_prune_but_still_filters stdout ----

thread 'a_string_filter_cannot_prune_but_still_filters' panicked at crates/pstore-format/tests/search.rs:88:5:
assertion `left == right` failed: strings cannot prune
  left: 0
 right: 10

---- a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing stdout ----

thread 'a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing' panicked at crates/pstore-format/tests/search.rs:110:5:
assertion `left == right` failed
  left: 0
 right: 5

---- search_on_a_dimension_mismatch_is_an_error stdout ----

thread 'search_on_a_dimension_mismatch_is_an_error' panicked at crates/pstore-format/tests/search.rs:210:5:
assertion failed: seg.search(&s, &key, &[0.0, 0.0], 3, None).await.is_err()

failures:
    a_filter_on_an_unknown_column_matches_nothing_and_prunes_nothing
    a_string_filter_cannot_prune_but_still_filters
    exact_search_matches_a_brute_force_reference
    search_on_a_dimension_mismatch_is_an_error
    search_respects_a_filter
    search_returns_k_results_when_k_exceeds_the_segment
    zone_maps_skip_blocks_that_cannot_match

test result: FAILED. 1 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
