*** crates/pstore-format/src/writer.rs:85:19: replace += with *= in SegmentWriter::seal

*** mutation diff:
--- crates/pstore-format/src/writer.rs
+++ replace += with *= in SegmentWriter::seal
@@ -77,17 +77,17 @@
         let len = blk.len() as u32;
         self.body.raw(&blk.0);
         self.blocks.push(BlockMeta {
             offset,
             len,
             rows: self.pending.len() as u32,
             zones,
         });
-        self.rows += self.pending.len() as u32;
+        self.rows *= /* ~ changed by cargo-mutants ~ */ self.pending.len() as u32;
         self.pending.clear();
     }
 
     /// Seals the last block and emits the segment.
     #[must_use]
     pub fn finish(mut self) -> Bytes {
         self.seal();

---- a_small_segment_opens_in_one_read stdout ----

thread 'a_small_segment_opens_in_one_read' panicked at crates/pstore-format/tests/segment.rs:97:5:
assertion `left == right` failed
  left: 0
 right: 3

---- a_segment_round_trips_through_the_blob_store stdout ----

thread 'a_segment_round_trips_through_the_blob_store' panicked at crates/pstore-format/tests/segment.rs:44:5:
assertion `left == right` failed
  left: 0
 right: 50

---- a_segment_is_readable_from_its_key_alone stdout ----

thread 'a_segment_is_readable_from_its_key_alone' panicked at crates/pstore-format/tests/segment.rs:63:5:
assertion `left == right` failed
  left: 0
 right: 9

failures:
    a_segment_is_readable_from_its_key_alone
    a_segment_round_trips_through_the_blob_store
    a_segment_whose_index_section_overflows_the_suffix_takes_two_reads
    a_small_segment_opens_in_one_read

test result: FAILED. 3 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
