*** crates/pstore-index/src/cluster.rs:108:9: replace Clustering::centroids -> &[Vec<f32>] with Vec::leak(vec![vec![0.0]])

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace Clustering::centroids -> &[Vec<f32>] with Vec::leak(vec![vec![0.0]])
@@ -100,17 +100,17 @@
     centroids: Vec<Vec<f32>>,
     lists: Vec<Vec<usize>>,
 }
 
 impl Clustering {
     /// The centroid of each posting list.
     #[must_use]
     pub fn centroids(&self) -> &[Vec<f32>] {
-        &self.centroids
+        Vec::leak(vec![vec![0.0]]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// The rows in each posting list, ascending.
     #[must_use]
     pub fn lists(&self) -> &[Vec<usize>] {
         &self.lists
     }

---- an_empty_corpus_is_not_a_panic stdout ----

thread 'an_empty_corpus_is_not_a_panic' panicked at crates/pstore-index/tests/clustering.rs:210:5:
assertion failed: c.centroids().is_empty()

---- a_centroid_is_the_mean_of_what_it_holds stdout ----

thread 'a_centroid_is_the_mean_of_what_it_holds' panicked at crates/pstore-index/tests/clustering.rs:180:13:
centroid 0 dim 0 is 0 but its members average -1.0469081

failures:
    a_centroid_is_the_mean_of_what_it_holds
    an_empty_corpus_is_not_a_panic

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.39s

*** result: Failure(101)
