*** crates/pstore-index/src/cluster.rs:124:9: replace Clustering::assignment_cost -> f64 with 0.0

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace Clustering::assignment_cost -> f64 with 0.0
@@ -116,25 +116,17 @@
 
     /// Total squared distance from each vector to the centroid it was assigned.
     ///
     /// The k-means objective, and the only way to tell a *balanced* assignment from a
     /// *good* balanced assignment: both satisfy the capacity bound, and one of them puts
     /// vectors in lists they have no business being in.
     #[must_use]
     pub fn assignment_cost(&self, corpus: &[Vec<f32>]) -> f64 {
-        self.lists
-            .iter()
-            .enumerate()
-            .flat_map(|(c, list)| {
-                list.iter().filter_map(move |r| {
-                    Some(f64::from(dist2(corpus.get(*r)?, self.centroids.get(c)?)))
-                })
-            })
-            .sum()
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// The same objective if every vector went to its nearest centroid, ignoring capacity.
     ///
     /// A lower bound the balanced assignment cannot beat, so the ratio between them is what
     /// balance actually costs.
     #[must_use]
     pub fn unconstrained_cost(&self, corpus: &[Vec<f32>]) -> f64 {

*** result: Success
