*** crates/pstore-index/src/cluster.rs:242:24: replace < with == in seed_centroids

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace < with == in seed_centroids
@@ -234,17 +234,17 @@
 /// the same dense blob, which is what leaves a whole region to one list.
 fn seed_centroids(corpus: &[Vec<f32>], k: usize, dim: usize) -> Vec<Vec<f32>> {
     let mut chosen: Vec<Vec<f32>> = Vec::with_capacity(k);
     chosen.push(corpus.first().cloned().unwrap_or_else(|| vec![0.0; dim]));
     let mut best: Vec<f32> = corpus
         .iter()
         .map(|v| dist2(v, chosen.first().map_or(&[][..], Vec::as_slice)))
         .collect();
-    while chosen.len() < k {
+    while chosen.len() == /* ~ changed by cargo-mutants ~ */ k {
         let (far, _) = best
             .iter()
             .enumerate()
             .fold((0usize, f32::NEG_INFINITY), |acc, (i, d)| {
                 if *d > acc.1 { (i, *d) } else { acc }
             });
         let Some(next) = corpus.get(far).cloned() else {
             break;

---- a_corpus_smaller_than_one_list_makes_a_single_cluster stdout ----

thread 'a_corpus_smaller_than_one_list_makes_a_single_cluster' panicked at crates/pstore-index/tests/clustering.rs:203:5:
assertion `left == right` failed
  left: 34
 right: 50

---- every_vector_is_reachable_from_at_least_one_list stdout ----

thread 'every_vector_is_reachable_from_at_least_one_list' panicked at crates/pstore-index/tests/clustering.rs:108:9:
assertion `left == right` failed: uniform: 914 vectors are in no posting list
  left: 914
 right: 0

---- the_list_count_follows_the_target_size stdout ----

thread 'the_list_count_follows_the_target_size' panicked at crates/pstore-index/tests/clustering.rs:160:5:
4,000 vectors at a target of 500 gave 1 lists

failures:
    a_corpus_smaller_than_one_list_makes_a_single_cluster
    every_vector_is_reachable_from_at_least_one_list
    the_list_count_follows_the_target_size

test result: FAILED. 5 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.32s

*** result: Failure(101)
