*** crates/pstore-index/src/cluster.rs:271:48: replace <= with > in augment

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace <= with > in augment
@@ -263,17 +263,17 @@
 /// centroids belongs, as far as any query is concerned, to both: a query near the boundary
 /// probes one list and the answer is in the other. Assignment has to pick one; replication
 /// undoes the arbitrariness for the vectors where it matters, and only for those.
 ///
 /// Bounded twice — by `replicas` and by `boundary` — because the degenerate version
 /// replicates everything into everything and calls the resulting exhaustive scan a
 /// clustered index.
 fn augment(corpus: &[Vec<f32>], centroids: &[Vec<f32>], lists: &mut [Vec<usize>], params: Params) {
-    if params.replicas == 0 || params.boundary <= 0.0 || centroids.len() < 2 {
+    if params.replicas == 0 || params.boundary > /* ~ changed by cargo-mutants ~ */ 0.0 || centroids.len() < 2 {
         return;
     }
     // Pass one: every replica the boundary rule would admit, with its distance, so pass two
     // can prefer the closest when a list runs out of room.
     let mut extra: Vec<Vec<(usize, f32)>> = vec![Vec::new(); lists.len()];
     for (row, v) in corpus.iter().enumerate() {
         let mut d: Vec<(usize, f32)> = centroids
             .iter()

---- augmentation_lifts_recall_by_five_points_at_p_two stdout ----

thread 'augmentation_lifts_recall_by_five_points_at_p_two' panicked at crates/pstore-index/tests/recall.rs:89:5:
augmentation moved recall@10 at p=2 from 0.830 to 0.830, under the 5-point floor: it is costing index size and buying nothing

failures:
    augmentation_lifts_recall_by_five_points_at_p_two

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.11s

*** result: Failure(101)
