*** crates/pstore-index/src/cluster.rs:290:36: replace * with + in augment

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace * with + in augment
@@ -282,17 +282,17 @@
             .collect();
         d.sort_by(|a, b| a.1.total_cmp(&b.1).then_with(|| a.0.cmp(&b.0)));
         let Some((_, nearest)) = d.first().copied() else {
             continue;
         };
         // Compared in true distance, not squared: `boundary` is a fraction of a distance,
         // and applying it to a squared value would make the threshold quietly
         // dimension-dependent.
-        let limit = nearest.sqrt() * (1.0 + params.boundary);
+        let limit = nearest.sqrt() + /* ~ changed by cargo-mutants ~ */ (1.0 + params.boundary);
         for (c, dd) in d.iter().skip(1).take(params.replicas) {
             if dd.sqrt() <= limit
                 && let Some(slot) = extra.get_mut(*c)
             {
                 slot.push((row, *dd));
             }
         }
     }

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:417:5:
exact rerank found only 27 of 50

failures:
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.63s

*** result: Failure(101)
