*** crates/pstore-index/src/cluster.rs:314:27: replace >= with < in augment

*** mutation diff:
--- crates/pstore-index/src/cluster.rs
+++ replace >= with < in augment
@@ -306,17 +306,17 @@
     // to grow every list proportionally; what it may not do is grow one of them.
     let admitted: usize = extra.iter().map(Vec::len).sum();
     let total = corpus.len().saturating_add(admitted);
     let cap = capacity(total, lists.len().max(1), params.balance);
     for (list, mut add) in lists.iter_mut().zip(extra) {
         // Closest first, so a list that fills keeps the replicas that mattered most.
         add.sort_by(|a, b| a.1.total_cmp(&b.1).then_with(|| a.0.cmp(&b.0)));
         for (row, _) in add {
-            if list.len() >= cap {
+            if list.len() < /* ~ changed by cargo-mutants ~ */ cap {
                 break;
             }
             list.push(row);
         }
         list.sort_unstable();
         // A row replicated into a list it was also assigned to would be scored twice and
         // could occupy two slots in a top-k.
         list.dedup();

---- augmentation_lifts_recall_by_five_points_at_p_two stdout ----

thread 'augmentation_lifts_recall_by_five_points_at_p_two' panicked at crates/pstore-index/tests/recall.rs:89:5:
augmentation moved recall@10 at p=2 from 0.830 to 0.830, under the 5-point floor: it is costing index size and buying nothing

failures:
    augmentation_lifts_recall_by_five_points_at_p_two

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.11s

*** result: Failure(101)
