*** crates/pstore-index/src/ladder.rs:46:9: replace Ladder::keep -> usize with 1

*** mutation diff:
--- crates/pstore-index/src/ladder.rs
+++ replace Ladder::keep -> usize with 1
@@ -38,23 +38,17 @@
     }
 
     /// How many candidates `rung` keeps.
     ///
     /// Strictly narrowing, because a rung that hands on as many as it received is a rescan
     /// at higher cost rather than a rerank.
     #[must_use]
     pub fn keep(&self, rung: Rung) -> usize {
-        match rung {
-            Rung::OneBit => self.k * self.oversample,
-            // A fixed 2x, so the last rung's fetch is small enough to be worth its round
-            // trip: at k=10 that is 20 vectors, tens of kilobytes.
-            Rung::Int8 => self.k * 2,
-            Rung::Exact => self.k,
-        }
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     fn top(&self, mut scored: Vec<(usize, f32)>, keep: usize) -> Vec<(usize, f32)> {
         // Descending by score; ties broken by id so a result set is reproducible, which is
         // what lets a recall number be compared across runs at all.
         scored.sort_by(|a, b| b.1.total_cmp(&a.1).then_with(|| a.0.cmp(&b.0)));
         scored.truncate(keep);
         scored

---- the_ladder_narrows_and_never_widens stdout ----

thread 'the_ladder_narrows_and_never_widens' panicked at crates/pstore-index/tests/ladder.rs:107:5:
assertion `left == right` failed
  left: 1
 right: 80

---- the_exact_rung_reproduces_brute_force_on_what_it_is_given stdout ----

thread 'the_exact_rung_reproduces_brute_force_on_what_it_is_given' panicked at crates/pstore-index/tests/ladder.rs:197:9:
assertion `left == right` failed: the exact rung disagreed with brute force
  left: [4]
 right: [4, 109, 61, 64, 163, 150, 11, 12, 81, 3]

---- int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung stdout ----

thread 'int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung' panicked at crates/pstore-index/tests/ladder.rs:231:9:
assertion `left == right` failed: the oversample did not keep everything
  left: 1
 right: 200

failures:
    a_higher_rung_never_returns_a_worse_top_k
    int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung
    the_exact_rung_reproduces_brute_force_on_what_it_is_given
    the_ladder_narrows_and_never_widens

test result: FAILED. 2 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.42s

*** result: Failure(101)
