*** crates/pstore-index/src/ladder.rs:47:36: replace * with / in Ladder::keep

*** mutation diff:
--- crates/pstore-index/src/ladder.rs
+++ replace * with / in Ladder::keep
@@ -39,17 +39,17 @@
 
     /// How many candidates `rung` keeps.
     ///
     /// Strictly narrowing, because a rung that hands on as many as it received is a rescan
     /// at higher cost rather than a rerank.
     #[must_use]
     pub fn keep(&self, rung: Rung) -> usize {
         match rung {
-            Rung::OneBit => self.k * self.oversample,
+            Rung::OneBit => self.k / /* ~ changed by cargo-mutants ~ */ self.oversample,
             // A fixed 2x, so the last rung's fetch is small enough to be worth its round
             // trip: at k=10 that is 20 vectors, tens of kilobytes.
             Rung::Int8 => self.k * 2,
             Rung::Exact => self.k,
         }
     }
 
     fn top(&self, mut scored: Vec<(usize, f32)>, keep: usize) -> Vec<(usize, f32)> {

---- the_ladder_narrows_and_never_widens stdout ----

thread 'the_ladder_narrows_and_never_widens' panicked at crates/pstore-index/tests/ladder.rs:107:5:
assertion `left == right` failed
  left: 1
 right: 80

---- int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung stdout ----

thread 'int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung' panicked at crates/pstore-index/tests/ladder.rs:231:9:
assertion `left == right` failed: the oversample did not keep everything
  left: 0
 right: 200

---- a_higher_rung_never_returns_a_worse_top_k stdout ----

thread 'a_higher_rung_never_returns_a_worse_top_k' panicked at crates/pstore-index/tests/ladder.rs:166:5:
recall@10 through the full ladder was 8%, under the 90% floor

failures:
    a_higher_rung_never_returns_a_worse_top_k
    int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung
    the_ladder_narrows_and_never_widens

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.41s

*** result: Failure(101)
