*** crates/pstore-index/src/ladder.rs:50:34: replace * with / in Ladder::keep

*** mutation diff:
--- crates/pstore-index/src/ladder.rs
+++ replace * with / in Ladder::keep
@@ -42,17 +42,17 @@
     /// Strictly narrowing, because a rung that hands on as many as it received is a rescan
     /// at higher cost rather than a rerank.
     #[must_use]
     pub fn keep(&self, rung: Rung) -> usize {
         match rung {
             Rung::OneBit => self.k * self.oversample,
             // A fixed 2x, so the last rung's fetch is small enough to be worth its round
             // trip: at k=10 that is 20 vectors, tens of kilobytes.
-            Rung::Int8 => self.k * 2,
+            Rung::Int8 => self.k / /* ~ changed by cargo-mutants ~ */ 2,
             Rung::Exact => self.k,
         }
     }
 
     fn top(&self, mut scored: Vec<(usize, f32)>, keep: usize) -> Vec<(usize, f32)> {
         // Descending by score; ties broken by id so a result set is reproducible, which is
         // what lets a recall number be compared across runs at all.
         scored.sort_by(|a, b| b.1.total_cmp(&a.1).then_with(|| a.0.cmp(&b.0)));

---- the_ladder_narrows_and_never_widens stdout ----

thread 'the_ladder_narrows_and_never_widens' panicked at crates/pstore-index/tests/ladder.rs:108:5:
assertion `left == right` failed
  left: 5
 right: 20

---- int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung stdout ----

thread 'int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung' panicked at crates/pstore-index/tests/ladder.rs:239:9:
assertion `left == right` failed: exact rerank disagreed with brute force
  left: [115, 22, 61, 110, 38]
 right: [115, 22, 61, 110, 38, 116, 94, 139, 19, 37]

---- a_higher_rung_never_returns_a_worse_top_k stdout ----

thread 'a_higher_rung_never_returns_a_worse_top_k' panicked at crates/pstore-index/tests/ladder.rs:166:5:
recall@10 through the full ladder was 50%, under the 90% floor

failures:
    a_higher_rung_never_returns_a_worse_top_k
    int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung
    the_ladder_narrows_and_never_widens

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.39s

*** result: Failure(101)
