*** crates/pstore-index/src/ladder.rs:84:9: replace Ladder::rung2 -> Vec<(usize, f32)> with vec![(0, -1.0)]

*** mutation diff:
--- crates/pstore-index/src/ladder.rs
+++ replace Ladder::rung2 -> Vec<(usize, f32)> with vec![(0, -1.0)]
@@ -76,12 +76,11 @@
     }
 
     /// Re-scores rung 1's survivors exactly.
     pub fn rung2<F: FnMut(usize) -> f32>(
         &self,
         candidates: &[(usize, f32)],
         mut score: F,
     ) -> Vec<(usize, f32)> {
-        let rescored = candidates.iter().map(|(i, _)| (*i, score(*i))).collect();
-        self.top(rescored, self.keep(Rung::Exact))
+        vec![(0, -1.0)] /* ~ changed by cargo-mutants ~ */
     }
 }

---- the_exact_rung_reproduces_brute_force_on_what_it_is_given stdout ----

thread 'the_exact_rung_reproduces_brute_force_on_what_it_is_given' panicked at crates/pstore-index/tests/ladder.rs:197:9:
assertion `left == right` failed: the exact rung disagreed with brute force
  left: [0]
 right: [4, 109, 61, 64, 163, 150, 11, 12, 81, 3]

---- int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung stdout ----

thread 'int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung' panicked at crates/pstore-index/tests/ladder.rs:239:9:
assertion `left == right` failed: exact rerank disagreed with brute force
  left: [0]
 right: [115, 22, 61, 110, 38, 116, 94, 139, 19, 37]

---- a_higher_rung_never_returns_a_worse_top_k stdout ----

thread 'a_higher_rung_never_returns_a_worse_top_k' panicked at crates/pstore-index/tests/ladder.rs:160:5:
exact rerank lost ground: 0 vs 379

failures:
    a_higher_rung_never_returns_a_worse_top_k
    int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung
    the_exact_rung_reproduces_brute_force_on_what_it_is_given

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.40s

*** result: Failure(101)
