*** crates/pstore-index/src/rabitq.rs:127:9: replace Code::bits -> &[u8] with Vec::leak(vec![0])

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace Code::bits -> &[u8] with Vec::leak(vec![0])
@@ -119,17 +119,17 @@
 
 impl Code {
     /// The packed sign bits, one per **padded** dimension.
     ///
     /// `padded` is the dimension rounded up to a power of two — see the module docs for why
     /// it is not `dim`, and what it costs.
     #[must_use]
     pub fn bits(&self) -> &[u8] {
-        &self.bits
+        Vec::leak(vec![0]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// `<x̄, x>`, the alignment between the code and the vector it came from.
     #[must_use]
     pub fn alignment(&self) -> f32 {
         self.alignment
     }

---- encoding_is_stable_across_dimensions stdout ----

thread 'encoding_is_stable_across_dimensions' panicked at crates/pstore-index/tests/rabitq.rs:107:9:
assertion `left == right` failed: dim 16
  left: 1
 right: 2

failures:
    encoding_is_stable_across_dimensions

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.19s

*** result: Failure(101)
