*** crates/pstore-index/src/rabitq.rs:133:9: replace Code::alignment -> f32 with 1.0

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace Code::alignment -> f32 with 1.0
@@ -125,17 +125,17 @@
     #[must_use]
     pub fn bits(&self) -> &[u8] {
         &self.bits
     }
 
     /// `<x̄, x>`, the alignment between the code and the vector it came from.
     #[must_use]
     pub fn alignment(&self) -> f32 {
-        self.alignment
+        1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// `||o - c||`.
     #[must_use]
     pub fn residual_norm(&self) -> f32 {
         self.residual_norm
     }

*** result: Success
