*** crates/pstore-index/src/rabitq.rs:139:9: replace Code::residual_norm -> f32 with -1.0

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace Code::residual_norm -> f32 with -1.0
@@ -131,17 +131,17 @@
     #[must_use]
     pub fn alignment(&self) -> f32 {
         self.alignment
     }
 
     /// `||o - c||`.
     #[must_use]
     pub fn residual_norm(&self) -> f32 {
-        self.residual_norm
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Appends this code's wire form: sign bits, then the alignment.
     ///
     /// ⚠️ The alignment travels **with** the bits. It is measured per vector at encode time
     /// and the estimate is meaningless without it, so a section holding bits alone would be
     /// a section of unusable codes — and would look fine, because the bits would decode.
     /// Four bytes a vector, which is why the 1-bit tier is 22x smaller than float32 rather

*** result: Success
