*** crates/pstore-index/src/rabitq.rs:194:33: replace + with * in Quantizer::code_len

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace + with * in Quantizer::code_len
@@ -186,17 +186,17 @@
             })
             .collect();
         Self { dim, padded, flips }
     }
 
     /// Bytes one code occupies on the wire: sign bits plus the alignment.
     #[must_use]
     pub fn code_len(&self) -> usize {
-        self.padded.div_ceil(8) + 8
+        self.padded.div_ceil(8) * /* ~ changed by cargo-mutants ~ */ 8
     }
 
     /// Reads a code back from [`Code::write_to`]'s form.
     ///
     /// Returns `None` for a wrong-length record rather than decoding a shifted one: a
     /// fixed-width section read at the wrong stride yields plausible bits and silently wrong
     /// answers, which is the failure this shape exists to make impossible.
     #[must_use]

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at crates/pstore-index/tests/persisted.rs:276:5:
assertion `left == right` failed: rung 0 read int8 bytes
  left: 29856
 right: 0

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:417:5:
exact rerank found only 43 of 50

failures:
    a_rung_zero_query_reads_no_int8_or_float_bytes
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.26s

*** result: Failure(101)
