*** crates/pstore-index/src/rabitq.rs:224:9: replace Quantizer::check -> Result<(), QuantError> with Ok(())

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace Quantizer::check -> Result<(), QuantError> with Ok(())
@@ -216,24 +216,17 @@
 
     /// The dimension this quantizer encodes.
     #[must_use]
     pub fn dim(&self) -> usize {
         self.dim
     }
 
     fn check(&self, v: &[f32]) -> Result<(), QuantError> {
-        if v.len() == self.dim {
-            Ok(())
-        } else {
-            Err(QuantError::Dimension {
-                expected: self.dim,
-                got: v.len(),
-            })
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Pads, flips signs, and applies the Walsh–Hadamard transform.
     ///
     /// Orthogonal up to the `1/sqrt(padded)` scaling applied at the end, so inner products
     /// are preserved — which is what lets the estimate be compared against the original
     /// vectors' inner product at all.
     fn rotate(&self, v: &[f32]) -> Vec<f32> {

---- a_dimension_mismatch_is_an_error_not_a_wrong_answer stdout ----

thread 'a_dimension_mismatch_is_an_error_not_a_wrong_answer' panicked at crates/pstore-index/tests/rabitq.rs:260:5:
assertion failed: q.encode(&[0.0; 8]).is_err()

failures:
    a_dimension_mismatch_is_an_error_not_a_wrong_answer

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.25s

*** result: Failure(101)
