*** crates/pstore-index/src/rabitq.rs:242:23: replace * with + in Quantizer::rotate

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace * with + in Quantizer::rotate
@@ -234,17 +234,17 @@
     /// Pads, flips signs, and applies the Walsh–Hadamard transform.
     ///
     /// Orthogonal up to the `1/sqrt(padded)` scaling applied at the end, so inner products
     /// are preserved — which is what lets the estimate be compared against the original
     /// vectors' inner product at all.
     fn rotate(&self, v: &[f32]) -> Vec<f32> {
         let mut a = vec![0.0f32; self.padded];
         for ((slot, x), flip) in a.iter_mut().zip(v).zip(&self.flips) {
-            *slot = x * flip;
+            *slot = x + /* ~ changed by cargo-mutants ~ */ flip;
         }
         let mut h = 1;
         while h < self.padded {
             for chunk in a.chunks_mut(h * 2) {
                 let (lo, hi) = chunk.split_at_mut(h);
                 for (x, y) in lo.iter_mut().zip(hi.iter_mut()) {
                     let (u, w) = (*x, *y);
                     *x = u + w;

---- a_higher_rung_never_returns_a_worse_top_k stdout ----

thread 'a_higher_rung_never_returns_a_worse_top_k' panicked at crates/pstore-index/tests/ladder.rs:166:5:
recall@10 through the full ladder was 20%, under the 90% floor

failures:
    a_higher_rung_never_returns_a_worse_top_k

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.44s

*** result: Failure(101)
