*** crates/pstore-index/src/rabitq.rs:254:15: replace *= with += in Quantizer::rotate

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace *= with += in Quantizer::rotate
@@ -246,17 +246,17 @@
             for chunk in a.chunks_mut(h * 2) {
                 let (lo, hi) = chunk.split_at_mut(h);
                 for (x, y) in lo.iter_mut().zip(hi.iter_mut()) {
                     let (u, w) = (*x, *y);
                     *x = u + w;
                     *y = u - w;
                 }
             }
-            h *= 2;
+            h += /* ~ changed by cargo-mutants ~ */ 2;
         }
         let scale = 1.0 / (self.padded as f32).sqrt();
         for x in a.iter_mut() {
             *x *= scale;
         }
         a
     }

---- int8_rerank_beats_one_bit_on_the_same_pairs stdout ----

thread 'int8_rerank_beats_one_bit_on_the_same_pairs' panicked at crates/pstore-index/src/rabitq.rs:247:38:
mid > len

---- int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung stdout ----

thread 'int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung' panicked at crates/pstore-index/src/rabitq.rs:247:38:
mid > len

---- a_higher_rung_never_returns_a_worse_top_k stdout ----

thread 'a_higher_rung_never_returns_a_worse_top_k' panicked at crates/pstore-index/src/rabitq.rs:247:38:
mid > len

failures:
    a_higher_rung_never_returns_a_worse_top_k
    int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung
    int8_rerank_beats_one_bit_on_the_same_pairs

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
