*** crates/pstore-index/src/rabitq.rs:275:46: replace * with / in Quantizer::encode_residual

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace * with / in Quantizer::encode_residual
@@ -267,17 +267,17 @@
     /// the 1-bit code can see.
     pub fn encode_residual(&self, v: &[f32], centroid: &[f32]) -> Result<Code, QuantError> {
         self.check(v)?;
         let residual: Vec<f32> = v
             .iter()
             .enumerate()
             .map(|(i, x)| x - centroid.get(i).copied().unwrap_or(0.0))
             .collect();
-        let norm = residual.iter().map(|x| x * x).sum::<f32>().sqrt();
+        let norm = residual.iter().map(|x| x / /* ~ changed by cargo-mutants ~ */ x).sum::<f32>().sqrt();
         // A vector sitting exactly on its centroid has no direction to quantize. Its
         // reconstruction is `<c,q>` with a zero scale, which is exactly right.
         let unit: Vec<f32> = if norm > 0.0 {
             residual.iter().map(|x| x / norm).collect()
         } else {
             residual
         };
         let mut code = self.encode_unit(&unit)?;

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:417:5:
exact rerank found only 40 of 50

failures:
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.62s

*** result: Failure(101)
