*** crates/pstore-index/src/rabitq.rs:305:34: replace % with + in Quantizer::encode_unit

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace % with + in Quantizer::encode_unit
@@ -297,17 +297,17 @@
         // `<x̄, x>` where `x̄ = sign(x)/sqrt(padded)`, which is `||x||₁ / sqrt(padded)`.
         // Computed from the rotated vector, over the padded length, because that is the
         // space the estimate lives in.
         let l1: f32 = r.iter().map(|x| x.abs()).sum();
         for (i, x) in r.iter().enumerate() {
             if *x > 0.0
                 && let Some(byte) = bits.get_mut(i / 8)
             {
-                *byte |= 1 << (i % 8);
+                *byte |= 1 << (i + /* ~ changed by cargo-mutants ~ */ 8);
             }
         }
         Ok(Code {
             bits,
             alignment: l1 / (self.padded as f32).sqrt(),
             // Overwritten by `encode_residual`; 1.0 means "the vector is its own residual",
             // which is what makes `encode` and `encode_residual` agree for a zero centroid.
             residual_norm: 1.0,

---- int8_rerank_beats_one_bit_on_the_same_pairs stdout ----

thread 'int8_rerank_beats_one_bit_on_the_same_pairs' panicked at crates/pstore-index/src/rabitq.rs:305:26:
attempt to shift left with overflow

---- int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung stdout ----

thread 'int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung' panicked at crates/pstore-index/src/rabitq.rs:305:26:
attempt to shift left with overflow

---- a_higher_rung_never_returns_a_worse_top_k stdout ----

thread 'a_higher_rung_never_returns_a_worse_top_k' panicked at crates/pstore-index/src/rabitq.rs:305:26:
attempt to shift left with overflow

failures:
    a_higher_rung_never_returns_a_worse_top_k
    int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung
    int8_rerank_beats_one_bit_on_the_same_pairs

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
