*** crates/pstore-index/src/rabitq.rs:320:9: replace Quantizer::raw -> f32 with 0.0

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace Quantizer::raw -> f32 with 0.0
@@ -312,26 +312,17 @@
             // which is what makes `encode` and `encode_residual` agree for a zero centroid.
             residual_norm: 1.0,
             dim: self.dim,
         })
     }
 
     /// `<x̄, q>` — the raw, **biased** inner product of the code with a rotated query.
     fn raw(&self, code: &Code, rotated_query: &[f32]) -> f32 {
-        let scale = 1.0 / (self.padded as f32).sqrt();
-        let mut acc = 0.0f32;
-        for (i, q) in rotated_query.iter().enumerate() {
-            let bit = code
-                .bits
-                .get(i / 8)
-                .is_some_and(|b| b & (1 << (i % 8)) != 0);
-            acc += if bit { *q } else { -*q };
-        }
-        acc * scale
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Rotates a query once, for scoring against many codes.
     ///
     /// ⚠️ The asymmetry D-11 buys accuracy from: the query is transformed **once per
     /// query**, not once per vector, so work spent on it is amortised across every code in
     /// every probed posting list. Rotating inside `estimate` would put an `O(D log D)`
     /// transform on the inner loop of a scan over thousands of vectors.

---- a_higher_rung_never_returns_a_worse_top_k stdout ----

thread 'a_higher_rung_never_returns_a_worse_top_k' panicked at crates/pstore-index/tests/ladder.rs:166:5:
recall@10 through the full ladder was 18%, under the 90% floor

failures:
    a_higher_rung_never_returns_a_worse_top_k

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.37s

*** result: Failure(101)
