*** crates/pstore-index/src/rabitq.rs:329:13: replace * with + in Quantizer::raw

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace * with + in Quantizer::raw
@@ -321,17 +321,17 @@
         let mut acc = 0.0f32;
         for (i, q) in rotated_query.iter().enumerate() {
             let bit = code
                 .bits
                 .get(i / 8)
                 .is_some_and(|b| b & (1 << (i % 8)) != 0);
             acc += if bit { *q } else { -*q };
         }
-        acc * scale
+        acc + /* ~ changed by cargo-mutants ~ */ scale
     }
 
     /// Rotates a query once, for scoring against many codes.
     ///
     /// ⚠️ The asymmetry D-11 buys accuracy from: the query is transformed **once per
     /// query**, not once per vector, so work spent on it is amortised across every code in
     /// every probed posting list. Rotating inside `estimate` would put an `O(D log D)`
     /// transform on the inner loop of a scan over thousands of vectors.

---- the_measured_failure_rate_is_below_delta stdout ----

thread 'the_measured_failure_rate_is_below_delta' panicked at crates/pstore-index/tests/rabitq.rs:157:5:
the error bound was breached 4921 times in 5000 pairs (rate 0.98420, delta 1e-3, epsilon 3.9); either the estimator is wrong or RaBitQ's published guarantee does not hold as implemented

failures:
    the_measured_failure_rate_is_below_delta

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.92s

*** result: Failure(101)
