*** crates/pstore-index/src/rabitq.rs:358:34: replace / with * in Quantizer::estimate_prepared

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace / with * in Quantizer::estimate_prepared
@@ -350,17 +350,17 @@
         centroid_dot + code.residual_norm * self.estimate_prepared(code, query)
     }
 
     /// Estimates `<o, q>` from `o`'s code and a prepared query.
     #[must_use]
     pub fn estimate_prepared(&self, code: &Code, query: &Query) -> f32 {
         // ⚠️ The division is the whole construction. `<x̄, q>` is biased low by exactly the
         // factor `<x̄, x>`, which the encoder measured; dividing removes it.
-        self.raw(code, &query.0) / code.alignment
+        self.raw(code, &query.0) * /* ~ changed by cargo-mutants ~ */ code.alignment
     }
 
     /// Estimates `<o, q>` from `o`'s code and a unit query.
     pub fn estimate(&self, code: &Code, query: &[f32]) -> Result<f32, QuantError> {
         Ok(self.estimate_prepared(code, &self.prepare(query)?))
     }
 
     /// The same estimate **without** the normalisation, so a test can show the bound is

---- the_measured_failure_rate_is_below_delta stdout ----

thread 'the_measured_failure_rate_is_below_delta' panicked at crates/pstore-index/tests/rabitq.rs:157:5:
the error bound was breached 3073 times in 5000 pairs (rate 0.61460, delta 1e-3, epsilon 3.9); either the estimator is wrong or RaBitQ's published guarantee does not hold as implemented

failures:
    the_measured_failure_rate_is_below_delta

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.91s

*** result: Failure(101)
