*** crates/pstore-index/src/rabitq.rs:381:37: replace - with + in Quantizer::error_bound

*** mutation diff:
--- crates/pstore-index/src/rabitq.rs
+++ replace - with + in Quantizer::error_bound
@@ -373,12 +373,12 @@
     /// The error bound for this code, at [`BOUND_EPSILON`].
     ///
     /// Widens as the code's alignment falls: a vector the sign pattern represents poorly is
     /// one the estimate is allowed to be more wrong about. That dependence is why the bound
     /// is a function of the code rather than a constant.
     #[must_use]
     pub fn error_bound(&self, code: &Code) -> f32 {
         let a = code.alignment.max(f32::EPSILON);
-        let d = (self.padded.max(2) - 1) as f32;
+        let d = (self.padded.max(2) + /* ~ changed by cargo-mutants ~ */ 1) as f32;
         BOUND_EPSILON * ((1.0 - a * a).max(0.0) / d).sqrt() / a
     }
 }

*** result: Success
