*** crates/pstore-index/src/search.rs:19:5: replace probe -> Vec<usize> with vec![]

*** mutation diff:
--- crates/pstore-index/src/search.rs
+++ replace probe -> Vec<usize> with vec![]
@@ -11,26 +11,17 @@
 
 /// Which lists a query should read.
 ///
 /// `p` is free in **depth** and costs **bytes**: 64 lists is the same one round trip as 8,
 /// and eight times the transfer. That asymmetry is the lever a memory-resident index does
 /// not have, and it is why `p` is the recall knob rather than a graph traversal depth.
 #[must_use]
 pub fn probe(clustering: &Clustering, query: &[f32], p: usize) -> Vec<usize> {
-    let mut d: Vec<(usize, f32)> = clustering
-        .centroids()
-        .iter()
-        .enumerate()
-        .map(|(i, c)| (i, dist2(query, c)))
-        .collect();
-    // Ties by index so a probe set is reproducible; recall is compared across runs.
-    d.sort_by(|a, b| a.1.total_cmp(&b.1).then_with(|| a.0.cmp(&b.0)));
-    d.truncate(p.max(1));
-    d.into_iter().map(|(i, _)| i).collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Which lists a query should read, dropping those too far to contribute.
 ///
 /// ⚠️ Query-aware pruning: a query sitting **on** a centroid has one obviously-right list
 /// and the rest are noise, while a query equidistant between several genuinely needs them
 /// all. Probing a fixed `p` either over-fetches for the easy query or under-fetches for the
 /// hard one. `slack` is how much further than the nearest centroid a list may be and still

---- exact_rerank_costs_exactly_one_more_round stdout ----

thread 'exact_rerank_costs_exactly_one_more_round' panicked at crates/pstore-index/tests/persisted.rs:151:5:
assertion `left == right` failed: exact took 1 rounds
  left: 1
 right: 2

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:118:9:
assertion `left == right` failed
  left: 0
 right: 10

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at crates/pstore-index/tests/persisted.rs:277:5:
assertion failed: s.bytes_in(&key, idx.segment().section(Section::RaBitQ).unwrap()) > 0

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    a_rung_zero_query_reads_no_int8_or_float_bytes
    exact_rerank_costs_exactly_one_more_round
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.08s

*** result: Failure(101)
