*** crates/pstore-index/src/search.rs:50:32: replace + with * in probe_pruned

*** mutation diff:
--- crates/pstore-index/src/search.rs
+++ replace + with * in probe_pruned
@@ -42,17 +42,17 @@
         .first()
         .and_then(|i| clustering.centroids().get(*i))
         .map(|c| dist2(query, c).sqrt())
     else {
         return chosen;
     };
     // True distance, not squared: `slack` is a fraction of a distance, and applying it to a
     // squared value makes the threshold quietly dimension-dependent.
-    let limit = nearest * (1.0 + slack);
+    let limit = nearest * (1.0 * /* ~ changed by cargo-mutants ~ */ slack);
     let kept: Vec<usize> = chosen
         .iter()
         .copied()
         .filter(|i| {
             clustering
                 .centroids()
                 .get(*i)
                 .is_some_and(|c| dist2(query, c).sqrt() <= limit)

*** result: Success
