*** crates/pstore-index/src/search.rs:72:5: replace candidates -> Vec<usize> with vec![0]

*** mutation diff:
--- crates/pstore-index/src/search.rs
+++ replace candidates -> Vec<usize> with vec![0]
@@ -64,22 +64,14 @@
 }
 
 /// Every row reachable through `lists`, deduplicated.
 ///
 /// Boundary replication means a row can appear in several probed lists; scoring it twice
 /// would let one vector occupy two slots of a top-k.
 #[must_use]
 pub fn candidates(clustering: &Clustering, lists: &[usize]) -> Vec<usize> {
-    let mut out: Vec<usize> = lists
-        .iter()
-        .filter_map(|i| clustering.lists().get(*i))
-        .flatten()
-        .copied()
-        .collect();
-    out.sort_unstable();
-    out.dedup();
-    out
+    vec![0] /* ~ changed by cargo-mutants ~ */
 }
 
 fn dist2(a: &[f32], b: &[f32]) -> f32 {
     a.iter().zip(b).map(|(x, y)| (x - y) * (x - y)).sum()
 }

---- probing_every_list_reaches_every_candidate stdout ----

thread 'probing_every_list_reaches_every_candidate' panicked at crates/pstore-index/tests/recall.rs:59:5:
assertion `left == right` failed: some rows are in no list at all
  left: 1
 right: 2000

---- the_clustered_index_meets_the_recall_floor stdout ----

thread 'the_clustered_index_meets_the_recall_floor' panicked at crates/pstore-index/tests/recall.rs:37:5:
recall@10 was 0.000 on 4,000 x 128d clustered synthetic at p=16, oversample=32

---- more_probes_never_lose_recall stdout ----

thread 'more_probes_never_lose_recall' panicked at crates/pstore-index/tests/recall.rs:114:5:
recall at p=32 was only 0.002

failures:
    augmentation_lifts_recall_by_five_points_at_p_two
    more_probes_never_lose_recall
    probing_every_list_reaches_every_candidate
    the_clustered_index_meets_the_recall_floor

test result: FAILED. 2 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 9.86s

*** result: Failure(101)
