*** crates/pstore-index/src/search.rs:84:42: replace * with + in dist2

*** mutation diff:
--- crates/pstore-index/src/search.rs
+++ replace * with + in dist2
@@ -76,10 +76,10 @@
         .copied()
         .collect();
     out.sort_unstable();
     out.dedup();
     out
 }
 
 fn dist2(a: &[f32], b: &[f32]) -> f32 {
-    a.iter().zip(b).map(|(x, y)| (x - y) * (x - y)).sum()
+    a.iter().zip(b).map(|(x, y)| (x - y) + /* ~ changed by cargo-mutants ~ */ (x - y)).sum()
 }

---- an_easy_query_prunes_more_than_a_hard_one stdout ----

thread 'an_easy_query_prunes_more_than_a_hard_one' panicked at crates/pstore-index/tests/recall.rs:137:5:
pruning kept 16 lists for a query on a centroid and 16 for one between two: it is not query-aware

---- the_clustered_index_meets_the_recall_floor stdout ----

thread 'the_clustered_index_meets_the_recall_floor' panicked at crates/pstore-index/tests/recall.rs:37:5:
recall@10 was 0.788 on 4,000 x 128d clustered synthetic at p=16, oversample=32

---- augmentation_lifts_recall_by_five_points_at_p_two stdout ----

thread 'augmentation_lifts_recall_by_five_points_at_p_two' panicked at crates/pstore-index/tests/recall.rs:89:5:
augmentation moved recall@10 at p=2 from 0.097 to 0.118, under the 5-point floor: it is costing index size and buying nothing

failures:
    an_easy_query_prunes_more_than_a_hard_one
    augmentation_lifts_recall_by_five_points_at_p_two
    the_clustered_index_meets_the_recall_floor

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.51s

*** result: Failure(101)
