*** crates/pstore-index/src/sq8.rs:112:15: replace += with -= in estimate_raw

*** mutation diff:
--- crates/pstore-index/src/sq8.rs
+++ replace += with -= in estimate_raw
@@ -104,17 +104,17 @@
         tail.get(at..at + 4)
             .and_then(|b| b.try_into().ok())
             .map_or(0.0, f32::from_le_bytes)
     };
     let (offset, step) = (f(0), f(4));
     let mut sum_q = 0.0f32;
     let mut acc = 0.0f32;
     for (b, q) in codes.iter().zip(query) {
-        sum_q += *q;
+        sum_q -= /* ~ changed by cargo-mutants ~ */ *q;
         acc += f32::from(*b) * *q;
     }
     offset * sum_q + step * acc
 }
 
 /// Estimates `<o, q>` from `o`'s code.
 ///
 /// Expanded rather than reconstructing first: `<o,q> ≈ offset·Σq + step·Σ(c·q)`, which is

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:404:5:
`fast` found 21 of the true neighbours against `none`'s 26: the int8 rung is costing a section of every segment and buying nothing

failures:
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.26s

*** result: Failure(101)
