*** crates/pstore-index/src/sq8.rs:25:9: replace Code::codes -> &[u8] with Vec::leak(vec![1])

*** mutation diff:
--- crates/pstore-index/src/sq8.rs
+++ replace Code::codes -> &[u8] with Vec::leak(vec![1])
@@ -17,17 +17,17 @@
     /// Value per code step.
     step: f32,
 }
 
 impl Code {
     /// The packed codes, one byte per dimension.
     #[must_use]
     pub fn codes(&self) -> &[u8] {
-        &self.codes
+        Vec::leak(vec![1]) /* ~ changed by cargo-mutants ~ */
     }
 
     /// The reconstruction step: no coordinate is further than this from its original.
     #[must_use]
     pub fn step(&self) -> f32 {
         self.step
     }
 }

*** result: Success
