*** crates/pstore-index/src/sq8.rs:31:9: replace Code::step -> f32 with 0.0

*** mutation diff:
--- crates/pstore-index/src/sq8.rs
+++ replace Code::step -> f32 with 0.0
@@ -23,17 +23,17 @@
     #[must_use]
     pub fn codes(&self) -> &[u8] {
         &self.codes
     }
 
     /// The reconstruction step: no coordinate is further than this from its original.
     #[must_use]
     pub fn step(&self) -> f32 {
-        self.step
+        0.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Quantizes a vector to one byte per dimension.
 #[must_use]
 pub fn encode(v: &[f32]) -> Code {
     let lo = v.iter().copied().fold(f32::INFINITY, f32::min);
     let hi = v.iter().copied().fold(f32::NEG_INFINITY, f32::max);

---- int8_reconstructs_within_one_quantisation_step stdout ----

thread 'int8_reconstructs_within_one_quantisation_step' panicked at crates/pstore-index/tests/ladder.rs:70:13:
reconstructed 0.066526785 from 0.06637985, step 0: further than half a step, so the codes are truncated rather than rounded

failures:
    int8_reconstructs_within_one_quantisation_step

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.48s

*** result: Failure(101)
