*** crates/pstore-index/src/sq8.rs:47:21: replace > with < in encode

*** mutation diff:
--- crates/pstore-index/src/sq8.rs
+++ replace > with < in encode
@@ -39,17 +39,17 @@
     let hi = v.iter().copied().fold(f32::NEG_INFINITY, f32::max);
     // A constant vector has no range; a zero step reconstructs it exactly, and dividing by
     // it is the only thing that could go wrong, so it is handled here rather than guarded
     // at every use.
     let step = if hi > lo { (hi - lo) / 255.0 } else { 0.0 };
     let codes = v
         .iter()
         .map(|x| {
-            if step > 0.0 {
+            if step < /* ~ changed by cargo-mutants ~ */ 0.0 {
                 // ⚠️ `round`, not truncate. Truncation shifts every coordinate down by
                 // about half a step, so the reconstructed vector is displaced by a constant
                 // offset in every dimension at once rather than scattered around the
                 // original. Against a zero-mean query that mostly cancels in the inner
                 // product, which is why no accuracy test catches it -- only the
                 // reconstruction bound does.
                 (((x - lo) / step).round()).clamp(0.0, 255.0) as u8
             } else {

---- int8_reconstructs_within_one_quantisation_step stdout ----

thread 'int8_reconstructs_within_one_quantisation_step' panicked at crates/pstore-index/tests/ladder.rs:70:13:
reconstructed -0.14562207 from 0.06637985, step 0.0010935508: further than half a step, so the codes are truncated rather than rounded

---- int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung stdout ----

thread 'int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung' panicked at crates/pstore-index/tests/ladder.rs:239:9:
assertion `left == right` failed: exact rerank disagreed with brute force
  left: [38, 139, 15, 72, 58, 11, 119, 120, 153, 56]
 right: [115, 22, 61, 110, 38, 116, 94, 139, 19, 37]

---- a_higher_rung_never_returns_a_worse_top_k stdout ----

thread 'a_higher_rung_never_returns_a_worse_top_k' panicked at crates/pstore-index/tests/ladder.rs:159:5:
int8 rerank lost ground: 43 vs 183

failures:
    a_higher_rung_never_returns_a_worse_top_k
    int8_never_drops_a_true_neighbour_out_of_reach_of_the_exact_rung
    int8_reconstructs_within_one_quantisation_step
    int8_rerank_beats_one_bit_on_the_same_pairs

test result: FAILED. 2 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.43s

*** result: Failure(101)
