*** crates/pstore-index/src/sq8.rs:72:27: replace + with - in decode

*** mutation diff:
--- crates/pstore-index/src/sq8.rs
+++ replace + with - in decode
@@ -64,17 +64,17 @@
     }
 }
 
 /// Reconstructs the approximate vector.
 #[must_use]
 pub fn decode(c: &Code) -> Vec<f32> {
     c.codes
         .iter()
-        .map(|b| c.offset + f32::from(*b) * c.step)
+        .map(|b| c.offset - /* ~ changed by cargo-mutants ~ */ f32::from(*b) * c.step)
         .collect()
 }
 
 /// Bytes one row occupies on the wire: the codes, then the offset and step.
 #[must_use]
 pub fn record_len(dim: usize) -> usize {
     dim + 8
 }

---- int8_reconstructs_within_one_quantisation_step stdout ----

thread 'int8_reconstructs_within_one_quantisation_step' panicked at crates/pstore-index/tests/ladder.rs:70:13:
reconstructed -0.35777092 from 0.06637985, step 0.0010935508: further than half a step, so the codes are truncated rather than rounded

failures:
    int8_reconstructs_within_one_quantisation_step

test result: FAILED. 5 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.55s

*** result: Failure(101)
