*** crates/pstore-index/src/sq8.rs:91:5: replace write_to with ()

*** mutation diff:
--- crates/pstore-index/src/sq8.rs
+++ replace write_to with ()
@@ -83,19 +83,17 @@
 ///
 /// ⚠️ The scale travels **with** the codes, and it has to. The quantization is per vector —
 /// a global scale would be fitted state, which is per-tenant training under another name —
 /// so two rows' codes are on different scales and comparing them raw is comparing
 /// different units. Measured: reading the codes without their scale made `rerank: fast`
 /// *worse* than no rerank at all (25 true neighbours against 26), while every depth and
 /// byte assertion still passed.
 pub fn write_to(c: &Code, out: &mut Vec<u8>) {
-    out.extend_from_slice(&c.codes);
-    out.extend_from_slice(&c.offset.to_le_bytes());
-    out.extend_from_slice(&c.step.to_le_bytes());
+    () /* ~ changed by cargo-mutants ~ */
 }
 
 /// Estimates `<o, q>` from one row's wire form.
 #[must_use]
 pub fn estimate_raw(record: &[u8], query: &[f32]) -> f32 {
     let Some(split) = record.len().checked_sub(8) else {
         return f32::NEG_INFINITY;
     };

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at crates/pstore-index/tests/persisted.rs:256:54:
called `Option::unwrap()` on a `None` value

---- exact_rerank_costs_exactly_one_more_round stdout ----

thread 'exact_rerank_costs_exactly_one_more_round' panicked at crates/pstore-index/tests/persisted.rs:151:5:
assertion `left == right` failed: exact took 0 rounds
  left: 0
 right: 2

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:118:9:
assertion `left == right` failed
  left: 0
 right: 10

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    a_rung_zero_query_reads_no_int8_or_float_bytes
    exact_rerank_costs_exactly_one_more_round
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.82s

*** result: Failure(101)
