*** crates/pstore-index/src/vec_index.rs:201:16: replace > with == in build

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace > with == in build
@@ -193,17 +193,17 @@
                 }
             }
         }
     }
     let zero = vec![0.0f32; dim];
     for row in &order {
         let Some(d) = docs.get(*row) else { continue };
         w.push(d.clone());
-        if dim > 0 {
+        if dim == /* ~ changed by cargo-mutants ~ */ 0 {
             let cen = centroids
                 .as_ref()
                 .and_then(|c| c.vectors.get(*home.get(*row).unwrap_or(&usize::MAX)))
                 .unwrap_or(&zero);
             if let Ok(code) = quantizer.encode_residual(&d.vector, cen) {
                 code.write_to(&mut rabitq);
             }
             sq8::write_to(&sq8::encode(&d.vector), &mut eights);

---- exact_rerank_costs_exactly_one_more_round stdout ----

thread 'exact_rerank_costs_exactly_one_more_round' panicked at crates/pstore-index/tests/persisted.rs:151:5:
assertion `left == right` failed: exact took 0 rounds
  left: 0
 right: 2

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:118:9:
assertion `left == right` failed
  left: 0
 right: 10

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at crates/pstore-index/tests/persisted.rs:256:54:
called `Option::unwrap()` on a `None` value

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    a_rung_zero_query_reads_no_int8_or_float_bytes
    exact_rerank_costs_exactly_one_more_round
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.28s

*** result: Failure(101)
