*** crates/pstore-index/src/vec_index.rs:201:16: replace > with >= in build

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace > with >= in build
@@ -193,17 +193,17 @@
                 }
             }
         }
     }
     let zero = vec![0.0f32; dim];
     for row in &order {
         let Some(d) = docs.get(*row) else { continue };
         w.push(d.clone());
-        if dim > 0 {
+        if dim >= /* ~ changed by cargo-mutants ~ */ 0 {
             let cen = centroids
                 .as_ref()
                 .and_then(|c| c.vectors.get(*home.get(*row).unwrap_or(&usize::MAX)))
                 .unwrap_or(&zero);
             if let Ok(code) = quantizer.encode_residual(&d.vector, cen) {
                 code.write_to(&mut rabitq);
             }
             sq8::write_to(&sq8::encode(&d.vector), &mut eights);

*** result: Success
