*** crates/pstore-index/src/vec_index.rs:308:38: replace * with / in VecIndex::search

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace * with / in VecIndex::search
@@ -300,17 +300,17 @@
         let mut ranges = Vec::with_capacity(probes.len() * 2);
         let mut rows = Vec::with_capacity(probes.len());
         for li in &probes {
             let Some((first, len)) = centroids.spans.get(*li).copied() else {
                 continue;
             };
             let (first, len) = (first as u64, len as u64);
             ranges.push(
-                rabitq.start + first * code_len as u64
+                rabitq.start + first / /* ~ changed by cargo-mutants ~ */ code_len as u64
                     ..rabitq.start + (first + len) * code_len as u64,
             );
             rows.push((*li, first, len));
         }
         let want_sq8 = q.rerank != Rerank::None;
         if want_sq8 {
             let per = sq8::record_len(self.dim) as u64;
             for (_, first, len) in &rows {

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:417:5:
exact rerank found only 44 of 50

failures:
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.18s

*** result: Failure(101)
