*** crates/pstore-index/src/vec_index.rs:309:36: replace + with - in VecIndex::search

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace + with - in VecIndex::search
@@ -301,17 +301,17 @@
         let mut rows = Vec::with_capacity(probes.len());
         for li in &probes {
             let Some((first, len)) = centroids.spans.get(*li).copied() else {
                 continue;
             };
             let (first, len) = (first as u64, len as u64);
             ranges.push(
                 rabitq.start + first * code_len as u64
-                    ..rabitq.start + (first + len) * code_len as u64,
+                    ..rabitq.start - /* ~ changed by cargo-mutants ~ */ (first + len) * code_len as u64,
             );
             rows.push((*li, first, len));
         }
         let want_sq8 = q.rerank != Rerank::None;
         if want_sq8 {
             let per = sq8::record_len(self.dim) as u64;
             for (_, first, len) in &rows {
                 ranges.push(sq8_span.start + first * per..sq8_span.start + (first + len) * per);

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:118:9:
assertion `left == right` failed
  left: 0
 right: 10

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at crates/pstore-index/tests/persisted.rs:277:5:
assertion failed: s.bytes_in(&key, idx.segment().section(Section::RaBitQ).unwrap()) > 0

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:404:5:
`fast` found 0 of the true neighbours against `none`'s 0: the int8 rung is costing a section of every segment and buying nothing

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    a_rung_zero_query_reads_no_int8_or_float_bytes
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.42s

*** result: Failure(101)
