*** crates/pstore-index/src/vec_index.rs:309:45: replace + with * in VecIndex::search

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace + with * in VecIndex::search
@@ -301,17 +301,17 @@
         let mut rows = Vec::with_capacity(probes.len());
         for li in &probes {
             let Some((first, len)) = centroids.spans.get(*li).copied() else {
                 continue;
             };
             let (first, len) = (first as u64, len as u64);
             ranges.push(
                 rabitq.start + first * code_len as u64
-                    ..rabitq.start + (first + len) * code_len as u64,
+                    ..rabitq.start + (first * /* ~ changed by cargo-mutants ~ */ len) * code_len as u64,
             );
             rows.push((*li, first, len));
         }
         let want_sq8 = q.rerank != Rerank::None;
         if want_sq8 {
             let per = sq8::record_len(self.dim) as u64;
             for (_, first, len) in &rows {
                 ranges.push(sq8_span.start + first * per..sq8_span.start + (first + len) * per);

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at crates/pstore-index/tests/persisted.rs:269:6:
called `Result::unwrap()` on an `Err` value: Blob("range 167041..555425 outside object of 221683 bytes")

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:117:14:
called `Result::unwrap()` on an `Err` value: Blob("range 166888..558088 outside object of 220970 bytes")

---- exact_rerank_costs_exactly_one_more_round stdout ----

thread 'exact_rerank_costs_exactly_one_more_round' panicked at crates/pstore-index/tests/persisted.rs:150:6:
called `Result::unwrap()` on an `Err` value: Blob("range 162601..578601 outside object of 215275 bytes")

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    a_rung_zero_query_reads_no_int8_or_float_bytes
    exact_rerank_costs_exactly_one_more_round
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.30s

*** result: Failure(101)
