*** crates/pstore-index/src/vec_index.rs:317:83: replace + with * in VecIndex::search

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace + with * in VecIndex::search
@@ -309,17 +309,17 @@
                     ..rabitq.start + (first + len) * code_len as u64,
             );
             rows.push((*li, first, len));
         }
         let want_sq8 = q.rerank != Rerank::None;
         if want_sq8 {
             let per = sq8::record_len(self.dim) as u64;
             for (_, first, len) in &rows {
-                ranges.push(sq8_span.start + first * per..sq8_span.start + (first + len) * per);
+                ranges.push(sq8_span.start + first * per..sq8_span.start + (first * /* ~ changed by cargo-mutants ~ */ len) * per);
             }
         }
         let bufs = store.get_ranges(key, &ranges).await?;
 
         let Ok(prepared) = quantizer.prepare(query) else {
             return Err(pstore_format::FormatError::DimensionMismatch {
                 expected: self.dim,
                 got: query.len(),

---- exact_rerank_costs_exactly_one_more_round stdout ----

thread 'exact_rerank_costs_exactly_one_more_round' panicked at crates/pstore-index/tests/persisted.rs:150:6:
called `Result::unwrap()` on an `Err` value: Blob("range 161801..2047065 outside object of 215275 bytes")

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at crates/pstore-index/tests/persisted.rs:117:14:
called `Result::unwrap()` on an `Err` value: Blob("range 166088..1940008 outside object of 220970 bytes")

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:399:18:
called `Result::unwrap()` on an `Err` value: Blob("range 169027..1889843 outside object of 224877 bytes")

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    exact_rerank_costs_exactly_one_more_round
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 5 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.53s

*** result: Failure(101)
