*** crates/pstore-index/src/vec_index.rs:338:58: replace + with - in VecIndex::search

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace + with - in VecIndex::search
@@ -330,17 +330,17 @@
             .iter()
             .map(|(li, _, _)| centroids.vectors.get(*li).map_or(0.0, |c| dot(c, query)))
             .collect();
 
         let mut scored: Vec<(usize, f32)> = Vec::new();
         for (n, (_, first, len)) in rows.iter().enumerate() {
             let Some(buf) = bufs.get(n) else { continue };
             for i in 0..*len as usize {
-                let Some(raw) = buf.get(i * code_len..(i + 1) * code_len) else {
+                let Some(raw) = buf.get(i * code_len..(i - /* ~ changed by cargo-mutants ~ */ 1) * code_len) else {
                     continue;
                 };
                 let Some(code) = quantizer.read_code(raw) else {
                     continue;
                 };
                 let row = *first as usize + i;
                 scored.push((
                     row,

---- a_rung_zero_query_reads_no_int8_or_float_bytes stdout ----

thread 'a_rung_zero_query_reads_no_int8_or_float_bytes' panicked at /tmp/cargo-mutants-pstore-yddpDt.tmp/crates/pstore-index/src/vec_index.rs:338:55:
attempt to subtract with overflow

---- exact_rerank_costs_exactly_one_more_round stdout ----

thread 'exact_rerank_costs_exactly_one_more_round' panicked at /tmp/cargo-mutants-pstore-yddpDt.tmp/crates/pstore-index/src/vec_index.rs:338:55:
attempt to subtract with overflow

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at /tmp/cargo-mutants-pstore-yddpDt.tmp/crates/pstore-index/src/vec_index.rs:338:55:
attempt to subtract with overflow

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    a_rung_zero_query_reads_no_int8_or_float_bytes
    exact_rerank_costs_exactly_one_more_round
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 4 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.43s

*** result: Failure(101)
