*** crates/pstore-index/src/vec_index.rs:344:43: replace + with * in VecIndex::search

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace + with * in VecIndex::search
@@ -336,17 +336,17 @@
             let Some(buf) = bufs.get(n) else { continue };
             for i in 0..*len as usize {
                 let Some(raw) = buf.get(i * code_len..(i + 1) * code_len) else {
                     continue;
                 };
                 let Some(code) = quantizer.read_code(raw) else {
                     continue;
                 };
-                let row = *first as usize + i;
+                let row = *first as usize * /* ~ changed by cargo-mutants ~ */ i;
                 scored.push((
                     row,
                     quantizer.estimate_residual(
                         &code,
                         &prepared,
                         dots.get(n).copied().unwrap_or(0.0),
                     ),
                 ));

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:400:70:
index out of bounds: the len is 631 but the index is 4650

failures:
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.27s

*** result: Failure(101)
