*** crates/pstore-index/src/vec_index.rs:370:59: replace + with * in VecIndex::search

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace + with * in VecIndex::search
@@ -362,17 +362,17 @@
                 let refined = ladder.rung1(&top, |row| {
                     // Find the fetched sq8 buffer holding this row.
                     rows.iter()
                         .enumerate()
                         .find(|(_, (_, first, len))| {
                             row >= *first as usize && row < (*first + *len) as usize
                         })
                         .and_then(|(n, (_, first, _))| {
-                            let buf = bufs.get(rows.len() + n)?;
+                            let buf = bufs.get(rows.len() * /* ~ changed by cargo-mutants ~ */ n)?;
                             let i = row - *first as usize;
                             let raw = buf.get(i * per..(i + 1) * per)?;
                             Some(sq8::estimate_raw(raw, query))
                         })
                         .unwrap_or(f32::NEG_INFINITY)
                 });
                 refined.into_iter().take(q.k).collect()
             }

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at crates/pstore-index/tests/persisted.rs:404:5:
`fast` found 10 of the true neighbours against `none`'s 26: the int8 rung is costing a section of every segment and buying nothing

failures:
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.58s

*** result: Failure(101)
