*** crates/pstore-index/src/vec_index.rs:371:41: replace - with / in VecIndex::search

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace - with / in VecIndex::search
@@ -363,17 +363,17 @@
                     // Find the fetched sq8 buffer holding this row.
                     rows.iter()
                         .enumerate()
                         .find(|(_, (_, first, len))| {
                             row >= *first as usize && row < (*first + *len) as usize
                         })
                         .and_then(|(n, (_, first, _))| {
                             let buf = bufs.get(rows.len() + n)?;
-                            let i = row - *first as usize;
+                            let i = row / /* ~ changed by cargo-mutants ~ */ *first as usize;
                             let raw = buf.get(i * per..(i + 1) * per)?;
                             Some(sq8::estimate_raw(raw, query))
                         })
                         .unwrap_or(f32::NEG_INFINITY)
                 });
                 refined.into_iter().take(q.k).collect()
             }
             Rerank::Exact => {

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at /tmp/cargo-mutants-pstore-DJ9WhG.tmp/crates/pstore-index/src/vec_index.rs:371:37:
attempt to divide by zero

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at /tmp/cargo-mutants-pstore-DJ9WhG.tmp/crates/pstore-index/src/vec_index.rs:371:37:
attempt to divide by zero

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 7 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.18s

*** result: Failure(101)
