*** crates/pstore-index/src/vec_index.rs:372:59: replace + with - in VecIndex::search

*** mutation diff:
--- crates/pstore-index/src/vec_index.rs
+++ replace + with - in VecIndex::search
@@ -364,17 +364,17 @@
                     rows.iter()
                         .enumerate()
                         .find(|(_, (_, first, len))| {
                             row >= *first as usize && row < (*first + *len) as usize
                         })
                         .and_then(|(n, (_, first, _))| {
                             let buf = bufs.get(rows.len() + n)?;
                             let i = row - *first as usize;
-                            let raw = buf.get(i * per..(i + 1) * per)?;
+                            let raw = buf.get(i * per..(i - /* ~ changed by cargo-mutants ~ */ 1) * per)?;
                             Some(sq8::estimate_raw(raw, query))
                         })
                         .unwrap_or(f32::NEG_INFINITY)
                 });
                 refined.into_iter().take(q.k).collect()
             }
             Rerank::Exact => {
                 // The fourth round trip, and only here: which float32 rows to read cannot

---- a_clustered_query_costs_two_round_trips_beyond_head stdout ----

thread 'a_clustered_query_costs_two_round_trips_beyond_head' panicked at /tmp/cargo-mutants-pstore-yddpDt.tmp/crates/pstore-index/src/vec_index.rs:372:56:
attempt to subtract with overflow

---- the_rerank_knob_buys_recall_and_not_only_bytes stdout ----

thread 'the_rerank_knob_buys_recall_and_not_only_bytes' panicked at /tmp/cargo-mutants-pstore-yddpDt.tmp/crates/pstore-index/src/vec_index.rs:372:56:
attempt to subtract with overflow

---- probing_more_lists_costs_bytes_not_depth stdout ----

thread 'probing_more_lists_costs_bytes_not_depth' panicked at /tmp/cargo-mutants-pstore-yddpDt.tmp/crates/pstore-index/src/vec_index.rs:372:56:
attempt to subtract with overflow

failures:
    a_clustered_query_costs_two_round_trips_beyond_head
    probing_more_lists_costs_bytes_not_depth
    the_rerank_knob_buys_recall_and_not_only_bytes

test result: FAILED. 6 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 2.34s

*** result: Failure(101)
