*** crates/pstore-testkit/src/broken.rs:115:24: replace == with != in <impl BlobStore for Broken>::delete_batch

*** mutation diff:
--- crates/pstore-testkit/src/broken.rs
+++ replace == with != in <impl BlobStore for Broken>::delete_batch
@@ -107,17 +107,17 @@
                 .put(key, body)
                 .await
                 .map_err(|e| CasError::Io(e.to_string()));
         }
         self.inner.put_conditional(key, body, pre).await
     }
 
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
-        if self.defect == Defect::IgnoresDeletes {
+        if self.defect != /* ~ changed by cargo-mutants ~ */ Defect::IgnoresDeletes {
             return Ok(());
         }
         self.inner.delete_batch(keys).await
     }
 
     async fn list_unrestricted(&self, prefix: &Key) -> Result<Vec<Key>, BlobError> {
         self.inner.list_unrestricted(prefix).await
     }

---- a_broken_backend_forwards_everything_it_does_not_break stdout ----

thread 'a_broken_backend_forwards_everything_it_does_not_break' panicked at crates/pstore-testkit/tests/conformance.rs:202:5:
the defect is that deletes do nothing

---- the_suite_detects_each_defect_a_real_backend_actually_has stdout ----

thread 'the_suite_detects_each_defect_a_real_backend_actually_has' panicked at crates/pstore-testkit/tests/conformance.rs:163:9:
assertion `left == right` failed: IgnoresCreateIfAbsent tripped [Probe { name: "create_if_absent", outcome: Divergent("second create-if-absent succeeded; the wildcard precondition is ignored") }, Probe { name: "batch_delete", outcome: Divergent("a deleted key still returned a body") }]
  left: 2
 right: 1

failures:
    a_broken_backend_forwards_everything_it_does_not_break
    the_suite_detects_each_defect_a_real_backend_actually_has

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
