*** crates/pstore-testkit/src/broken.rs:115:9: replace <impl BlobStore for Broken>::delete_batch -> Result<(), BlobError> with Ok(())

*** mutation diff:
--- crates/pstore-testkit/src/broken.rs
+++ replace <impl BlobStore for Broken>::delete_batch -> Result<(), BlobError> with Ok(())
@@ -107,18 +107,15 @@
                 .put(key, body)
                 .await
                 .map_err(|e| CasError::Io(e.to_string()));
         }
         self.inner.put_conditional(key, body, pre).await
     }
 
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
-        if self.defect == Defect::IgnoresDeletes {
-            return Ok(());
-        }
-        self.inner.delete_batch(keys).await
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn list_unrestricted(&self, prefix: &Key) -> Result<Vec<Key>, BlobError> {
         self.inner.list_unrestricted(prefix).await
     }
 }

---- the_suite_detects_each_defect_a_real_backend_actually_has stdout ----

thread 'the_suite_detects_each_defect_a_real_backend_actually_has' panicked at crates/pstore-testkit/tests/conformance.rs:141:9:
assertion `left == right` failed: IgnoresCreateIfAbsent tripped [Probe { name: "create_if_absent", outcome: Divergent("second create-if-absent succeeded; the wildcard precondition is ignored") }, Probe { name: "batch_delete", outcome: Divergent("a deleted key still returned a body") }]
  left: 2
 right: 1

failures:
    the_suite_detects_each_defect_a_real_backend_actually_has

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
