*** crates/pstore-testkit/src/broken.rs:122:9: replace <impl BlobStore for Broken>::list_unrestricted -> Result<Vec<Key>, BlobError> with Ok(vec![])

*** mutation diff:
--- crates/pstore-testkit/src/broken.rs
+++ replace <impl BlobStore for Broken>::list_unrestricted -> Result<Vec<Key>, BlobError> with Ok(vec![])
@@ -114,11 +114,11 @@
     async fn delete_batch(&self, keys: &[Key]) -> Result<(), BlobError> {
         if self.defect == Defect::IgnoresDeletes {
             return Ok(());
         }
         self.inner.delete_batch(keys).await
     }
 
     async fn list_unrestricted(&self, prefix: &Key) -> Result<Vec<Key>, BlobError> {
-        self.inner.list_unrestricted(prefix).await
+        Ok(vec![]) /* ~ changed by cargo-mutants ~ */
     }
 }

---- a_broken_backend_forwards_everything_it_does_not_break stdout ----

thread 'a_broken_backend_forwards_everything_it_does_not_break' panicked at crates/pstore-testkit/tests/conformance.rs:177:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    a_broken_backend_forwards_everything_it_does_not_break

test result: FAILED. 7 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
