*** crates/pstore-testkit/src/broken.rs:76:9: replace <impl BlobStore for Broken>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-testkit/src/broken.rs
+++ replace <impl BlobStore for Broken>::get_suffix -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -68,20 +68,17 @@
             let start = (range.start as usize).min(body.len());
             let end = (range.end as usize).min(body.len());
             return Ok(body.slice(start..end));
         }
         self.inner.get_range(key, range).await
     }
 
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {
-        if self.defect == Defect::SuffixReturnsEverything {
-            return self.inner.get(key).await;
-        }
-        self.inner.get_suffix(key, n).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, CasTag), BlobError> {
         self.inner.get_with_tag(key).await
     }
 
     async fn get_tag(&self, key: &Key) -> Option<CasTag> {
         self.inner.get_tag(key).await

---- a_broken_backend_forwards_everything_it_does_not_break stdout ----

thread 'a_broken_backend_forwards_everything_it_does_not_break' panicked at crates/pstore-testkit/tests/conformance.rs:173:5:
assertion `left == right` failed
  left: []
 right: [55, 56, 57]

---- the_suite_detects_each_defect_a_real_backend_actually_has stdout ----

thread 'the_suite_detects_each_defect_a_real_backend_actually_has' panicked at crates/pstore-testkit/tests/conformance.rs:141:9:
assertion `left == right` failed: IgnoresCreateIfAbsent tripped [Probe { name: "create_if_absent", outcome: Divergent("second create-if-absent succeeded; the wildcard precondition is ignored") }, Probe { name: "suffix_read", outcome: Divergent("a 4-byte suffix returned 0 bytes: \"\"") }]
  left: 2
 right: 1

failures:
    a_broken_backend_forwards_everything_it_does_not_break
    the_suite_detects_each_defect_a_real_backend_actually_has

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
