*** crates/pstore-testkit/src/conformance.rs:191:24: replace match guard b.len() == want_len with true in probe_coalesced_read

*** mutation diff:
--- crates/pstore-testkit/src/conformance.rs
+++ replace match guard b.len() == want_len with true in probe_coalesced_read
@@ -183,17 +183,17 @@
         return Support::Divergent("get_ranges failed".to_owned());
     };
     if got.len() != 3 {
         return Support::Divergent(format!("expected 3 slices, got {}", got.len()));
     }
     for (i, r) in wanted.iter().enumerate() {
         let want_len = (r.end - r.start) as usize;
         match got.get(i) {
-            Some(b) if b.len() == want_len => {}
+            Some(b) if true /* ~ changed by cargo-mutants ~ */ => {}
             // Returning the merged buffer rather than each range's slice is the mutation
             // this catches, and a length-only check at the top level would miss it.
             Some(b) => {
                 return Support::Divergent(format!(
                     "slice {i} was {} bytes, wanted {want_len}",
                     b.len()
                 ));
             }

*** result: Success
