*** crates/pstore-testkit/src/conformance.rs:234:18: replace match guard b.len() == 10 with true in probe_suffix_read

*** mutation diff:
--- crates/pstore-testkit/src/conformance.rs
+++ replace match guard b.len() == 10 with true in probe_suffix_read
@@ -226,17 +226,17 @@
                 String::from_utf8_lossy(&b)
             ));
         }
         Err(e) => return Support::Divergent(format!("suffix read failed: {e}")),
     }
     // Asking for more than exists must return the object, not fail: a small segment is
     // shorter than the fixed suffix fetch, and that is the common case.
     match s.get_suffix(&key, 1000).await {
-        Ok(b) if b.len() == 10 => Support::Supported,
+        Ok(b) if true /* ~ changed by cargo-mutants ~ */ => Support::Supported,
         Ok(b) => Support::Divergent(format!("an oversized suffix returned {} bytes", b.len())),
         Err(e) => Support::Divergent(format!("an oversized suffix failed: {e}")),
     }
 }
 
 async fn probe_missing_key<S: BlobStore>(s: &S, run: u64) -> Support {
     // A 404 is a NORMAL answer, not an error: it is what bounds the WAL lane during
     // forward probing. A backend that hangs or 500s here breaks tail discovery.

*** result: Success
