*** crates/pstore-testkit/src/conformance.rs:234:18: replace match guard b.len() == 10 with false in probe_suffix_read

*** mutation diff:
--- crates/pstore-testkit/src/conformance.rs
+++ replace match guard b.len() == 10 with false in probe_suffix_read
@@ -226,17 +226,17 @@
                 String::from_utf8_lossy(&b)
             ));
         }
         Err(e) => return Support::Divergent(format!("suffix read failed: {e}")),
     }
     // Asking for more than exists must return the object, not fail: a small segment is
     // shorter than the fixed suffix fetch, and that is the common case.
     match s.get_suffix(&key, 1000).await {
-        Ok(b) if b.len() == 10 => Support::Supported,
+        Ok(b) if false /* ~ changed by cargo-mutants ~ */ => Support::Supported,
         Ok(b) => Support::Divergent(format!("an oversized suffix returned {} bytes", b.len())),
         Err(e) => Support::Divergent(format!("an oversized suffix failed: {e}")),
     }
 }
 
 async fn probe_missing_key<S: BlobStore>(s: &S, run: u64) -> Support {
     // A 404 is a NORMAL answer, not an error: it is what bounds the WAL lane during
     // forward probing. A backend that hangs or 500s here breaks tail discovery.

---- the_memory_store_conforms stdout ----

thread 'the_memory_store_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:25:5:
divergences: [Probe { name: "suffix_read", outcome: Divergent("an oversized suffix returned 10 bytes") }]

---- a_report_names_what_diverged stdout ----

thread 'a_report_names_what_diverged' panicked at crates/pstore-testkit/tests/conformance.rs:95:5:
  left: 2
 right: 1

---- every_decorator_conforms stdout ----

thread 'every_decorator_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:35:5:
assertion failed: conformance::run(&acc.as_tenant(TenantId(1)), 2).await.conforms()

failures:
    a_report_names_what_diverged
    every_decorator_conforms
    the_memory_store_conforms
    the_suite_detects_each_defect_a_real_backend_actually_has

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
