*** crates/pstore-testkit/src/conformance.rs:256:20: replace match guard t == put.tag with true in probe_get_tag

*** mutation diff:
--- crates/pstore-testkit/src/conformance.rs
+++ replace match guard t == put.tag with true in probe_get_tag
@@ -248,17 +248,17 @@
     if s.get_tag(&key).await.is_some() {
         return Support::Divergent("an absent key reported a tag".to_owned());
     }
     let Ok(put) = s.put(&key, Bytes::from_static(b"1")).await else {
         return Support::Unsupported;
     };
     match s.get_tag(&key).await {
         None => Support::Divergent("an existing key reported no tag".to_owned()),
-        Some(t) if t == put.tag => Support::Supported,
+        Some(t) if true /* ~ changed by cargo-mutants ~ */ => Support::Supported,
         Some(_) => {
             Support::Divergent("the tag did not match the one the write returned".to_owned())
         }
     }
 }
 
 async fn probe_missing_key<S: BlobStore>(s: &S, run: u64) -> Support {
     // A 404 is a NORMAL answer, not an error: it is what bounds the WAL lane during

*** result: Success
