*** crates/pstore-testkit/src/conformance.rs:256:22: replace == with != in probe_get_tag

*** mutation diff:
--- crates/pstore-testkit/src/conformance.rs
+++ replace == with != in probe_get_tag
@@ -248,17 +248,17 @@
     if s.get_tag(&key).await.is_some() {
         return Support::Divergent("an absent key reported a tag".to_owned());
     }
     let Ok(put) = s.put(&key, Bytes::from_static(b"1")).await else {
         return Support::Unsupported;
     };
     match s.get_tag(&key).await {
         None => Support::Divergent("an existing key reported no tag".to_owned()),
-        Some(t) if t == put.tag => Support::Supported,
+        Some(t) if t != /* ~ changed by cargo-mutants ~ */ put.tag => Support::Supported,
         Some(_) => {
             Support::Divergent("the tag did not match the one the write returned".to_owned())
         }
     }
 }
 
 async fn probe_missing_key<S: BlobStore>(s: &S, run: u64) -> Support {
     // A 404 is a NORMAL answer, not an error: it is what bounds the WAL lane during

---- a_report_names_what_diverged stdout ----

thread 'a_report_names_what_diverged' panicked at crates/pstore-testkit/tests/conformance.rs:117:5:
  left: 2
 right: 1

---- every_decorator_conforms stdout ----

thread 'every_decorator_conforms' panicked at crates/pstore-testkit/tests/conformance.rs:37:5:
assertion failed: conformance::run(&acc.as_tenant(TenantId(1)), 2).await.conforms()

---- the_suite_detects_each_defect_a_real_backend_actually_has stdout ----

thread 'the_suite_detects_each_defect_a_real_backend_actually_has' panicked at crates/pstore-testkit/tests/conformance.rs:163:9:
assertion `left == right` failed: IgnoresCreateIfAbsent tripped [Probe { name: "create_if_absent", outcome: Divergent("second create-if-absent succeeded; the wildcard precondition is ignored") }, Probe { name: "get_tag", outcome: Divergent("the tag did not match the one the write returned") }]
  left: 2
 right: 1

failures:
    a_report_names_what_diverged
    every_decorator_conforms
    the_memory_store_conforms
    the_suite_detects_each_defect_a_real_backend_actually_has

test result: FAILED. 4 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
