*** crates/pstore-testkit/src/conformance.rs:36:9: replace Report::conforms -> bool with true

*** mutation diff:
--- crates/pstore-testkit/src/conformance.rs
+++ replace Report::conforms -> bool with true
@@ -28,17 +28,17 @@
     /// The capability profile derived from the probes — **not** from `capabilities()`.
     pub observed: Capabilities,
 }
 
 impl Report {
     /// Whether every probe behaved as the specification requires.
     #[must_use]
     pub fn conforms(&self) -> bool {
-        self.probes.iter().all(|p| p.outcome == Support::Supported)
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// The probes that did not.
     #[must_use]
     pub fn divergences(&self) -> Vec<&Probe> {
         self.probes
             .iter()
             .filter(|p| p.outcome != Support::Supported)

---- the_suite_detects_a_backend_that_is_not_fenced stdout ----

thread 'the_suite_detects_a_backend_that_is_not_fenced' panicked at crates/pstore-testkit/tests/conformance.rs:80:5:
an ABA-prone backend must not be reported as conforming

---- the_suite_detects_each_defect_a_real_backend_actually_has stdout ----

thread 'the_suite_detects_each_defect_a_real_backend_actually_has' panicked at crates/pstore-testkit/tests/conformance.rs:154:9:
IgnoresCreateIfAbsent was reported as conforming

failures:
    the_suite_detects_a_backend_that_is_not_fenced
    the_suite_detects_each_defect_a_real_backend_actually_has

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
