*** crates/pstore-testkit/src/conformance.rs:42:9: replace Report::divergences -> Vec<&Probe> with vec![]

*** mutation diff:
--- crates/pstore-testkit/src/conformance.rs
+++ replace Report::divergences -> Vec<&Probe> with vec![]
@@ -34,20 +34,17 @@
     #[must_use]
     pub fn conforms(&self) -> bool {
         self.probes.iter().all(|p| p.outcome == Support::Supported)
     }
 
     /// The probes that did not.
     #[must_use]
     pub fn divergences(&self) -> Vec<&Probe> {
-        self.probes
-            .iter()
-            .filter(|p| p.outcome != Support::Supported)
-            .collect()
+        vec![] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 fn k(run: u64, s: &str) -> Key {
     // Namespaced per run so a suite can be pointed at a shared bucket without two runs
     // colliding -- which is how this will be used against a real cloud in M0b.
     Key::new(format!("conformance/{run}/{s}"))
 }

---- a_report_names_what_diverged stdout ----

thread 'a_report_names_what_diverged' panicked at crates/pstore-testkit/tests/conformance.rs:95:5:
assertion `left == right` failed: expected exactly one divergence, got []
  left: 0
 right: 1

---- the_suite_detects_each_defect_a_real_backend_actually_has stdout ----

thread 'the_suite_detects_each_defect_a_real_backend_actually_has' panicked at crates/pstore-testkit/tests/conformance.rs:141:9:
assertion `left == right` failed: IgnoresCreateIfAbsent tripped []
  left: 0
 right: 1

failures:
    a_report_names_what_diverged
    the_suite_detects_each_defect_a_real_backend_actually_has

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
