*** crates/pstore-testkit/src/depth.rs:105:9: replace <impl pstore_blob::BlobStore for DepthCounting<S>>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())

*** mutation diff:
--- crates/pstore-testkit/src/depth.rs
+++ replace <impl pstore_blob::BlobStore for DepthCounting<S>>::get_range -> Result<Bytes, BlobError> with Ok(Default::default())
@@ -97,18 +97,17 @@
     }
 
     async fn get(&self, key: &Key) -> Result<Bytes, BlobError> {
         let _g = self.begin_async().await;
         self.inner.get(key).await
     }
 
     async fn get_range(&self, key: &Key, range: std::ops::Range<u64>) -> Result<Bytes, BlobError> {
-        let _g = self.begin_async().await;
-        self.inner.get_range(key, range).await
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn get_with_tag(&self, key: &Key) -> Result<(Bytes, CasTag), BlobError> {
         let _g = self.begin_async().await;
         self.inner.get_with_tag(key).await
     }
 
     async fn get_suffix(&self, key: &Key, n: u64) -> Result<Bytes, BlobError> {

---- the_depth_decorator_forwards_the_whole_contract stdout ----

thread 'the_depth_decorator_forwards_the_whole_contract' panicked at /home/tuong/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/bytes-1.12.1/src/bytes.rs:374:28:
range end out of bounds: 4 <= 0

---- get_ranges_fans_out_rather_than_looping stdout ----

thread 'get_ranges_fans_out_rather_than_looping' panicked at /home/tuong/.cargo/registry/src/index.crates.io-1949cf8c6b5b557f/bytes-1.12.1/src/bytes.rs:374:28:
range end out of bounds: 16 <= 0

failures:
    get_ranges_fans_out_rather_than_looping
    the_depth_decorator_forwards_the_whole_contract

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
