*** crates/pstore-testkit/src/depth.rs:125:9: replace <impl pstore_blob::BlobStore for DepthCounting<S>>::head -> Result<u64, BlobError> with Ok(1)

*** mutation diff:
--- crates/pstore-testkit/src/depth.rs
+++ replace <impl pstore_blob::BlobStore for DepthCounting<S>>::head -> Result<u64, BlobError> with Ok(1)
@@ -117,18 +117,17 @@
     }
 
     async fn get_tag(&self, key: &Key) -> Option<CasTag> {
         let _g = self.begin_async().await;
         self.inner.get_tag(key).await
     }
 
     async fn head(&self, key: &Key) -> Result<u64, BlobError> {
-        let _g = self.begin_async().await;
-        self.inner.head(key).await
+        Ok(1) /* ~ changed by cargo-mutants ~ */
     }
 
     async fn put(&self, key: &Key, body: Bytes) -> Result<PutOutcome, BlobError> {
         let _g = self.begin_async().await;
         self.inner.put(key, body).await
     }
 
     async fn put_conditional(

*** result: Success
