*** crates/pstore-testkit/src/depth.rs:38:9: replace <impl Drop for Guard>::drop with ()

*** mutation diff:
--- crates/pstore-testkit/src/depth.rs
+++ replace <impl Drop for Guard>::drop with ()
@@ -30,17 +30,17 @@
     c: Arc<Counters>,
 }
 
 /// Held for the life of one request, so depth is recorded even if the request fails.
 struct Guard(Arc<Counters>);
 
 impl Drop for Guard {
     fn drop(&mut self) {
-        self.0.in_flight.fetch_sub(1, Ordering::SeqCst);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl<S: pstore_blob::BlobStore> DepthCounting<S> {
     /// Wraps `inner`.
     pub fn new(inner: S) -> Self {
         Self {
             inner: Arc::new(inner),

---- concurrent_fan_out_counts_once stdout ----

thread 'concurrent_fan_out_counts_once' panicked at crates/pstore-testkit/tests/depth.rs:45:5:
assertion `left == right` failed: eight concurrent reads are one round trip
  left: 0
 right: 1

---- a_loop_that_awaits_each_result_counts_every_iteration stdout ----

thread 'a_loop_that_awaits_each_result_counts_every_iteration' panicked at crates/pstore-testkit/tests/depth.rs:29:5:
assertion `left == right` failed
  left: 0
 right: 4

---- get_ranges_fans_out_rather_than_looping stdout ----

thread 'get_ranges_fans_out_rather_than_looping' panicked at crates/pstore-testkit/tests/depth.rs:79:5:
assertion `left == right` failed: but they must cost ONE round trip
  left: 0
 right: 1

failures:
    a_loop_that_awaits_each_result_counts_every_iteration
    concurrent_fan_out_counts_once
    get_ranges_fans_out_rather_than_looping

test result: FAILED. 3 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
