*** crates/pstore-testkit/src/depth.rs:54:9: replace DepthCounting<S>::depth -> usize with 0

*** mutation diff:
--- crates/pstore-testkit/src/depth.rs
+++ replace DepthCounting<S>::depth -> usize with 0
@@ -46,17 +46,17 @@
             inner: Arc::new(inner),
             c: Arc::new(Counters::default()),
         }
     }
 
     /// Sequential rounds observed since [`Self::reset`].
     #[must_use]
     pub fn depth(&self) -> usize {
-        self.c.depth.load(Ordering::SeqCst)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Total requests, however issued. Depth's denominator, and the cost figure.
     #[must_use]
     pub fn requests(&self) -> usize {
         self.c.requests.load(Ordering::SeqCst)
     }

---- reset_clears_both_counters stdout ----

thread 'reset_clears_both_counters' panicked at crates/pstore-testkit/tests/depth.rs:98:5:
assertion failed: s.requests() > 0 && s.depth() > 0

---- a_loop_that_awaits_each_result_counts_every_iteration stdout ----

thread 'a_loop_that_awaits_each_result_counts_every_iteration' panicked at crates/pstore-testkit/tests/depth.rs:29:5:
assertion `left == right` failed
  left: 0
 right: 4

---- a_failed_request_still_counts stdout ----

thread 'a_failed_request_still_counts' panicked at crates/pstore-testkit/tests/depth.rs:54:5:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    a_failed_request_still_counts
    a_loop_that_awaits_each_result_counts_every_iteration
    concurrent_fan_out_counts_once
    get_ranges_fans_out_rather_than_looping
    reset_clears_both_counters

test result: FAILED. 1 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
