*** crates/pstore-testkit/src/depth.rs:54:9: replace DepthCounting<S>::depth -> usize with 1

*** mutation diff:
--- crates/pstore-testkit/src/depth.rs
+++ replace DepthCounting<S>::depth -> usize with 1
@@ -46,17 +46,17 @@
             inner: Arc::new(inner),
             c: Arc::new(Counters::default()),
         }
     }
 
     /// Sequential rounds observed since [`Self::reset`].
     #[must_use]
     pub fn depth(&self) -> usize {
-        self.c.depth.load(Ordering::SeqCst)
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Total requests, however issued. Depth's denominator, and the cost figure.
     #[must_use]
     pub fn requests(&self) -> usize {
         self.c.requests.load(Ordering::SeqCst)
     }

---- reset_clears_both_counters stdout ----

thread 'reset_clears_both_counters' panicked at crates/pstore-testkit/tests/depth.rs:101:5:
assertion `left == right` failed
  left: 1
 right: 0

---- a_loop_that_awaits_each_result_counts_every_iteration stdout ----

thread 'a_loop_that_awaits_each_result_counts_every_iteration' panicked at crates/pstore-testkit/tests/depth.rs:29:5:
assertion `left == right` failed
  left: 1
 right: 4

failures:
    a_loop_that_awaits_each_result_counts_every_iteration
    reset_clears_both_counters

test result: FAILED. 4 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
