*** crates/pstore-testkit/src/depth.rs:60:9: replace DepthCounting<S>::requests -> usize with 0

*** mutation diff:
--- crates/pstore-testkit/src/depth.rs
+++ replace DepthCounting<S>::requests -> usize with 0
@@ -52,17 +52,17 @@
     #[must_use]
     pub fn depth(&self) -> usize {
         self.c.depth.load(Ordering::SeqCst)
     }
 
     /// Total requests, however issued. Depth's denominator, and the cost figure.
     #[must_use]
     pub fn requests(&self) -> usize {
-        self.c.requests.load(Ordering::SeqCst)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Clears both counters, so a test can measure one operation rather than a session.
     pub fn reset(&self) {
         self.c.depth.store(0, Ordering::SeqCst);
         self.c.requests.store(0, Ordering::SeqCst);
     }

---- the_whole_flow_stays_inside_its_request_budget stdout ----

thread 'the_whole_flow_stays_inside_its_request_budget' panicked at crates/pstore-engine/tests/end_to_end.rs:108:9:
assertion `left == right` failed: a batch cost 0 requests
  left: 0
 right: 3

failures:
    the_whole_flow_stays_inside_its_request_budget

test result: FAILED. 1 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
