*** crates/pstore-testkit/src/flaky.rs:108:23: replace ^ with & in Flaky::refuse

*** mutation diff:
--- crates/pstore-testkit/src/flaky.rs
+++ replace ^ with & in Flaky::refuse
@@ -100,17 +100,17 @@
             return false;
         }
         let mut z = self
             .state
             .fetch_add(0x9E37_79B9_7F4A_7C15, Ordering::Relaxed)
             .wrapping_add(0x9E37_79B9_7F4A_7C15);
         z = (z ^ (z >> 30)).wrapping_mul(0xBF58_476D_1CE4_E5B9);
         z = (z ^ (z >> 27)).wrapping_mul(0x94D0_49BB_1331_11EB);
-        let draw = (z ^ (z >> 31)) >> 32;
+        let draw = (z & /* ~ changed by cargo-mutants ~ */ (z >> 31)) >> 32;
         if draw < self.rate {
             self.failures.fetch_add(1, Ordering::Relaxed);
             return true;
         }
         false
     }
 
     /// A store whose reads all fail.

---- recovery_finds_every_unfolded_record_across_seeds stdout ----

thread 'recovery_finds_every_unfolded_record_across_seeds' panicked at crates/pstore-engine/tests/oq91.rs:177:5:
only 0 rows acknowledged

failures:
    recovery_finds_every_unfolded_record_across_seeds

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
