*** crates/pstore-testkit/src/flaky.rs:66:9: replace Flaky::refusing -> Self with Default::default()

*** mutation diff:
--- crates/pstore-testkit/src/flaky.rs
+++ replace Flaky::refusing -> Self with Default::default()
@@ -58,26 +58,17 @@
     }
 
     /// A store that refuses exactly the writes at these ordinals and no others.
     ///
     /// A seeded rate proves a property holds *in general*; this pins the one interleaving
     /// a regression test is about, so a failure names the bug instead of a seed.
     #[must_use]
     pub fn refusing(at: &[u64]) -> Self {
-        Self {
-            inner: MemoryStore::new(),
-            state: AtomicU64::new(0),
-            rate: 0,
-            at: at.to_vec(),
-            reads_fail: false,
-            always_contended: false,
-            seen: AtomicU64::new(0),
-            failures: Arc::new(AtomicU64::new(0)),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// How many writes have been refused, so a test can assert it actually injected.
     #[must_use]
     pub fn failures(&self) -> u64 {
         self.failures.load(Ordering::Relaxed)
     }

error[E0277]: the trait bound `Flaky: Default` is not satisfied
  --> crates/pstore-testkit/src/flaky.rs:66:9
   |
66 |         Default::default() /* ~ changed by cargo-mutants ~ */
   |         ^^^^^^^^^^^^^^^^^^ the trait `Default` is not implemented for `Flaky`
   |
help: consider annotating `Flaky` with `#[derive(Default)]`
   |
21 + #[derive(Default)]
22 | pub struct Flaky {
   |

*** result: Failure(101)
