*** crates/pstore-testkit/src/flaky.rs:81:9: replace Flaky::failures -> u64 with 0

*** mutation diff:
--- crates/pstore-testkit/src/flaky.rs
+++ replace Flaky::failures -> u64 with 0
@@ -73,17 +73,17 @@
             seen: AtomicU64::new(0),
             failures: Arc::new(AtomicU64::new(0)),
         }
     }
 
     /// How many writes have been refused, so a test can assert it actually injected.
     #[must_use]
     pub fn failures(&self) -> u64 {
-        self.failures.load(Ordering::Relaxed)
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// SplitMix64 over an atomic, so concurrent writers still draw deterministically from
     /// one stream. The *order* they draw in is the scheduler's business, not this store's.
     fn refuse(&self) -> bool {
         let ordinal = self.seen.fetch_add(1, Ordering::Relaxed);
         if self.at.contains(&ordinal) {
             self.failures.fetch_add(1, Ordering::Relaxed);

---- a_backend_that_cannot_evaluate_the_condition_is_retried_and_then_reported stdout ----

thread 'a_backend_that_cannot_evaluate_the_condition_is_retried_and_then_reported' panicked at crates/pstore-engine/tests/failures.rs:145:5:
it gave up without retrying

---- a_failed_registry_read_is_an_error_not_an_empty_registry stdout ----

thread 'a_failed_registry_read_is_an_error_not_an_empty_registry' panicked at crates/pstore-engine/tests/failures.rs:46:5:
assertion failed: store.failures() > 0

failures:
    a_backend_that_cannot_evaluate_the_condition_is_retried_and_then_reported
    a_failed_registry_read_is_an_error_not_an_empty_registry

test result: FAILED. 6 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
