*** crates/pstore-testkit/src/flaky.rs:92:22: replace == with != in Flaky::refuse

*** mutation diff:
--- crates/pstore-testkit/src/flaky.rs
+++ replace == with != in Flaky::refuse
@@ -84,17 +84,17 @@
     /// SplitMix64 over an atomic, so concurrent writers still draw deterministically from
     /// one stream. The *order* they draw in is the scheduler's business, not this store's.
     fn refuse(&self) -> bool {
         let ordinal = self.seen.fetch_add(1, Ordering::Relaxed);
         if self.at.contains(&ordinal) {
             self.failures.fetch_add(1, Ordering::Relaxed);
             return true;
         }
-        if self.rate == 0 {
+        if self.rate != /* ~ changed by cargo-mutants ~ */ 0 {
             return false;
         }
         let mut z = self
             .state
             .fetch_add(0x9E37_79B9_7F4A_7C15, Ordering::Relaxed)
             .wrapping_add(0x9E37_79B9_7F4A_7C15);
         z = (z ^ (z >> 30)).wrapping_mul(0xBF58_476D_1CE4_E5B9);
         z = (z ^ (z >> 27)).wrapping_mul(0x94D0_49BB_1331_11EB);

*** result: Success
