*** crates/pstore-testkit/src/flaky.rs:94:9: replace Flaky::refuse -> bool with false

*** mutation diff:
--- crates/pstore-testkit/src/flaky.rs
+++ replace Flaky::refuse -> bool with false
@@ -86,36 +86,17 @@
     #[must_use]
     pub fn failures(&self) -> u64 {
         self.failures.load(Ordering::Relaxed)
     }
 
     /// SplitMix64 over an atomic, so concurrent writers still draw deterministically from
     /// one stream. The *order* they draw in is the scheduler's business, not this store's.
     fn refuse(&self) -> bool {
-        let ordinal = self.seen.fetch_add(1, Ordering::Relaxed);
-        if self.at.contains(&ordinal) {
-            self.failures.fetch_add(1, Ordering::Relaxed);
-            return true;
-        }
-        if self.rate == 0 {
-            return false;
-        }
-        let mut z = self
-            .state
-            .fetch_add(0x9E37_79B9_7F4A_7C15, Ordering::Relaxed)
-            .wrapping_add(0x9E37_79B9_7F4A_7C15);
-        z = (z ^ (z >> 30)).wrapping_mul(0xBF58_476D_1CE4_E5B9);
-        z = (z ^ (z >> 27)).wrapping_mul(0x94D0_49BB_1331_11EB);
-        let draw = (z ^ (z >> 31)) >> 32;
-        if draw < self.rate {
-            self.failures.fetch_add(1, Ordering::Relaxed);
-            return true;
-        }
-        false
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// A store whose reads all fail.
     #[must_use]
     pub fn refusing_reads() -> Self {
         Self {
             reads_fail: true,
             ..Self::refusing(&[])

---- a_cas_storm_still_converges stdout ----

thread 'a_cas_storm_still_converges' panicked at crates/pstore-engine/tests/linearizability.rs:215:5:
the storm injected no faults

failures:
    a_cas_storm_still_converges

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 1.14s

*** result: Failure(101)
