*** crates/pstore-testkit/src/gated.rs:43:9: replace Gated::arm with ()

*** mutation diff:
--- crates/pstore-testkit/src/gated.rs
+++ replace Gated::arm with ()
@@ -35,17 +35,17 @@
             n,
             armed: std::sync::atomic::AtomicBool::new(false),
         }
     }
 
     /// Starts gating. Setting up a scenario takes writes of its own, and counting those
     /// against the barrier would release it before the racers ever arrive.
     pub fn arm(&self) {
-        self.armed.store(true, Ordering::SeqCst);
+        () /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[async_trait::async_trait]
 impl BlobStore for Gated {
     fn capabilities(&self) -> &Capabilities {
         self.inner.capabilities()
     }

*** result: Success
