*** crates/pstore-testkit/src/sim.rs:40:9: replace Sim::steps -> u64 with 1

*** mutation diff:
--- crates/pstore-testkit/src/sim.rs
+++ replace Sim::steps -> u64 with 1
@@ -32,17 +32,17 @@
     pub fn seed(&self) -> u64 {
         self.seed
     }
 
     /// Decisions taken so far. Two runs of the same scenario must agree on this, or
     /// something is reading the clock.
     #[must_use]
     pub fn steps(&self) -> u64 {
-        self.steps
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// SplitMix64, written out so determinism is visible in the source rather than
     /// dependent on a crate's version.
     fn next(&mut self) -> u64 {
         self.steps += 1;
         self.state = self.state.wrapping_add(0x9E37_79B9_7F4A_7C15);
         let mut z = self.state;

*** result: Success
