*** crates/pstore-testkit/src/sim.rs:46:20: replace += with -= in Sim::next

*** mutation diff:
--- crates/pstore-testkit/src/sim.rs
+++ replace += with -= in Sim::next
@@ -38,17 +38,17 @@
     #[must_use]
     pub fn steps(&self) -> u64 {
         self.steps
     }
 
     /// SplitMix64, written out so determinism is visible in the source rather than
     /// dependent on a crate's version.
     fn next(&mut self) -> u64 {
-        self.steps += 1;
+        self.steps -= /* ~ changed by cargo-mutants ~ */ 1;
         self.state = self.state.wrapping_add(0x9E37_79B9_7F4A_7C15);
         let mut z = self.state;
         z = (z ^ (z >> 30)).wrapping_mul(0xBF58_476D_1CE4_E5B9);
         z = (z ^ (z >> 27)).wrapping_mul(0x94D0_49BB_1331_11EB);
         z ^ (z >> 31)
     }
 
     /// One of `n`, uniformly.

---- recovery_finds_every_unfolded_record_across_seeds stdout ----

thread 'recovery_finds_every_unfolded_record_across_seeds' panicked at crates/pstore-testkit/src/sim.rs:46:9:
attempt to subtract with overflow

failures:
    recovery_finds_every_unfolded_record_across_seeds

test result: FAILED. 2 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
