*** crates/pstore-testkit/src/sim.rs:72:9: replace Sim::shuffle with ()

*** mutation diff:
--- crates/pstore-testkit/src/sim.rs
+++ replace Sim::shuffle with ()
@@ -64,14 +64,11 @@
 
     /// True with probability `p`.
     pub fn chance(&mut self, p: f64) -> bool {
         ((self.next() >> 11) as f64) / ((1u64 << 53) as f64) < p
     }
 
     /// A deterministic shuffle, for turning a set of pending actions into an order.
     pub fn shuffle<T>(&mut self, items: &mut [T]) {
-        for i in (1..items.len()).rev() {
-            let j = self.choose(i + 1);
-            items.swap(i, j);
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 }

---- shuffle_can_move_every_element_to_every_position stdout ----

thread 'shuffle_can_move_every_element_to_every_position' panicked at crates/pstore-testkit/tests/sim.rs:169:9:
value 0 never reached some position: [true, false, false, false, false, false]

---- choose_stays_in_range_and_shuffle_is_a_permutation stdout ----

thread 'choose_stays_in_range_and_shuffle_is_a_permutation' panicked at crates/pstore-testkit/tests/sim.rs:57:5:
assertion `left != right` failed: a shuffle that never moves is not one
  left: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49]
 right: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49]

failures:
    choose_stays_in_range_and_shuffle_is_a_permutation
    shuffle_can_move_every_element_to_every_position

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
