*** crates/pstore-testkit/src/sweep.rs:105:22: replace += with *= in contention_point

*** mutation diff:
--- crates/pstore-testkit/src/sweep.rs
+++ replace += with *= in contention_point
@@ -97,17 +97,17 @@
             }
             (attempts, lost)
         }));
     }
 
     let (mut attempts, mut lost) = (0u64, 0u64);
     for t in tasks {
         if let Ok((a, l)) = t.await {
-            attempts += a;
+            attempts *= /* ~ changed by cargo-mutants ~ */ a;
             lost += l;
         }
     }
     Point {
         writers,
         commits_each,
         attempts,
         commits: (writers * commits_each) as u64,

---- a_single_writer_never_contends stdout ----

thread 'a_single_writer_never_contends' panicked at crates/pstore-testkit/tests/sweep.rs:68:5:
assertion `left == right` failed
  left: 0
 right: 20

---- sweep_reports_a_curve_not_a_point stdout ----

thread 'sweep_reports_a_curve_not_a_point' panicked at crates/pstore-testkit/tests/sweep.rs:30:9:
attempts cannot be fewer than commits

failures:
    a_single_writer_never_contends
    sweep_reports_a_curve_not_a_point

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
