*** crates/pstore-testkit/src/sweep.rs:113:27: replace * with / in contention_point

*** mutation diff:
--- crates/pstore-testkit/src/sweep.rs
+++ replace * with / in contention_point
@@ -105,17 +105,17 @@
             attempts += a;
             lost += l;
         }
     }
     Point {
         writers,
         commits_each,
         attempts,
-        commits: (writers * commits_each) as u64,
+        commits: (writers / /* ~ changed by cargo-mutants ~ */ commits_each) as u64,
         lost,
     }
 }
 
 /// Sweeps contention across `levels`, returning one [`Point`] each.
 pub async fn contention_sweep<S: BlobStore>(
     store: Arc<S>,
     levels: &[usize],

---- a_single_writer_never_contends stdout ----

thread 'a_single_writer_never_contends' panicked at crates/pstore-testkit/tests/sweep.rs:69:5:
assertion `left == right` failed: every attempt landed
  left: 20
 right: 0

---- sweep_reports_a_curve_not_a_point stdout ----

thread 'sweep_reports_a_curve_not_a_point' panicked at crates/pstore-testkit/tests/sweep.rs:29:9:
assertion `left == right` failed
  left: 0
 right: 4

failures:
    a_single_writer_never_contends
    sweep_reports_a_curve_not_a_point

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
