*** crates/pstore-testkit/src/sweep.rs:124:5: replace contention_sweep -> Vec<Point> with vec![]

*** mutation diff:
--- crates/pstore-testkit/src/sweep.rs
+++ replace contention_sweep -> Vec<Point> with vec![]
@@ -116,23 +116,17 @@
 }
 
 /// Sweeps contention across `levels`, returning one [`Point`] each.
 pub async fn contention_sweep<S: BlobStore>(
     store: Arc<S>,
     levels: &[usize],
     commits_each: usize,
 ) -> Vec<Point> {
-    let mut out = Vec::with_capacity(levels.len());
-    for (i, w) in levels.iter().enumerate() {
-        // A fresh key per level, so one level's final state cannot bias the next.
-        let key = Key::new(format!("sweep/contention/{i}"));
-        out.push(contention_point(Arc::clone(&store), key, *w, commits_each).await);
-    }
-    out
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 /// Renders a sweep as a table, with the caveat attached rather than left to a reader.
 #[must_use]
 pub fn render(points: &[Point]) -> String {
     let mut s = String::from(
         "writers  commits  attempts  lost  attempts/commit  success\n\
          -------  -------  --------  ----  ---------------  -------\n",

---- sweep_reports_a_curve_not_a_point stdout ----

thread 'sweep_reports_a_curve_not_a_point' panicked at crates/pstore-testkit/tests/sweep.rs:20:5:
assertion `left == right` failed: a sweep is several points; one number is a guess
  left: 0
 right: 4

failures:
    sweep_reports_a_curve_not_a_point

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
