*** crates/pstore-testkit/src/sweep.rs:136:5: replace render -> String with "xyzzy".into()

*** mutation diff:
--- crates/pstore-testkit/src/sweep.rs
+++ replace render -> String with "xyzzy".into()
@@ -128,29 +128,10 @@
         out.push(contention_point(Arc::clone(&store), key, *w, commits_each).await);
     }
     out
 }
 
 /// Renders a sweep as a table, with the caveat attached rather than left to a reader.
 #[must_use]
 pub fn render(points: &[Point]) -> String {
-    let mut s = String::from(
-        "writers  commits  attempts  lost  attempts/commit  success\n\
-         -------  -------  --------  ----  ---------------  -------\n",
-    );
-    for p in points {
-        s.push_str(&format!(
-            "{:>7}  {:>7}  {:>8}  {:>4}  {:>15.2}  {:>6.1}%\n",
-            p.writers,
-            p.commits,
-            p.attempts,
-            p.lost,
-            p.attempts_per_commit(),
-            p.success_rate() * 100.0
-        ));
-    }
-    s.push_str(
-        "\nPROVISIONAL: this is our commit protocol against an in-process store, not S3.\n\
-         The SHAPE is the deliverable; the position of the real operating point is M0b.\n",
-    );
-    s
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }

---- the_rendered_table_carries_its_own_caveat stdout ----

thread 'the_rendered_table_carries_its_own_caveat' panicked at crates/pstore-testkit/tests/sweep.rs:109:5:
assertion failed: out.contains("attempts/commit")

failures:
    the_rendered_table_carries_its_own_caveat

test result: FAILED. 3 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
