*** crates/pstore-testkit/src/sweep.rs:49:26: replace == with != in Point::success_rate

*** mutation diff:
--- crates/pstore-testkit/src/sweep.rs
+++ replace == with != in Point::success_rate
@@ -41,17 +41,17 @@
             return f64::INFINITY;
         }
         self.attempts as f64 / self.commits as f64
     }
 
     /// Fraction of CAS calls that landed.
     #[must_use]
     pub fn success_rate(&self) -> f64 {
-        if self.attempts == 0 {
+        if self.attempts != /* ~ changed by cargo-mutants ~ */ 0 {
             return 0.0;
         }
         self.commits as f64 / self.attempts as f64
     }
 }
 
 /// Runs the real commit loop — read, rebase, CAS, retry — with `writers` racing for one
 /// key until each has landed `commits_each`.

---- a_point_with_no_commits_is_infinite_not_a_divide_by_zero stdout ----

thread 'a_point_with_no_commits_is_infinite_not_a_divide_by_zero' panicked at crates/pstore-testkit/tests/sweep.rs:97:5:
no attempts is 0%, not NaN

---- a_single_writer_never_contends stdout ----

thread 'a_single_writer_never_contends' panicked at crates/pstore-testkit/tests/sweep.rs:70:5:
100%, not 20 or 400

---- sweep_reports_a_curve_not_a_point stdout ----

thread 'sweep_reports_a_curve_not_a_point' panicked at crates/pstore-testkit/tests/sweep.rs:60:5:
assertion failed: (busy.success_rate() - rate).abs() < f64::EPSILON

failures:
    a_point_with_no_commits_is_infinite_not_a_divide_by_zero
    a_single_writer_never_contends
    sweep_reports_a_curve_not_a_point

test result: FAILED. 1 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
